{
  "content": "We're excited to announce that GitLab and Accenture have signed a global reseller agreement, establishing Accenture as an authorized GitLab reseller and Professional Services Provider. This agreement enables Accenture to provide GitLab's complete DevSecOps platform directly to customers through multiple fulfillment channels, including the AWS Marketplace.\nA milestone in collaboration\nThis collaboration combines GitLab's comprehensive, intelligent DevSecOps platform with Accenture's extensive expertise in digital transformation and implementation services, enabling organizations to build and deliver secure software at scale. The global reseller agreement provides a global framework that can be easily adapted to local conditions.\nThe collaboration will initially focus on several key areas:\nEnterprise-scale DevSecOps Transformation:\nHelping organizations modernize their development practices and streamline their software delivery lifecycle\nMainframe Modernization:\nAssisting customers with migrating from legacy systems\nGitLab Duo with Amazon Q:\nOffering AI-driven software development to organizations looking to accelerate development velocity while maintaining end-to-end security and compliance\nLooking ahead\nWe’re looking forward to helping our joint customers accelerate innovation, streamline development processes, and strengthen their security posture to achieve their business objectives more effectively.\nFor more information about how GitLab and Accenture can help your organization, please\nvisit our partner site\nor contact your Accenture or GitLab representative.",
  "metadata": {
    "title": "GitLab and Accenture announce Global Reseller Agreement",
    "url": "https://about.gitlab.com/blog/gitlab-and-accenture-announce-global-reseller-agreement/",
    "published": "2025-09-15T00:00:00.000Z",
    "updated": "2025-09-15T00:00:00.000Z",
    "author": "GitLab",
    "categories": [],
    "summary": "<p>We're excited to announce that GitLab and Accenture have signed a global reseller agreement, establishing Accenture as an authorized GitLab reseller and Professional Services Provider. This agreement enables Accenture to provide GitLab's complete DevSecOps platform directly to customers through multiple fulfillment channels, including the AWS Marketplace.</p>\n<h2>A milestone in collaboration</h2>\n<p>This collaboration combines GitLab's comprehensive, intelligent DevSecOps platform with Accent",
    "fetched_at": "2025-10-24T18:28:06.854575",
    "source": "gitlab_blog"
  },
  "processing": {
    "content_length": 1590,
    "word_count": 200,
    "is_relevant": true
  }
}