{
  "content": "GitLab has been recognized for the second time as a Leader in the 2025 GartnerÂ® Magic Quadrantâ¢ for AI Code Assistants. We see this recognition as validation of a key pillar in our broader AI strategy, where intelligent code assistance evolves into comprehensive AI that transforms how entire teams plan, build, secure, and deploy software.\nDownload the report.\nFrom AI features to intelligent collaboration\nThe Gartner evaluation, we feel, focused on GitLab Duo's generative AI code assistance capabilities. While GitLab Duo began as an AI add-on to the GitLab DevSecOps platform, it laid the groundwork for where we are going today with agentic AI built natively into the GitLab DevSecOps platform.\nGitLab Duo Agent Platform enables developers to work alongside multiple AI agents that automate tasks across the software lifecycle. Agents collaborate with each other and with humans, using GitLabâs Knowledge Graph to act with full project context. This empowers teams to move faster while keeping visibility and control.\nSpecialized agents\nhandle tasks such as code generation, security analysis, and research in parallel.\nKnowledge Graph\nconnects agents to a unified system of record across code, issues, pipelines, and compliance data.\nHuman + agent collaboration\nhappens through natural-language chat and customizable flows, with review and oversight built in.\nInteroperability with external tools and systems\nis supported through Model Context Protocol (MCP) and agent-to-agent frameworks.\nWith agents handling routine work under human guidance, teams can move faster, focus on higher-value tasks, and keep projects secure and compliant.\nSecure by design, flexible in practice\nThe GitLab Duo Agent Platform is designed to keep security and compliance front and center. Agents run inside GitLabâs trusted DevSecOps environment, with every action visible and reviewable before changes are made. Secure integrations help ensure credentials and sensitive data are handled safely, while interoperability through open standards connects agents to external tools without exposing an organization to risk.\nThe platform gives teams confidence that AI is enhancing productivity without compromising governance. Here's how:\nDevelopers\ncan stay focused on complex, high-impact work, while handing off routine tasks to agents for faster results and more granular context delivered through their existing workflows.\nEngineering leaders\ngain visibility into how work moves across the lifecycle, with agents operating within clear guardrails. They also can ensure their teams stay aligned to priorities and simplify onboarding with guided support through agent-driven context and workflows.\nIT organizations\nmaintain control over agent activity with governance features that enforce coding and security policies, offer model selection flexibility, and ensure secure interoperability â all while keeping humans in the loop.\nLeading the move to AI-native development\nGitLab continues to build on the vision that began with Duo, and will continue to expand GitLab Duo Agent Platform with new agents, advanced workflows, and more orchestration capabilities. This commitment to innovation ensures you can amplify team productivity on the platform you know and trust. Stay tuned for exciting updates on our roadmap as we continue to revolutionize AI-native DevSecOps.\nDownload the 2025 GartnerÂ® Magic Quadrantâ¢ for AI Code Assistants\nand\ntry GitLab Duo Agent Platform today\n.\nSource: Gartner, Magic Quadrant for AI Code Assistants, Philip Walsh, Haritha Khandabattu, Matt Brasier, Keith Holloway, Arun Batchu, 15 September 2025\nGARTNER is a registered trademark and service mark of Gartner, Inc. and/or its affiliates in the U.S. and internationally, and MAGIC QUADRANT is a registered trademark of Gartner, Inc. and/or its affiliates and are used herein with permission. All rights reserved.\nGartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartnerâs research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.\nThis graphic was published by Gartner Inc. as part of a larger report and should be evaluated in the context of the entire document. The Gartner document is available upon request from Gartner B.V.",
  "metadata": {
    "title": "GitLab named a Leader in the 2025 Gartner Magic Quadrant for AI Code Assistants",
    "url": "https://about.gitlab.com/blog/gitlab-named-a-leader-in-the-2025-gartner-magic-quadrant-for-ai-code-assistants/",
    "published": "2025-09-17T00:00:00.000Z",
    "updated": "2025-09-17T00:00:00.000Z",
    "author": "Manav Khurana",
    "categories": [],
    "summary": "<p>GitLab has been recognized for the second time as a Leader in the 2025 Gartner® Magic Quadrant™ for AI Code Assistants. We see this recognition as validation of a key pillar in our broader AI strategy, where intelligent code assistance evolves into comprehensive AI that transforms how entire teams plan, build, secure, and deploy software.\n<img alt=\"2025 Gartner® Magic Quadrant™ for AI Code Assistants\" src=\"https://res.cloudinary.com/about-gitlab-com/image/upload/v1758121248/jfkmhddve6qvlg79xi",
    "fetched_at": "2025-10-24T18:28:05.185075",
    "source": "gitlab_blog"
  },
  "processing": {
    "content_length": 4605,
    "word_count": 678,
    "is_relevant": true
  }
}