{
  "content": "For the third consecutive year, GitLab has been named a\nLeader in the 2025 GartnerÂ® Magic Quadrantâ¢ for DevOps Platforms\n, based on Ability to Execute and Completeness of Vision. More importantly, GitLab ranks 1st in 4 out of 6 use cases â Agile Software Delivery, Cloud-Native Application Delivery, Platform Engineering, and Regulated Delivery â in the accompanying 2025 GartnerÂ® Critical Capabilities for DevOps Platforms report.\nWe believe this recognition validates our comprehensive platform strategy at a critical moment for software development. Organizations are racing to adopt AI-powered capabilities while maintaining security, compliance, and operational excellence. Success demands a unified platform approach that transforms how teams collaborate and deliver value.\nWhether our customers are delivering agile software, building cloud-native applications, or engineering platforms, GitLab empowers them to collaborate in lockstep with AI agents to ship secure and reliable software, faster.\nDownload the reports\nto learn more.\nFaster time to value\nOur mission is to enable everyone to contribute to and co-create the software that powers our world.\nThe rapid pace of our innovation agenda\ndemonstrates that we are far from finished. We have shipped new solutions to our customers every month for 150+ months, and that tradition will continue.\nAs we lead the industry, we remain committed to helping our customers translate these new capabilities into business value.\nWe firmly believe that, in this era of accelerating AI-powered innovation across the technology ecosystem,\na unified platform approach\nto tackle our customersâ toughest engineering challenges has never been more important than today. This approach enables organizations to reduce integration overhead, close security gaps, and adopt innovation without disrupting existing software delivery workflows.\nHere are a few examples:\nAccelerate releases with agentic AI:\nFragmented toolchains slow down code reviews and testing. GitLab Duo agents and flows automate tasks like code reviews, test generation, and vulnerability triage in the context of the full platform, helping teams shorten cycle times and improve quality.\nBuild securely from the start:\nMany organizations treat security as an afterthought, leading to costly rework and compliance gaps. GitLab embeds scanning, policy enforcement, and compliance checks into everyday workflows, catching risks earlier without slowing developers down.\nDeploy with flexibility:\nTeams with strict regulatory or operational constraints need deployment options beyond multi-tenant SaaS. GitLab supports SaaS, self-managed, air-gapped, and\nFedRAMP Moderate Authorized\nenvironments, ensuring customers maintain control where competitors cannot.\nDeliver consistent innovation:\nTool fragmentation makes adopting new features risky and disruptive. GitLabâs monthly releases deliver new capabilities, such as\nGitLab Duo Agent Platform\n, expanded AI governance, and cloud integrations that teams can adopt without retooling.\nCustomer use cases that matter most\nTogether with the Magic Quadrant, we think the 2025 Gartner Critical Capabilities for DevOps Platforms report evaluates how well platforms serve real-world customer scenarios. GitLab ranked 1st in 4 out of 6 use cases.\nGitLab supports the following areas of innovation:\nIntegrated toolset\nfor cloud-native delivery and enterprise scale\nAdvanced planning tools\nand\nextensive security features\nPackage management\nand feature flags for progressive delivery\nValue stream metrics\nfor visibility and improvement across the lifecycle\nAI-native workflows\n, embedded directly into daily tasks\nThis versatility translates into real customer value, as Bal Kang, Engineering Platform Lead at NatWest, explains:\nâHaving GitLab Duo AI agents embedded in our system of record for code, tests, CI/CD, and the entire software development lifecycle boosts productivity, velocity, and efficiency. The agents understand intent, break down problems, and take action â becoming true collaborators to our teams.â\nThe shift toward unified platforms represents a fundamental change in how organizations approach software development. We believe this is why, recently, GartnerÂ® also named us\na Leader in the 2025 Magic Quadrantâ¢ for AI Code Assistants\n.\nAs companies look to maximize developer productivity securely and accelerate innovation, a comprehensive platform approach becomes more urgent than ever.\nDownload the reports\nto learn more.\nSource: Gartner, Magic Quadrant for DevOps Platforms, Keith Mann, Thomas Murphy, Bill Holz, George Spafford, September 22, 2025\nSource: Gartner, Critical Capabilities for DevOps Platforms, Thomas Murphy, Keith Mann, George Spafford, Bill Holz, September 22, 2025\nGARTNER is a registered trademark and service mark of Gartner, Inc. and/or its affiliates in the U.S. and internationally, and MAGIC QUADRANT is a registered trademark of Gartner, Inc. and/or its affiliates and are used herein with permission. All rights reserved.\nGartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartnerâs research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.\nThis graphic was published by Gartner Inc. as part of a larger report and should be evaluated in the context of the entire document. The Gartner document is available upon request from Gartner B.V.",
  "metadata": {
    "title": "GitLab named a Leader in the 2025 Gartner Magic Quadrant for DevOps Platforms",
    "url": "https://about.gitlab.com/blog/gitlab-named-a-leader-in-the-2025-gartner-magic-quadrant-for-devops-platforms/",
    "published": "2025-09-25T00:00:00.000Z",
    "updated": "2025-09-25T00:00:00.000Z",
    "author": "Manav Khurana",
    "categories": [],
    "summary": "<p>For the third consecutive year, GitLab has been named a <strong>Leader in the 2025 Gartner® Magic Quadrant™ for DevOps Platforms</strong>, based on Ability to Execute and Completeness of Vision. More importantly, GitLab ranks 1st in 4 out of 6 use cases — Agile Software Delivery, Cloud-Native Application Delivery, Platform Engineering, and Regulated Delivery — in the accompanying 2025 Gartner® Critical Capabilities for DevOps Platforms report.</p>\n<p>We believe this recognition validates our ",
    "fetched_at": "2025-10-24T18:28:02.495848",
    "source": "gitlab_blog"
  },
  "processing": {
    "content_length": 5755,
    "word_count": 822,
    "is_relevant": true
  }
}