{
  "content": "Defining agentic AI\nAgentic AI is a type of artificial intelligence that leverages advanced language models and natural language processing to take independent action. Unlike traditional generative AI tools that require constant human direction, these systems can understand requests, make decisions, and execute multi-step plans to achieve goals. They tackle complex tasks by breaking them into manageable steps and employ adaptive learning to modify their approach when facing challenges.\nLearn more about agentic AI\nAgentic AI insights\nTransform development with agentic AI: The enterprise guide\nGitLab 18.4: AI-native development with automation and insight\nWith GitLab 18.4, teams create custom agents, unlock Knowledge Graph context, and auto-fix pipelines so developers stay focused and in flow.\nGitLab 18.3: Expanding AI orchestration in software engineering\nLearn how we're advancing human-AI collaboration with enhanced Flows, enterprise governance, and seamless tool integration.\nGitLab Duo Agent Platform Public Beta: Next-gen AI orchestration and more\n— Introducing the DevSecOps orchestration platform designed to unlock asynchronous collaboration between developers and AI agents.\nGitLab Duo Agent Platform: What's next for intelligent DevSecOps\n— GitLab Duo Agent Platform, a DevSecOps orchestration platform for humans and AI agents, leverages agentic AI for collaboration across the software development lifecycle.\nFrom vibe coding to agentic AI: A roadmap for technical leaders\n— Discover how to implement vibe coding and agentic AI in your development process to increase productivity while maintaining code quality and security.\nEmerging agentic AI trends reshaping software development\n— Discover how agentic AI transforms development from isolated coding to intelligent workflows that enhance productivity while maintaining security.\nAgentic AI: Unlocking developer potential at scale\n— Explore how agentic AI is transforming software development, moving beyond code completion to create AI partners that proactively tackle complex tasks.\nAgentic AI, self-hosted models, and more: AI trends for 2025\n— Discover key trends in AI for software development, from on-premises model deployments to intelligent, adaptive AI agents.\nHow agentic AI unlocks platform engineering potential\n— Explore how agentic AI elevates platform engineering by automating complex workflows and scaling standardization.\nThe agentic AI ecosystem\nAI-driven code analysis: The new frontier in code security\nDevOps automation & AI agents\nAI-augmented software development: Agentic AI for DevOps\nBest practices for implementing agentic AI\nImplementing effective guardrails for AI agents\n— Discover essential security guardrails for AI agents in DevSecOps, from compliance controls and infrastructure protection to user access management.\nGitLab's agentic AI offerings\nGitLab Duo with Amazon Q\nGitLab Duo with Amazon Q: Agentic AI optimized for AWS generally available\n— The comprehensive AI-powered DevSecOps platform combined with the deepest set of cloud computing capabilities speeds dev cycles, increases automation, and improves code quality.\nDevSecOps + Agentic AI: Now on GitLab Self-Managed Ultimate on AWS\n— Start using AI-powered, DevSecOps-enhanced agents in your AWS GitLab Self-Managed Ultimate instance. Enjoy the benefits of GitLab Duo and Amazon Q in your organization.\nGitLab Duo with Amazon Q partner page\nWatch GitLab Duo with Amazon Q in action:\nGuided tour\nClick on the image to start a tour of GitLab Duo with Amazon Q:\nGitLab Duo with Amazon Q tutorials\nEnhance application quality with AI-powered test generation\n— Learn how GitLab Duo with Amazon Q improves the QA process by automatically generating comprehensive unit tests.\nGitLab Duo + Amazon Q: Transform ideas into code in minutes\n— The new GitLab Duo with Amazon Q integration analyzes your issue descriptions and automatically generates complete working code solutions, accelerating development workflows.\nAccelerate code reviews with GitLab Duo and Amazon Q\n— Use AI-powered agents to optimize code reviews by automatically analyzing merge requests and providing comprehensive feedback on bugs, readability, and coding standards.\nSpeed up code reviews: Let AI handle the feedback implementation\n— Discover how GitLab Duo with Amazon Q automates the implementation of code review feedback through AI, transforming a time-consuming manual process into a streamlined workflow.\nGitLab Duo Agent Platform\nGitLab Duo Chat gets agentic AI makeover\n— Our new Duo Chat experience, currently an experimental release, helps developers onboard to projects, understand assignments, implement changes, and more.\nWatch GitLab Duo Agent Platform in action:\nGitLab Agent Platform tutorials and use cases\nVibe coding with GitLab Duo Agent Platform: Issue to MR Flow\n- Learn how to update your application in minutes with our newest agent Flow that takes developers from idea to code.\nGet started with GitLab Duo Agentic Chat in the web UI\n- Learn about our new GitLab Duo AI feature that automates tasks by breaking down complex problems and executing operations across multiple sources.\nCustom rules in GitLab Duo Agentic Chat for greater developer efficiency\n— Discover how AI can understand your codebase, follow your conventions, and generate production-ready code with minimal review cycles.\nAccelerate learning with GitLab Duo Agent Platform\n— Learn how agentic AI helped generate comprehensive gRPC documentation in minutes, not hours.\nFast and secure AI agent deployment to Google Cloud with GitLab\nLearn more with GitLab University\nGet Started with GitLab Duo coursework\nGitLab Duo Enterprise Learning Path\nMore AI resources\n2024 Global DevSecOps Survey: Navigating AI maturity in DevSecOps\nThe Role of AI in DevOps\nThe latest AI/ML articles from GitLab\nGitLab Duo\nGitLab Duo Agent Platform",
  "metadata": {
    "title": "Agentic AI guides and resources",
    "url": "https://about.gitlab.com/blog/agentic-ai-guides-and-resources/",
    "published": "2025-09-26T00:00:00.000Z",
    "updated": "2025-09-26T00:00:00.000Z",
    "author": "GitLab",
    "categories": [],
    "summary": "<h2>Defining agentic AI</h2>\n<p>Agentic AI is a type of artificial intelligence that leverages advanced language models and natural language processing to take independent action. Unlike traditional generative AI tools that require constant human direction, these systems can understand requests, make decisions, and execute multi-step plans to achieve goals. They tackle complex tasks by breaking them into manageable steps and employ adaptive learning to modify their approach when facing challenge",
    "fetched_at": "2025-10-24T18:28:00.856377",
    "source": "gitlab_blog"
  },
  "processing": {
    "content_length": 5892,
    "word_count": 858,
    "is_relevant": true
  }
}