{
  "title": "CI/CD UX Team Meeting: November 16, 2022",
  "video_id": "z7UyqLajFuE",
  "url": "https://www.youtube.com/watch?v=z7UyqLajFuE",
  "transcript": " I can introduce the date also. This is the CSED UX team meeting on November 16th of 2022. It's almost 2023, which is crazy. Hi, and I'll just I'll leave it to you. All right. Thank you, Gina. I cannot see the agenda. My iPad is acting up. But anyways, I think my first item. It's about severity labels. I'm not mistaken. So just a heads up for product designers. Please don't forget to add severity labels to your UX issues, especially the suspecting ones. The boat will annoy you if you don't. So it's a good way of reminding us to label those issues and accordingly so that we can have help with prioritization. But also, I've seen some issues. You might see Valerie also doing some housekeeping on those on those issues and leaving comments, but there are some issues. There are not label UX, but they do have your extra requirements. So I review one for verify today. And I, I just didn't know about the fact that it was a back in issue, but it changed statings and it changed UI copy. But it didn't have UX or a severity added. So just a reminder. For everyone to please. Make sure that the issues that you and your team are working on. Have the correct labels applied. That's one. And then my other updates about hiring. Have a new product designer joining the pipeline insights team. in the coming months. We don't have a start date yet, but she will take over from five planning sites so that Gina can transition full time to runner. So it's gonna happen. Then we'll say no more about that the start date and yeah, just to onboarding all that everybody know. So that's that for me. Gina, you have a year off next. Yes, there's an issue that I linked here that Amelia had brought up about discussing how to better collaborate with designers but I think it also applies with research and even technical writing, cross stage or cross group. I just mentioned it to this group. I think a few of us have already jumped into it, but I think this group does a really great job of collaborating. So I was encouraging you to share your thoughts if you have time. And I think we were gonna try to start from the bottom of the agenda today, Erica, if you wanted to start. Well, that's a great tie in because working backward from my list, one of the things was that we have, I wanted to like celebrate the. list. One of the things was that we have, I wanted to like celebrate the my my updates today are framed around welcome back Hannah. I wanted to know that Gina and Will actually got sick and like tested such that I couldn't go to the conference. And so Gina like stepped into this leadership position, will really delivered. And we have like four reports, I know amazing, I coupon, four reports that we hammered out because of the data they collected. And then one more on the way which which ties into the issue that Gina just showed about cross stage collaboration. So we we set up like a game we gamified the interviews instead of running them just like in a conversational way. And we were able to get great data. And I think we got actionable data. So we're still working on that report and it's setting up a secret scan which we kind of all want to be working on anyway. So that was really good. Yay! And then I guess my last item too is just asking if if you all would like to open up the H2 Verifying Package Common Screener for solution validation studies. So I just wanted to check if it's worth like making that change with Caitlin. And I linked a PDF of the of what the questions are and is long. But we have like 500 participants in there and some of them have been used. But I think I'll give you time. You can just mention me in the notes to give you time to look at it and just let me know like how many studies we might recruit for. And then my other findings are kind of just an overview of the Q4 prioritization. So the big one is that we have a pre-work issue set up for Q3 to do some pre-work related to a benchmark. Dare I say it for a package? I'm like a nervous. But anyway. So yeah. So we'll hopefully do a benchmark for a package in Q1. Fiscal Year 23 starting in 159 waiting for design and PM resources to kind of come online. But before then I'm just doing work to like kind of crosswalk the stages that have done this before to kind of like make sure what we do is on par. And then we also kind of related to package resources. We put on hold this like cycle of an image study until the new PM joins. So that would be the study that we did kind of with secrets and CI templates where it's like how does it start? What happens next? What happens next? We would use that kind of framework. And so that's on hold for the new PM. We think it's exciting for the new PM to work on. But I think the benchmarks would get priority and then it would go to that study. One more thing to mention about that is Gina has a really cool issue, a research issue around looking at the lifecycle of logs. And so part of me wants to try to fold that into this study. That's no one holds. But I think we're getting feedback that we need to like scope that Gina's study down a little bit. So but does note that I have like a plan because I think it's really smart. Like in foundational research terms. Sorry, I didn't wait for Hannah to say that thanks for the heads up on the benchmark. Yes, sorry, my Google docs keeps, keeps crashing on me. I'm so I can not finish writing my question. So yeah, about package, I have a question for you, Erica. I cannot open the issue now. On my iPad, but the pre-work issue is for the benchmark aid, right? For package. Yes, and correctly. Yes. And it's all things that I want to do. Like I'm comparing the screener questions because I think that and I worked on benchmarks in a lot of previous roles. And one thing we want to see is how much we can compare across stages, which kind of means looking at how comparable the samples are. And did we all use the same screener? And like what's the alignment? In part, I'm doing that so that I'm not making us be too rigorous with like finding a counterbalance sample. But like whatever we've done is an amazing iteration. But we just want us to track it explicitly so we kind of know. So it's mainly me doing the pre-work of like what were the screeners? What's our screener looks like? I actually have our screener drafted. And so whenever Tim had time, he can kind of come in. I think the idea would be we would treat it like a common screener and then be in a position to run the next benchmark. Like we would have 500 participants, so we could select from. If we kind of start rolling it out as soon as we're ready. And so we're just waiting on Tim to have time. So it's like what were the screeners? How are the samples comparing? And that will help us know. Like I think what I'm seeing so far is like we're mainly small medium business samples, which is fine to know, right? But it means we don't have to then stretch to do an enterprise recruit. Kind of we want to be on par. And then I'll be looking at all of the mechanisms that different researchers use to like get feedback. Like Will has this lovely URL approach that he used for jobs to be done like deciding on the tasks. And then working with Tim to figure out like what the team has capacity for. I feel like we'll go more bare bones, which is also okay. But so in a couple weeks when we get back from the Thanksgiving holiday, I'm going to meet with Tim to like give the updates and then see what his thoughts are related to the kind of the next steps. And my plan was just to use those little half hour meetings that I have set up with him. So they don't take too much time. And then the last thing that I'll look at across those stage areas is just like the level at which the tasks were framed. Because that can impact performance too. So I think we'll also help like elevate the research program. With this work. Okay. I'm taking some notes here. Thank you. I think you're for the overview that that clarifies my next couple of questions. And then I just want to say please keep me in the loop. Because if we know a bit ahead of what the UX I'll say like hands on design work for package is going to look like. I need to know to prepare the UX coverage because we won't have UX location for package until next year Q3 Q4. Okay. Yeah. We've made a decision to because team and Victor also Michelle they talk about the deliverable plans for package now. That's for everybody to kind of be aware that they're hiring developers. They don't have for example front end allocation to build UI right now. So we are not going to be hiring a designer for package right now. We move the headcount to a different team and then we won't have a designer for package until next year right once development picks up. But if there is a the research is going on and we have well the hiring for development also picks up and we know that we have a need for package UX deliverables then yeah I'll need to know ahead of time so that we don't work on a coverage or borrow plan or a hiring plan for the for the design backfill for Katie's backfill. But just so you're aware that yeah we're not playing any own deliverables for package because we don't have anyone allocated there. And maybe we work backwards from that too. I don't know. I like really wanted to contribute to the okay R so I'm just kidding or we're trying. But I think I think it would be okay to get those findings and then have the designer as they on board like pick up with them as long as we like set the expectations so everyone knows that that's our plan. This seems okay but we'll let Tim guide us. But thank you for the update. Okay. Keep me keep me the one. Okay well. Sure. Just got a couple updates. I'm using the same prioritization issue in Q4 as I used in Q3. I'm kind of trialing just a longer term prioritization issue that goes two quarters as opposed to one just to see how that process goes. I did add a comment in the issue with just some updates on like what projects we accomplished in Q3 so if you want to check that out you're welcome to do so. And we're still collecting projects for Q4 but I've listed within that comment what projects we're expecting to take on this quarter. Aside from that also met up with Emily on Sunday which was awesome. We got to have dinner. It was nice to just meet another person. I've met like half the people on this call which I never thought when contribute got cancelled for the year but yes just been great to slowly meet more and more team members as a bit a part of the company. And my final update is that I've been reviewing scenarios kind of off and on for Emily's CMS study on environment management and she's been really putting a lot of effort into that over the past couple weeks. Any questions for I turn it over to Emily? Okay Emily you could take it away. Well I'll go a little out of order because I'll get to my critique one at the end but I was mostly curious now that I'm kind of getting to the stage of conducting the CMS interviews with internal users just kind of some of the things you did to recruit people. I know we're using some people from the delivery team who've already offered to volunteer but just any other options to get people into the study I'm looking for so it's like Will and Gina both had to comments around that? Sure so I haven't done this a ton. I did this probably the most like after I started to get lab just because I wasn't sure how to get internal people to begin with and I've like posted on Slack channels just I try to keep like a very concise message of you know who I'm looking for, what dates you know just any like kind of a summary of details about the study and just try to post them on different channels. Sometimes I've like leaned on the PM to try to help direct me to like the right channels to go to but since you're working a lot with the delivery team they might you know help you know where to post or you could just talk to the participants that you have signed up and say like hey you know now that you've gone through this study you know is there someone else on your team that might be good for this? You mine was just plus wanting to what will said I have posted in what's happening at GitLab before that has gotten traction and then I also found that linking to the research issue helps kind of allow them allowing them to get contacts around with the researches about. Awesome sounds good. There's a hyanoilifta comment as well as a puzzling. Yeah I'm trying my my girl dogs are just not loading. I think I wrote down about yeah looking of course in the handbook right we have a section with the internal customers for each stage group and then on which page is that? On the handbook product slash categories and if our release stage you know it's a delivery distribution team security so just echoing what the will and Gina say most of those groups they have their own Slack channel so can drop that same message in there then we need to reach out directly to people. I think for the release the delivery team they have super active so it's easy to find those connections through them and also ask like who is someone that is working or has used xyz feature functionality in the if you know contact with them but in Gina and will they already gave the best tips so just echoing what they say. Cool the second update I wanted to give is we adjusted the deployments navigation so now when you click on the high level deployments you land on the environments page not feature flags because there's a lot of data showing that people would land on feature flags and navigate away as well there was comments about this in our like benchmarking study so that is now in production which is really great and then will I know as you had a comment on that as well. Yes you talked about we did see this a lot in the benchmarking study and I would just constantly see participants like click on the link and know that they weren't going to go to the right place and then they would just like get frustrated and then have to you know use that extra click to go to the right page so I know that's going to be a big time change. Awesome and to do a time to do a little kind of design review I think we still have like 20 minutes so I try I will try not to take up all the time but just wanted to make sure I wasn't taking up too much time so the background of this this has been a long standing issue that's opened that basically we want to design a page that for MVC starts out to host production environments across a group we've seen a lot of research showing that users are having a lot of problems tracking environments at the group level and they're having to go to each project bubble page kind of track statuses on there so kind of crafting up a page here that people would be able to see like a high level summary and then be able to click in and take action if needed. So I hi I think you for telling me to kind of just step back and start from scratch because that really got me started quite well but I'll go ahead and share my screen if I can figure out what screen I have to share this one. Well so how I started this is I really took a step back and went through the research and this page is interesting because it's not a typical flow users wouldn't be going here to complete like a typical flow but I did want to get onto paper kind of like some of the tasks that the research showed that they were looking for. I don't know if I should go into this if this is going to be public but you can kind of take a look at kind of some of this and then just taking a step back and really figuring out so this is like a high level view what do users really want to understand and starting from like the information architecture point of view here not even designing something just trying to figure out from a high level what we should be showing on this page. So with some like a team feedback I've done some like St. Cals with the engineers on this I kind of landed on something like this where we would show kind of production environments a top-level summary of like your environment health across the group so like how many environments are healthy are you having problems with any of them. So a little TBD on what to show in this area but really having that high level summary and then being able to dig down if you need and then when you go into the environment showing an environment level summary of that production environment with like environment health project the deployment the most recent deployment health and then some actions you can take as well as showing that most recent deployment so you have like context of what is going into that environment currently. I've cut it down quite a bit from some of the original proposals because this page we really want to show them what is going on and not bog them down by a bunch of different information that they could kind of dig into and find. So I've kind of moved it into this again as you can see this is like a really big TBD I want to create a nice summary at the top but kind of showing this into like group name environment at the production tier kind of like is the most recent deployment successful is there anything action you have to take and then kind of showing details about the most recent deployment underneath it with options to like view and project and kind of debug problems going that way but by condensing this information down reducing the amount of like pagination you need so being able to show things all on one page and being able to show just the information you need to kind of take the action that you need to take so open to suggestions on this but that's kind of like how I've started this it's still fairly rough so there's like I do want to run this by some users as well but but I would get first feedback look even though this is kind of like a rough low fidelity right now. I had one comment just saying that I thought it looks great I didn't even see this the one that you're showing right now I only saw the IA stuff so I think it I think it looks like with the all the information that you have to deal with which there is a lot like you did a really good job of summarizing that and making it clear. I also the thing that came to mind for the summary view up top I think that this single set component is always good for that type of stuff so if you you could consider using something like that for up there I've seen other pages do that as well and what runner does that and then there's a like a dev ops report type of thing that kind of does it. And that's called the like single stat component. Yeah I'll link it to you from pajamas. Awesome it's pretty flexible too which is great. Then my only other comment was for like this would be adding a new navigation item for for groups and we had to do a similar thing for runner so I would consider talking to the foundation steam just to make sure like I think you have to get approval from them now I can link the handbook page but I also know because they have all their navigation efforts going on it may change so something to be aware of. Yeah I know when we were trying to do billing on the growth team we were running into a similar thing there was like a process in adding something to the nav so I will definitely kind of communicate to this idea with them and see how to go from there. Okay yeah. Erica I think you had the next comment. Yes thanks for sharing this I love that you're sharing that's in this in this meeting. So one thing that we're we've learned about the workflow with CI CD variables and the subset of those are secrets is that one of the reasons people want to use the unprotected values is because they tend to use the wrong ones per environment because it's confusing. So yeah like a subset of that finding is that they use different secrets values for the different environments. So I think you could add clarity here if there's like a light touch way to even like allow people to dig into the different variables that are being used in different environments. I do I think that would help them and it feels like if we're going to do an overview like that that that would be something to highlight or think about. I can definitely think into that I'm still in the process of trying to figure out what is the best information to show here what should be still cut out because some of this deployment information is just kind of copied over from the environment index page. So definitely want to do a bit more exploration on like is this the right amount of information and if there's additional information like you said the kind of secrets how do you show that here. So thanks for bringing that to my attention. Well thank you all for the feedback by the way I see Will is next. Yeah I think for the summary view some of the things that could be helpful is just being able to identify not just like how many environments are in a successful status but also if there's ones that are like pending or if there are ones that are like failing or having some sort of like difficulties just so that people can like easily like click into those and be taken to those somehow and then also I like how in your design you're not like using that care at Sasha Cordian style menu that that we currently have just because it's nice to be able to just see some of the specific data that users were having to like really stumble around to try to find. Awesome yeah thank you that was kind of I know a lot of our research has shown those collapsible sections when you're trying to find a high level view of everything was just not working out right so I was trying my best not to even collapse any information and just if there's information you that needs to be hidden maybe it's not the right place to put it on this page so appreciate and you're welcome. Then hi and I think you have the last comments. Yeah so just post one on what we'll say about showing information without using that awful pattern of what you're expanding collapsing it just hides all the info that it's essential in this page pretty much in both in this case the group but also the the project level environments view and also plus one on the summary block I think this sort of give users that add what understanding of how their environments are doing across the board and that's important of course not only for the developers but you know the managers the the director of buyer percent anyways anyone really that is interested in how the application is doing at the higher level so I think that's that's going to be a great addition addition and I have a couple of follow-up questions Emily and I'm sure if you have the time but you know I think those those are just the things I was thinking of while looking at the prototypes what type of environments will be displayed on this overview just like the protected environments production only and also I was wondering how would users set up this overview. Has the team considered if this would be something that would be just pre-populated you know coming from all the projects that have the have the environments that meet a specific criteria or we users be able to let's say manage and customize that view based on what's important for them to see you know for each project. Yeah so this is a good question for MVC we've really landed on we want to show just production tier environments and then figuring out later we'll need to scale this up to show the different tiers but kind of pre-populate this based on like tier of environments this is actually where the empty state comes in I don't think I'm the one that designed the empty state I kind of grabbed it from one of the others but if you don't aren't using environment tiers using this empty state to kind of encourage users to kind of set that up so that they can pre-populate this page but also use this feature which we don't have any area now where we're really encouraging them to do so so having the empty state is both a bonus of setting up this but also encouraging people to use environment tiers so hopefully that answers your question for MVC we are just going to stick with production tier environments and to set it up would be enabling tiers in your environments to show them pre-populated on this page. Yeah thanks that answers my question I think following up to that and thinking about too is that when you have the chance look at how the MVC plus would look like because for example if I'm not mistaken you can have multiple environments under the same tier right so if you set it up in the CI file you can have I don't know different production environments, label production but put a different name right so how would that look like in the UI how would users customize so I think it would be a good step for you there to see how this page would grow uh because we're not the challenges that we had with the current environments pages that while designing and also coding it we were not thinking of how that page would scale so I think you have the the ability here to predict some of the edgegates but also to avoid you know I'm happy and happy bets in the UI in the overall UX. Yeah for sure yeah that's something and where I'm early enough into the designs here now that I have to kind of build out what does like unhealthy environments look like what happens when you have like a lot on this page so I think we still have quite a bit of time to kind of build out all these educations and then once we start showing more than just the production tier how do you set that up what does that view look like and everything like that so I think there's lots of work to be done on this page but it'll be good work to finally get out to users. Yeah awesome and then my next point is about that it seems like if you move forward with this approach right up for left environments we could potentially deprecate the environment's dashboard view. What are the team discussions about it if there's any discussion going on around deprecating or replacing the page if they were off this group view? Yeah so there hasn't been any like official conversations going on but I have chatted with like Andrew on the team of the reasons of moving away from it and just the performance issues on that page were so hard to sort out that that's kind of where this idea has come from and kind of like why we might be moving forward with this and some of the performance issues are really hard to kind of solve for but I think we need like some written out kind of conversation with the PMs and everyone on that team to figure out is this a like a replacement can they work together what are the main pros of this pros of the environment dashboard and really sort that plan out as well. Awesome yeah I think that that would be you know a good I'm going to put that justification right for deprecating or moving away from that environment dashboard view. There's no traffic there as far as I know and to your point there's so many restrictions in terms of the performance of that page that you know I would say if you can it also when you have the decisions and conversations with the team putting the proposal to right that how this page will work potentially solve the jobs we don't solve the problems that the environment's dashboard view does not solve right. Thank you and then no sorry go ahead. No I just say thank you that's like something I definitely have to think on so we'll get that written up. Awesome and then my last thing back is just about the UI and then if I let me zoom in here yeah um when I did the validation for the environment's uh uh page right um I learned that uh that information about the commit message it's irrelevant to users or it's usually irrelevant when that commit is merging or branch or anything into master because it often shows that same you know the folk message merge branch and then branch name and that's not readable and that's not a very informative to users um so my feedback here would be like check in the um the insights I don't remember correctly now what what's the most relevant information that that we should be displaying here to users and see how you know and if it could be um if it could replace the merge branch message um because that's what we have today in the environment's page it's just the same message everywhere with the link um and there's already so much I think you can use that space um in uh in a in a more a different way rather than just showing this message yeah I agree I think there's stuff we can especially that if we can save real estate on anything in this page and take out uh things that they don't need at this viewpoint um something I'm working towards right now so that's great to know that's something we can potentially take out of this awesome well thanks everyone for your feedback I want to give Gina enough time for her points as well but I appreciate uh kind of taking the time to let me walk through that so thanks Emily I have one other question for you I noticed that the the way that you were like for each row there was kind of like many columns of metadata in there like the job like all that's up have you heard I got any feedback around how that impacts like scanability I guess across different deployments yeah because it is a lot of information so as like a side note I've kind of added these in here to this I'm still considering it like a low fidelity I've just added in what we have on the environment index page and I'm planning in like the next version of this to kind of go through see what information we can remove from there see what information is like the most important um based on conversation with the engineers to kind of for MVC start with what we have and kind of take away from that if possible just so we can reuse some components so yeah I agree those sections I think need a bit of cleaning up and figuring out what exact information should be placed there um like the merge branch message taking that away but yeah I agree I think there's some simplification we can still do in that area yeah I'd be like if you end up testing this I would be interested in seeing if people say like if they if they want to scan I guess my column like does formatting the information in that way impacts that because I mean we're doing that in runner and there have been like two or two customers who have been like I don't I don't want to see it in this list view I'd rather see it in a table but the majority have been saying it's fine to see it in the way that it is um but the view I that we're using is very similar so I think the insights would carry over to the list well good to know and yeah I'm planning to run this through some solution validation as well when we have a more finalized design because there's such a big lift to do so hopefully we'll get some of the usability comments from that as well and then I have one more point there I'm like jumping in before we switch but it would be that when you do the solution validation I think try to include like more personas than you might not like try to push yourself to include more personas so we make this work for more people because I think it can have a bigger impact yeah because I think right now the dashboard sorry I'll come is not working for some of our personas so opening this up to a bunch of other ones is probably like the best fact well thanks again for all that I will pass it off to Gina now. Hey thanks I have two updates one of them is for pipeline insights um we're dealing with this problem of flaky tests we're going to if I gave a definition of these are not but the general one is that when you run tests they can sometimes fail but the failure isn't real like it wasn't actually detected it was because like the test is actually written incorrectly or maybe a test that that test relies on failed something like that and if it fails more often than it succeeds without actually detecting a failure it's considered flaky so we're trying to understand from users like their pain points right now their workarounds with how they're dealing with flaky tests and then definitely how they define them the key insight for us here is how they define them because we want to be able to when we define them for this MVC we want to make sure it matches their expectations so I included some of the insights that we've heard so far we've only met with three users so far but we have a few other participants coming up as well and then on the runner side we this is like one of our our bigger um what's a small feature but it's it's an important feature that we've added for runners it kind of has to do with the whole runner fleet monitoring slash q stuff I've been talking about for a while so it's it's difficult for users to be able to see if a runner is running a job at the moment and the reason why that's important is because if they were to update the runner for example um it would stop that runner from running any jobs so they don't want to impact any current running jobs or else the code just it doesn't go out so they want to know if if if that runner is actually running one um so we've added a badge to be able to see if it's running or if it's idle is the other word that we're using the tough part about this is that now we have two status badges we have one about if the runner is online and if the runner is like running a job so our next iteration would be combining those into a single status something like active where it's running a job and it's online um and then that will allow for less less load on the user any questions or anything I just want to say I love the idea of combining status badges into one thing that works because I've seen it quite a few times and I think it's in like the environments areas as well where there's like multiple status badges and you're not quite sure how they relate to each other so I think that's a great idea thanks it will definitely be a tough thing to do like because even with runner because everything's through the CLI too people can now get a list of all like online runners but all those statuses would have to change so it's going to be like a long a long process well I think that's it I don't think anybody has anything else so thanks for meeting today see everybody soon next week maybe",
  "segments": [
    {
      "id": 0,
      "seek": 0,
      "start": 0.0,
      "end": 158.56,
      "text": "I can introduce the date also. This is the CSED UX team meeting on November l6th of 2O22. It's almost 2O23, which is crazy. Hi, and I'll just I'll leave it to you. All . Thank you, Gina. I cannot see the agenda. My iPad is acting up. But , I think my first item. It's about severity labels. I'm not mistaken. just a heads up for product designers. Please don't forget to add severity labels to your UX issues, especially the suspecting ones. The boat will annoy you if you don't. it's a good way of reminding us to label those issues and accordingly that we can have help with prioritization. But also, I've seen some issues. You might see Valerie also doing some housekeeping on those on those issues and leaving comments, but there are some issues. There are not label UX, but they do have your extra requirements. I review one for verify today. And I, I just didn't know about the fact that it was a back in issue, but it changed statings and it changed UI copy. But it didn't have UX or a severity added. just a reminder. For everyone to please. Make sure that the issues that you and your team are working on. Have the correct labels applied. That's one. And then my other updates about hiring. Have a new product designer joining the pipeline insights team. in the coming months. We don't have a start date yet, but she will take over from five planning sites that Gina can transition full time to runner. it's gonna happen. Then we'll say no more about that the start date and yeah, just to onboarding all that everybody know. that's that for me. Gina, you have a year off next. Yes, there's an issue that I linked here that Amelia had brought up about discussing how to better collaborate with designers but I think it also applies with research and even technical writing, cross stage or cross group. I just mentioned it to this group. I think a few of us have already jumped into it, but I think this group does a really great job of collaborating. I was encouraging you to share your thoughts if you have time.",
      "tokens": [
        50364,
        286,
        393,
        5366,
        264,
        4002,
        611,
        13,
        50714
      ],
      "temperature": 0.0,
      "avg_logprob": -0.24018162814053623,
      "compression_ratio": 1.1726618705035972,
      "no_speech_prob": 0.048890817910432816
    },
    {
      "id": 53,
      "seek": 16580,
      "start": 166.20000000000002,
      "end": 172.0,
      "text": "And I think we were gonna try to start from the bottom of the agenda today, Erica, if you wanted to start.",
      "tokens": [
        50384,
        400,
        286,
        519,
        321,
        645,
        799,
        853,
        281,
        722,
        490,
        264,
        2767,
        50520
      ],
      "temperature": 0.6,
      "avg_logprob": -0.7666261336382698,
      "compression_ratio": 1.4518072289156627,
      "no_speech_prob": 0.001475350116379559
    },
    {
      "id": 55,
      "seek": 16580,
      "start": 176.68,
      "end": 304.16,
      "text": ", that's a great tie in because working backward from my list, one of the things was that we have, I wanted to celebrate the. list. One of the things was that we have, I wanted to celebrate the my my updates today are framed around welcome back Hannah. I wanted to know that Gina and Will got sick and tested such that I couldn't go to the conference. And Gina stepped into this leadership position, will really delivered. And we have four reports, I know amazing, I coupon, four reports that we hammered out because of the data they collected. And then one more on the way which which ties into the issue that Gina just showed about cross stage collaboration. we we set up a game we gamified the interviews instead of running them just in a conversational way. And we were able to get great data. And I think we got actionable data. we're still working on that report and it's setting up a secret scan which we all want to be working on . that was really good. Yay! And then my last item too is just asking if if you all would to open up the H2 Verifying Package Common Screener for solution validation studies. I just wanted to check if it's worth making that change with Caitlin. And I linked a PDF of the of what the questions are and is long. But we have 5OO participants in there and some of them have been used. But I think I'll give you time. You can just mention me in the notes to give you time to look at it and just know how many studies",
      "tokens": [
        50908,
        1042,
        11,
        300,
        311,
        257,
        869,
        7582,
        294,
        570,
        1364,
        23897,
        490,
        452,
        1329,
        11,
        51058
      ],
      "temperature": 0.6,
      "avg_logprob": -0.7666261336382698,
      "compression_ratio": 1.4518072289156627,
      "no_speech_prob": 0.001475350116379559
    },
    {
      "id": 73,
      "seek": 29672,
      "start": 306.48,
      "end": 397.44,
      "text": "we might recruit for. And then my other findings are just an overview of the Q4 prioritization. the big one is that we have a pre-work issue set up for Q3 to do some pre-work related to a benchmark. Dare I say it for a package? I'm a nervous. But . yeah. we'll hopefully do a benchmark for a package in Ql. Fiscal Year 23 starting in l59 waiting for design and PM resources to come online. But before then I'm just doing work to crosswalk the stages that have done this before to make sure what we do is on par. And then we also related to package resources. We put on hold this cycle of an image study until the new PM joins. that would be the study that we did with secrets and CI templates where it's how does it start? What happens next? What happens next? We would use that framework. And that's on hold for the new PM. We think it's exciting for the new PM to work on. But I think the benchmarks would get priority and then it would go to that study.",
      "tokens": [
        50852,
        321,
        1062,
        15119,
        337,
        13,
        400,
        550,
        452,
        661,
        16483,
        366,
        733,
        295,
        445,
        364,
        12492,
        295,
        264,
        1249,
        19,
        51284
      ],
      "temperature": 0.0,
      "avg_logprob": -0.10846964518229167,
      "compression_ratio": 1.5,
      "no_speech_prob": 0.00010239633411401883
    },
    {
      "id": 84,
      "seek": 37896,
      "start": 400.32,
      "end": 436.48,
      "text": "One more thing to mention about that is Gina has a really cool issue, a research issue around looking at the lifecycle of logs. And part of me wants to try to fold that into this study. That's no one holds. But I think we're getting feedback that we need to scope that Gina's study down a little bit. but does note that I have a plan because I think it's really smart. in foundational research terms. Sorry, I didn't wait for Hannah to say that thanks for the heads up on the benchmark.",
      "tokens": [
        51432,
        1485,
        544,
        551,
        281,
        2152,
        466,
        300,
        307,
        34711,
        575,
        257,
        534,
        1627,
        2734,
        11,
        257,
        2132,
        2734,
        926,
        51724
      ],
      "temperature": 0.0,
      "avg_logprob": -0.10950170818128084,
      "compression_ratio": 1.6651785714285714,
      "no_speech_prob": 0.0003328461607452482
    },
    {
      "id": 90,
      "seek": 43432,
      "start": 440.32,
      "end": 766.8,
      "text": "Yes, sorry, my Google docs keeps, keeps crashing on me. I'm I can not finish writing my question. yeah, about package, I have a question for you, Erica. I cannot open the issue now. On my iPad, but the pre-work issue is for the benchmark aid, ? For package. Yes, and correctly. Yes. And it's all things that I want to do. I'm comparing the screener questions because I think that and I worked on benchmarks in a lot of previous roles. And one thing we want to see is how much we can compare across stages, which means looking at how comparable the samples are. And did we all use the same screener? And what's the alignment? In part, I'm doing that that I'm not making us be too rigorous with finding a counterbalance sample. But whatever we've done is an amazing iteration. But we just want us to track it explicitly we know. it's mainly me doing the pre-work of what were the screeners? What's our screener looks ? I have our screener drafted. And whenever Tim had time, he can come in. I think the idea would be we would treat it a common screener and then be in a position to run the next benchmark. we would have 5OO participants, we could select from. If we start rolling it out as soon as we're ready. And we're just waiting on Tim to have time. it's what were the screeners? How are the samples comparing? And that will help us know. I think what I'm seeing far is we're mainly small medium business samples, which is fine to know, ? But it means we don't have to then stretch to do an enterprise recruit. we want to be on par. And then I'll be looking at all of the mechanisms that different researchers use to get feedback. Will has this lovely URL approach that he used for jobs to be done deciding on the tasks. And then working with Tim to figure out what the team has capacity for. I feel we'll go more bare bones, which is also . But in a couple weeks when we get back from the Thanksgiving holiday, meet with Tim to give the updates and then see what his thoughts are related to the the next steps. And my plan was just to use those little half hour meetings that I have set up with him. they don't take too much time. And then the last thing that I'll look at across those stage areas is just the level at which the tasks were framed. Because that can impact performance too. I think we'll also help elevate the research program. With this work. . I'm taking some notes here. Thank you. I think you're for the overview that that clarifies my next couple of questions. And then I just want to say please keep me in the loop. Because if we know a bit ahead of what the UX I'll say hands on design work for package is look . I need to know to prepare the UX coverage because we won't have UX location for package until next year Q3 Q4. . Yeah. We've made a decision to because team and Victor also Michelle they talk about the deliverable plans for package now. That's for everybody to be aware that they're hiring developers. They don't have for example front end allocation to build UI now. we are not be hiring a designer for package now. We move the headcount to a different team and then we won't have a designer for package until next year once development picks up. But if there is a the research is going on and we have the hiring for development also picks up and we know that we have a need for package UX deliverables then yeah I'll need to know ahead of time that we don't work on a coverage or borrow plan or a hiring plan for the for the design backfill for Katie's backfill. But just you're aware that yeah we're not playing any own deliverables for package because we don't have anyone allocated there. And maybe we work backwards from that too. I don't know. I really wanted to contribute to the R I'm just kidding or we're trying. But I think I think it would be to get those findings and then have the designer as they on board pick up with them as long as we set the expectations everyone knows that that's our plan. This seems but we'll let Tim guide us. But thank you for the update. . Keep me keep me the one.",
      "tokens": [
        50664,
        1079,
        11,
        2597,
        11,
        452,
        3329,
        45623,
        5965,
        11,
        5965,
        26900,
        322,
        385,
        13,
        286,
        478,
        370,
        286,
        393,
        406,
        2413,
        3579,
        452,
        1168,
        13,
        51120
      ],
      "temperature": 0.0,
      "avg_logprob": -0.35693466800382767,
      "compression_ratio": 1.5048543689320388,
      "no_speech_prob": 0.0022222595289349556
    },
    {
      "id": 138,
      "seek": 75064,
      "start": 771.68,
      "end": 1110.72,
      "text": ". Sure. Just got a couple updates. I'm using the same prioritization issue in Q4 as I used in Q3. I'm trialing just a longer term prioritization issue that goes two quarters as opposed to one just to see how that process goes. I did add a comment in the issue with just some updates on what projects we accomplished in Q3 if you want to check that out you're welcome to do . And we're still collecting projects for Q4 but I've listed within that comment what projects we're expecting to take on this quarter. Aside from that also met up with Emily on Sunday which was awesome. We got to have dinner. It was nice to just meet another person. I've met half the people on this call which I never thought when contribute got cancelled for the year but yes just been great to slowly meet more and more team members as a bit a part of the company. And my final update is that I've been reviewing scenarios off and on for Emily's CMS study on environment management and she's been really putting a lot of effort into that over the past couple weeks. Any questions for I turn it over to Emily? Emily you could take it away. I'll go a little out of order because I'll get to my critique one at the end but I was mostly curious now that I'm getting to the stage of conducting the CMS interviews with internal users just some of the things you did to recruit people. I know we're using some people from the delivery team who've already offered to volunteer but just any other options to get people into the study I'm looking for it's Will and Gina both had to comments around that? Sure I haven't done this a ton. I did this probably the most after I started to get lab just because I wasn't sure how to get internal people to begin with and I've posted on Slack channels just I try to keep a very concise message of who I'm looking for, what dates just any a summary of details about the study and just try to post them on different channels. Sometimes I've leaned on the PM to try to help direct me to the channels to go to but since you're working a lot with the delivery team they might help where to post or you could just talk to the participants that you have signed up and say hey now that you've gone through this study is there someone else on your team that might be good for this? You mine was just plus wanting to what will said I have posted in what's happening at GitLab before that has gotten traction and then I also found that linking to the research issue helps allow them allowing them to get contacts around with the researches about. Awesome sounds good. There's a hyanoilifta comment as as a puzzling. Yeah I'm trying my my girl dogs are just not loading. I think I wrote down about yeah looking of course in the handbook we have a section with the internal customers for each stage group and then on which page is that? On the handbook product slash categories and if our release stage it's a delivery distribution team security just echoing what the will and Gina say most of those groups they have their own Slack channel can drop that same message in there then we need to reach out directly to people. I think for the release the delivery team they have super active it's easy to find those connections through them and also ask who is someone that is working or has used xyz feature functionality in the if contact with them but in Gina and will they already gave the best tips just echoing what they say. Cool the second update I wanted to give is we adjusted the deployments navigation now when you click on the high level deployments you land on the environments page not feature flags because there's a lot of data showing that people would land on feature flags and navigate away as there was comments about this in our benchmarking study that is now in production which is really great and then will I know as you had a comment on that as . Yes you talked about we did see this a lot in the benchmarking study and I would just constantly see participants click on the link and know that they weren't go to the place and then they would just get frustrated and then have to use that extra click to go to the page I know that's be a big time change.",
      "tokens": [
        51416,
        1033,
        731,
        13,
        4894,
        13,
        1449,
        658,
        257,
        1916,
        9205,
        13,
        286,
        478,
        1228,
        264,
        912,
        14846,
        2144,
        2734,
        51804
      ],
      "temperature": 0.0,
      "avg_logprob": -0.3494274809553817,
      "compression_ratio": 1.4598930481283423,
      "no_speech_prob": 0.0003741199616342783
    },
    {
      "id": 185,
      "seek": 110688,
      "start": 1113.7600000000002,
      "end": 1352.8,
      "text": "Awesome and to do a time to do a little design review I think we still have 2O minutes I try I will try not to take up all the time but just wanted to make sure I wasn't taking up too much time the background of this this has been a long standing issue that's opened that we want to design a page that for MVC starts out to host production environments across a group we've seen a lot of research showing that users are having a lot of problems tracking environments at the group level and they're having to go to each project bubble page track statuses on there crafting up a page here that people would be able to see a high level summary and then be able to click in and take action if needed. I hi I think you for telling me to just step back and start from scratch because that really got me started quite but I'll go ahead and share my screen if I can figure out what screen I have to share this one. how I started this is I really took a step back and went through the research and this page is interesting because it's not a typical flow users wouldn't be going here to complete a typical flow but I did want to get onto paper some of the tasks that the research showed that they were looking for. I don't know if I should go into this if this is be public but you can take a look at some of this and then just taking a step back and really figuring out this is a high level view what do users really want to understand and starting from the information architecture point of view here not even designing something just trying to figure out from a high level what we should be showing on this page. with some a team feedback I've done some St. Cals with the engineers on this I landed on something this where we would show production environments a top-level summary of your environment health across the group how many environments are healthy are you having problems with any of them. a little TBD on what to show in this area but really having that high level summary and then being able to dig down if you need and then when you go into the environment showing an environment level summary of that production environment with environment health project the deployment the most recent deployment health and then some actions you can take as as showing that most recent deployment you have context of what is going into that environment currently. I've cut it down quite a bit from some of the original proposals because this page we really want to show them what is going on and not bog them down by a bunch of different information that they could dig into and find. I've moved it into this again as you can see this is a really big TBD I want to create a nice summary at the top but showing this into group name environment at the production tier is the most recent deployment successful is there anything action you have to take and then showing details about the most recent deployment underneath it with options to view and project and debug problems going that way but by condensing this information down reducing the amount of pagination you need being able to show things all on one page and being able to show just the information you need to take the action that you need to take open to suggestions on this but that's how I've started this it's still fairly rough there's I do want to run this by some users as but but I would get first feedback look even though this is a rough low fidelity now.",
      "tokens": [
        50708,
        10391,
        293,
        281,
        360,
        257,
        565,
        281,
        360,
        257,
        707,
        733,
        295,
        1715,
        3131,
        286,
        519,
        321,
        920,
        362,
        411,
        945,
        2077,
        51108
      ],
      "temperature": 0.0,
      "avg_logprob": -0.17337645253827494,
      "compression_ratio": 1.646788990825688,
      "no_speech_prob": 0.0013437499292194843
    },
    {
      "id": 224,
      "seek": 134704,
      "start": 1358.1599999999999,
      "end": 1419.68,
      "text": "I had one comment just saying that I thought it looks great I didn't even see this the one that you're showing now I only saw the IA stuff I think it I think it looks with the all the information that you have to deal with which there is a lot you did a really good job of summarizing that and making it clear. I also the thing that came to mind for the summary view up top I think that this single set component is always good for that type of stuff if you you could consider using something that for up there I've seen other pages do that as and what runner does that and then there's a a dev ops report type of thing that does it. And that's called the single stat component. Yeah I'll link it to you from pajamas. Awesome it's pretty flexible too which is great. Then my only other comment was",
      "tokens": [
        50920,
        286,
        632,
        472,
        2871,
        445,
        1566,
        300,
        286,
        1194,
        309,
        1542,
        869,
        286,
        994,
        380,
        754,
        536,
        341,
        264,
        472,
        300,
        291,
        434,
        51220
      ],
      "temperature": 0.0,
      "avg_logprob": -0.12364355723063152,
      "compression_ratio": 1.7168949771689497,
      "no_speech_prob": 0.00015642975631635636
    },
    {
      "id": 233,
      "seek": 140488,
      "start": 1422.16,
      "end": 1463.44,
      "text": "for this would be adding a new navigation item for for groups and we had to do a similar thing for runner I would consider talking to the foundation steam just to make sure I think you have to get approval from them now I can link the handbook page but I also know because they have all their navigation efforts going on it may change something to be aware of. Yeah I know when we were trying to do billing on the growth team we were running into a similar thing there was a process in adding something to the nav I will definitely kind of communicate to this idea with them and see how to go from there. yeah.",
      "tokens": [
        51228,
        337,
        411,
        341,
        576,
        312,
        5127,
        257,
        777,
        17346,
        3174,
        337,
        337,
        3935,
        293,
        51496
      ],
      "temperature": 0.0,
      "avg_logprob": -0.18801258831489376,
      "compression_ratio": 1.5333333333333334,
      "no_speech_prob": 0.00018239540804643184
    },
    {
      "id": 240,
      "seek": 145920,
      "start": 1469.76,
      "end": 1556.0,
      "text": "Erica I think you had the next comment. Yes thanks for sharing this I love that you're sharing that's in this in this meeting. one thing that we're we've learned about the workflow with CI CD variables and the subset of those are secrets is that one of the reasons people want to use the unprotected values is because they tend to use the wrong ones per environment because it's confusing. yeah a subset of that finding is that they use different secrets values for the different environments. I think you could add clarity here if there's a light touch way to even allow people to dig into the different variables that are being used in different environments. I do I think that would help them and it feels if do an overview that that that would be something to highlight or think about. I can definitely think into that I'm still in the process of trying to figure out what is the best information to show here what should be still cut out because some of this deployment information is just copied over from the environment index page. definitely want to do a bit more exploration on is this the amount of information and if there's additional information you said the secrets how do you show that here. thanks for bringing that to my attention.",
      "tokens": [
        50892,
        37429,
        286,
        519,
        291,
        632,
        264,
        958,
        2871,
        13,
        1079,
        3231,
        337,
        5414,
        341,
        286,
        959,
        300,
        291,
        434,
        5414,
        51232
      ],
      "temperature": 0.0,
      "avg_logprob": -0.18798913528670125,
      "compression_ratio": 1.5433526011560694,
      "no_speech_prob": 0.0003583408542908728
    },
    {
      "id": 254,
      "seek": 154008,
      "start": 1559.84,
      "end": 1622.48,
      "text": "thank you all for the feedback by the way I see Will is next. Yeah I think for the summary view some of the things that could be helpful is just being able to identify not just how many environments are in a successful status but also if there's ones that are pending or if there are ones that are failing or having some difficulties just that people can easily click into those and be taken to those somehow and then also I how in your design you're not using that care at Sasha Cordian style menu that that we currently have just because it's nice to be able to just see some of the specific data that users were having to really stumble around to try to find.",
      "tokens": [
        51352,
        1042,
        1309,
        291,
        439,
        337,
        264,
        5824,
        538,
        264,
        636,
        286,
        536,
        3099,
        307,
        958,
        13,
        51600
      ],
      "temperature": 0.0,
      "avg_logprob": -0.12335731365062573,
      "compression_ratio": 1.6325581395348838,
      "no_speech_prob": 8.706204971531406e-05
    },
    {
      "id": 262,
      "seek": 161408,
      "start": 1624.96,
      "end": 2457.12,
      "text": "Awesome yeah thank you that was I know a lot of our research has shown those collapsible sections when you're trying to find a high level view of everything was just not working out I was trying my best not to even collapse any information and just if there's information you that needs to be hidden maybe it's not the place to put it on this page appreciate and you're welcome. Then hi and I think you have the last comments. Yeah just post one on what we'll say about showing information without using that awful pattern of what you're expanding collapsing it just hides all the info that it's essential in this page pretty much in both in this case the group but also the the project level environments view and also plus one on the summary block I think this give users that add what understanding of how their environments are doing across the board and that's important of course not only for the developers but the managers the the director of buyer percent anyone really that is interested in how the application is doing at the higher level I think that's that's be a great addition addition and I have a couple of follow-up questions Emily and I'm sure if you have the time but I think those those are just the things I was thinking of while looking at the prototypes what type of environments will be displayed on this overview just the protected environments production only and also I was wondering how would users set up this overview. Has the team considered if this would be something that would be just pre-populated coming from all the projects that have the have the environments that meet a specific criteria or we users be able to let's say manage and customize that view based on what's important for them to see for each project. Yeah this is a good question for MVC we've really landed on we want to show just production tier environments and then figuring out later we'll need to scale this up to show the different tiers but pre-populate this based on tier of environments this is where the empty state comes in I don't think I'm the one that designed the empty state I grabbed it from one of the others but if you don't aren't using environment tiers using this empty state to encourage users to set that up that they can pre-populate this page but also use this feature which we don't have any area now where we're really encouraging them to do having the empty state is both a bonus of setting up this but also encouraging people to use environment tiers hopefully that answers your question for MVC we are just stick with production tier environments and to set it up would be enabling tiers in your environments to show them pre-populated on this page. Yeah thanks that answers my question I think following up to that and thinking about too is that when you have the chance look at how the MVC plus would look because for example if I'm not mistaken you can have multiple environments under the same tier if you set it up in the CI file you can have I don't know different production environments, label production but put a different name how would that look in the UI how would users customize I think it would be a good step for you there to see how this page would grow because we're not the challenges that we had with the current environments pages that while designing and also coding it we were not thinking of how that page would scale I think you have the the ability here to predict some of the edgegates but also to avoid I'm happy and happy bets in the UI in the overall UX. Yeah for sure yeah that's something and where I'm early enough into the designs here now that I have to build out what does unhealthy environments look what happens when you have a lot on this page I think we still have quite a bit of time to build out all these educations and then once we start showing more than just the production tier how do you set that up what does that view look and everything that I think there's lots of work to be done on this page but it'll be good work to finally get out to users. Yeah awesome and then my next point is about that it seems if you move forward with this approach up for left environments we could potentially deprecate the environment's dashboard view. What are the team discussions about it if there's any discussion going on around deprecating or replacing the page if they were off this group view? Yeah there hasn't been any official conversations going on but I have chatted with Andrew on the team of the reasons of moving away from it and just the performance issues on that page were hard to sort out that that's where this idea has come from and why we might be moving forward with this and some of the performance issues are really hard to solve for but I think we need some written out conversation with the PMs and everyone on that team to figure out is this a a replacement can they work together what are the main pros of this pros of the environment dashboard and really sort that plan out as . Awesome yeah I think that that would be a good put that justification for deprecating or moving away from that environment dashboard view. There's no traffic there as far as I know and to your point there's many restrictions in terms of the performance of that page that I would say if you can it also when you have the decisions and conversations with the team putting the proposal to that how this page will work potentially solve the jobs we don't solve the problems that the environment's dashboard view does not solve . Thank you and then no sorry go ahead. No I just say thank you that's something I definitely have to think on we'll get that written up. Awesome and then my last thing back is just about the UI and then if I zoom in here yeah when I did the validation for the environment's page I learned that that information about the commit message it's irrelevant to users or it's usually irrelevant when that commit is merging or branch or anything into master because it often shows that same the folk message merge branch and then branch name and that's not readable and that's not a very informative to users my feedback here would be check in the the insights I don't remember correctly now what what's the most relevant information that that we should be displaying here to users and see how and if it could be if it could replace the merge branch message because that's what we have today in the environment's page it's just the same message everywhere with the link and there's already much I think you can use that space in in a in a more a different way rather than just showing this message yeah I agree I think there's stuff we can especially that if we can save real estate on anything in this page and take out things that they don't need at this viewpoint something I'm working towards now that's great to know that's something we can potentially take out of this awesome thanks everyone for your feedback I want to give Gina enough time for her points as but I appreciate taking the time to walk through that thanks Emily I have one other question for you I noticed that the the way that you were for each row there was many columns of metadata in there the job all that's up have you heard I got any feedback around how that impacts scanability across different deployments yeah because it is a lot of information as a side note I've added these in here to this I'm still considering it a low fidelity I've just added in what we have on the environment index page and I'm planning in the next version of this to go through see what information we can remove from there see what information is the most important based on conversation with the engineers to for MVC start with what we have and take away from that if possible just we can reuse some components yeah I agree those sections I think need a bit of cleaning up and figuring out what exact information should be placed there the merge branch message taking that away but yeah I agree I think there's some simplification we can still do in that area yeah I'd be if you end up testing this I would be interested in seeing if people say if they if they want to scan my column does formatting the information in that way impacts that because we're doing that in runner and there have been two or two customers who have been I don't I don't want to see it in this list view I'd rather see it in a table but the majority have been saying it's fine to see it in the way that it is but the view I that we're using is very similar I think the insights would carry over to the list good to know and yeah I'm planning to run this through some solution validation as when we have a more finalized design because there's such a big lift to do hopefully we'll get some of the usability comments from that as and then I have one more point there I'm jumping in before we switch but it would be that when you do the solution validation I think try to include more personas than you might not try to push yourself to include more personas we make this work for more people because I think it can have a bigger impact yeah because I think now the dashboard sorry I'll come is not working for some of our personas opening this up to a bunch of other ones is probably the best fact thanks again for all that I will pass it off to Gina now. Hey thanks I have two updates one of them is for pipeline insights we're dealing with this problem of flaky tests if I gave a definition of these are not but the general one is that when you run tests they can sometimes fail but the failure isn't real it wasn't detected it was because the test is written incorrectly or maybe a test that that test relies on failed something that and if it fails more often than it succeeds without detecting a failure it's considered flaky we're trying to understand from users their pain points now their workarounds with how they're dealing with flaky tests and then definitely how they define them the key insight for us here is how they define them because we want to be able to when we define them for this MVC we want to make sure it matches their expectations I included some of the insights that we've heard far we've only met with three users far but we have a few other participants coming up as and then on the runner side we this is one of our our bigger what's a small feature but it's it's an important feature that we've added for runners it has to do with the whole runner fleet monitoring slash q stuff I've been talking about for a while it's it's difficult for users to be able to see if a runner is running a job at the moment and the reason why that's important is because if they were to update the runner for example it would stop that runner from running any jobs they don't want to impact any current running jobs or else the code just it doesn't go out they want to know if if if that runner is running one we've added a badge to be able to see if it's running or if it's idle is the other word that we're using the tough part about this is that now we have two status badges we have one about if the runner is online and if the runner is running a job our next iteration would be combining those into a single status something active where it's running a job and it's online and then that will allow for less less load on the user",
      "tokens": [
        50908,
        10391,
        1338,
        1309,
        291,
        300,
        390,
        733,
        295,
        286,
        458,
        257,
        688,
        295,
        527,
        2132,
        575,
        4898,
        729,
        51148
      ],
      "temperature": 0.0,
      "avg_logprob": -0.1114478728350471,
      "compression_ratio": 1.6415929203539823,
      "no_speech_prob": 0.0010796349961310625
    },
    {
      "id": 392,
      "seek": 244840,
      "start": 2463.92,
      "end": 2512.56,
      "text": "any questions or anything I just want to say I love the idea of combining status badges into one thing that works because I've seen it quite a few times and I think it's in the environments areas as where there's multiple status badges and you're not quite sure how they relate to each other I think that's a great idea thanks it will definitely be a tough thing to do because even with runner because everything's through the CLI too people can now get a list of all online runners but all those statuses would have to change it's be a long a long process",
      "tokens": [
        51140,
        604,
        1651,
        420,
        1340,
        51640
      ],
      "temperature": 0.0,
      "avg_logprob": -0.2683878697847065,
      "compression_ratio": 1.3738317757009346,
      "no_speech_prob": 0.0016720484709367156
    },
    {
      "id": 399,
      "seek": 253104,
      "start": 2531.12,
      "end": 2545.2,
      "text": "I think that's it I don't think anybody has anything else thanks for meeting today",
      "tokens": [
        50368,
        731,
        286,
        519,
        300,
        311,
        309,
        286,
        500,
        380,
        519,
        4472,
        575,
        1340,
        1646,
        370,
        3231,
        337,
        3440,
        965,
        51072
      ],
      "temperature": 0.0,
      "avg_logprob": -0.36985238393147785,
      "compression_ratio": 1.3157894736842106,
      "no_speech_prob": 0.015130911953747272
    },
    {
      "id": 400,
      "seek": 253104,
      "start": 2548.48,
      "end": 2550.64,
      "text": "see everybody soon next week maybe",
      "tokens": [
        51236,
        536,
        2201,
        2321,
        958,
        1243,
        1310,
        51344
      ],
      "temperature": 0.0,
      "avg_logprob": -0.36985238393147785,
      "compression_ratio": 1.3157894736842106,
      "no_speech_prob": 0.015130911953747272
    }
  ],
  "full_text": "I can introduce the date also. This is the CSED UX team meeting on November l6th of 2O22. It's almost 2O23, which is crazy. Hi, and I'll just I'll leave it to you. All . Thank you, Gina. I cannot see the agenda. My iPad is acting up. But , I think my first item. It's about severity labels. I'm not mistaken. just a heads up for product designers. Please don't forget to add severity labels to your UX issues, especially the suspecting ones. The boat will annoy you if you don't. it's a good way of reminding us to label those issues and accordingly that we can have help with prioritization. But also, I've seen some issues. You might see Valerie also doing some housekeeping on those on those issues and leaving comments, but there are some issues. There are not label UX, but they do have your extra requirements. I review one for verify today. And I, I just didn't know about the fact that it was a back in issue, but it changed statings and it changed UI copy. But it didn't have UX or a severity added. just a reminder. For everyone to please. Make sure that the issues that you and your team are working on. Have the correct labels applied. That's one. And then my other updates about hiring. Have a new product designer joining the pipeline insights team. in the coming months. We don't have a start date yet, but she will take over from five planning sites that Gina can transition full time to runner. it's gonna happen. Then we'll say no more about that the start date and yeah, just to onboarding all that everybody know. that's that for me. Gina, you have a year off next. Yes, there's an issue that I linked here that Amelia had brought up about discussing how to better collaborate with designers but I think it also applies with research and even technical writing, cross stage or cross group. I just mentioned it to this group. I think a few of us have already jumped into it, but I think this group does a really great job of collaborating. I was encouraging you to share your thoughts if you have time. And I think we were gonna try to start from the bottom of the agenda today, Erica, if you wanted to start. , that's a great tie in because working backward from my list, one of the things was that we have, I wanted to celebrate the. list. One of the things was that we have, I wanted to celebrate the my my updates today are framed around welcome back Hannah. I wanted to know that Gina and Will got sick and tested such that I couldn't go to the conference. And Gina stepped into this leadership position, will really delivered. And we have four reports, I know amazing, I coupon, four reports that we hammered out because of the data they collected. And then one more on the way which which ties into the issue that Gina just showed about cross stage collaboration. we we set up a game we gamified the interviews instead of running them just in a conversational way. And we were able to get great data. And I think we got actionable data. we're still working on that report and it's setting up a secret scan which we all want to be working on . that was really good. Yay! And then my last item too is just asking if if you all would to open up the H2 Verifying Package Common Screener for solution validation studies. I just wanted to check if it's worth making that change with Caitlin. And I linked a PDF of the of what the questions are and is long. But we have 5OO participants in there and some of them have been used. But I think I'll give you time. You can just mention me in the notes to give you time to look at it and just know how many studies we might recruit for. And then my other findings are just an overview of the Q4 prioritization. the big one is that we have a pre-work issue set up for Q3 to do some pre-work related to a benchmark. Dare I say it for a package? I'm a nervous. But . yeah. we'll hopefully do a benchmark for a package in Ql. Fiscal Year 23 starting in l59 waiting for design and PM resources to come online. But before then I'm just doing work to crosswalk the stages that have done this before to make sure what we do is on par. And then we also related to package resources. We put on hold this cycle of an image study until the new PM joins. that would be the study that we did with secrets and CI templates where it's how does it start? What happens next? What happens next? We would use that framework. And that's on hold for the new PM. We think it's exciting for the new PM to work on. But I think the benchmarks would get priority and then it would go to that study. One more thing to mention about that is Gina has a really cool issue, a research issue around looking at the lifecycle of logs. And part of me wants to try to fold that into this study. That's no one holds. But I think we're getting feedback that we need to scope that Gina's study down a little bit. but does note that I have a plan because I think it's really smart. in foundational research terms. Sorry, I didn't wait for Hannah to say that thanks for the heads up on the benchmark. Yes, sorry, my Google docs keeps, keeps crashing on me. I'm I can not finish writing my question. yeah, about package, I have a question for you, Erica. I cannot open the issue now. On my iPad, but the pre-work issue is for the benchmark aid, ? For package. Yes, and correctly. Yes. And it's all things that I want to do. I'm comparing the screener questions because I think that and I worked on benchmarks in a lot of previous roles. And one thing we want to see is how much we can compare across stages, which means looking at how comparable the samples are. And did we all use the same screener? And what's the alignment? In part, I'm doing that that I'm not making us be too rigorous with finding a counterbalance sample. But whatever we've done is an amazing iteration. But we just want us to track it explicitly we know. it's mainly me doing the pre-work of what were the screeners? What's our screener looks ? I have our screener drafted. And whenever Tim had time, he can come in. I think the idea would be we would treat it a common screener and then be in a position to run the next benchmark. we would have 5OO participants, we could select from. If we start rolling it out as soon as we're ready. And we're just waiting on Tim to have time. it's what were the screeners? How are the samples comparing? And that will help us know. I think what I'm seeing far is we're mainly small medium business samples, which is fine to know, ? But it means we don't have to then stretch to do an enterprise recruit. we want to be on par. And then I'll be looking at all of the mechanisms that different researchers use to get feedback. Will has this lovely URL approach that he used for jobs to be done deciding on the tasks. And then working with Tim to figure out what the team has capacity for. I feel we'll go more bare bones, which is also . But in a couple weeks when we get back from the Thanksgiving holiday, meet with Tim to give the updates and then see what his thoughts are related to the the next steps. And my plan was just to use those little half hour meetings that I have set up with him. they don't take too much time. And then the last thing that I'll look at across those stage areas is just the level at which the tasks were framed. Because that can impact performance too. I think we'll also help elevate the research program. With this work. . I'm taking some notes here. Thank you. I think you're for the overview that that clarifies my next couple of questions. And then I just want to say please keep me in the loop. Because if we know a bit ahead of what the UX I'll say hands on design work for package is look . I need to know to prepare the UX coverage because we won't have UX location for package until next year Q3 Q4. . Yeah. We've made a decision to because team and Victor also Michelle they talk about the deliverable plans for package now. That's for everybody to be aware that they're hiring developers. They don't have for example front end allocation to build UI now. we are not be hiring a designer for package now. We move the headcount to a different team and then we won't have a designer for package until next year once development picks up. But if there is a the research is going on and we have the hiring for development also picks up and we know that we have a need for package UX deliverables then yeah I'll need to know ahead of time that we don't work on a coverage or borrow plan or a hiring plan for the for the design backfill for Katie's backfill. But just you're aware that yeah we're not playing any own deliverables for package because we don't have anyone allocated there. And maybe we work backwards from that too. I don't know. I really wanted to contribute to the R I'm just kidding or we're trying. But I think I think it would be to get those findings and then have the designer as they on board pick up with them as long as we set the expectations everyone knows that that's our plan. This seems but we'll let Tim guide us. But thank you for the update. . Keep me keep me the one. . Sure. Just got a couple updates. I'm using the same prioritization issue in Q4 as I used in Q3. I'm trialing just a longer term prioritization issue that goes two quarters as opposed to one just to see how that process goes. I did add a comment in the issue with just some updates on what projects we accomplished in Q3 if you want to check that out you're welcome to do . And we're still collecting projects for Q4 but I've listed within that comment what projects we're expecting to take on this quarter. Aside from that also met up with Emily on Sunday which was awesome. We got to have dinner. It was nice to just meet another person. I've met half the people on this call which I never thought when contribute got cancelled for the year but yes just been great to slowly meet more and more team members as a bit a part of the company. And my final update is that I've been reviewing scenarios off and on for Emily's CMS study on environment management and she's been really putting a lot of effort into that over the past couple weeks. Any questions for I turn it over to Emily? Emily you could take it away. I'll go a little out of order because I'll get to my critique one at the end but I was mostly curious now that I'm getting to the stage of conducting the CMS interviews with internal users just some of the things you did to recruit people. I know we're using some people from the delivery team who've already offered to volunteer but just any other options to get people into the study I'm looking for it's Will and Gina both had to comments around that? Sure I haven't done this a ton. I did this probably the most after I started to get lab just because I wasn't sure how to get internal people to begin with and I've posted on Slack channels just I try to keep a very concise message of who I'm looking for, what dates just any a summary of details about the study and just try to post them on different channels. Sometimes I've leaned on the PM to try to help direct me to the channels to go to but since you're working a lot with the delivery team they might help where to post or you could just talk to the participants that you have signed up and say hey now that you've gone through this study is there someone else on your team that might be good for this? You mine was just plus wanting to what will said I have posted in what's happening at GitLab before that has gotten traction and then I also found that linking to the research issue helps allow them allowing them to get contacts around with the researches about. Awesome sounds good. There's a hyanoilifta comment as as a puzzling. Yeah I'm trying my my girl dogs are just not loading. I think I wrote down about yeah looking of course in the handbook we have a section with the internal customers for each stage group and then on which page is that? On the handbook product slash categories and if our release stage it's a delivery distribution team security just echoing what the will and Gina say most of those groups they have their own Slack channel can drop that same message in there then we need to reach out directly to people. I think for the release the delivery team they have super active it's easy to find those connections through them and also ask who is someone that is working or has used xyz feature functionality in the if contact with them but in Gina and will they already gave the best tips just echoing what they say. Cool the second update I wanted to give is we adjusted the deployments navigation now when you click on the high level deployments you land on the environments page not feature flags because there's a lot of data showing that people would land on feature flags and navigate away as there was comments about this in our benchmarking study that is now in production which is really great and then will I know as you had a comment on that as . Yes you talked about we did see this a lot in the benchmarking study and I would just constantly see participants click on the link and know that they weren't go to the place and then they would just get frustrated and then have to use that extra click to go to the page I know that's be a big time change. Awesome and to do a time to do a little design review I think we still have 2O minutes I try I will try not to take up all the time but just wanted to make sure I wasn't taking up too much time the background of this this has been a long standing issue that's opened that we want to design a page that for MVC starts out to host production environments across a group we've seen a lot of research showing that users are having a lot of problems tracking environments at the group level and they're having to go to each project bubble page track statuses on there crafting up a page here that people would be able to see a high level summary and then be able to click in and take action if needed. I hi I think you for telling me to just step back and start from scratch because that really got me started quite but I'll go ahead and share my screen if I can figure out what screen I have to share this one. how I started this is I really took a step back and went through the research and this page is interesting because it's not a typical flow users wouldn't be going here to complete a typical flow but I did want to get onto paper some of the tasks that the research showed that they were looking for. I don't know if I should go into this if this is be public but you can take a look at some of this and then just taking a step back and really figuring out this is a high level view what do users really want to understand and starting from the information architecture point of view here not even designing something just trying to figure out from a high level what we should be showing on this page. with some a team feedback I've done some St. Cals with the engineers on this I landed on something this where we would show production environments a top-level summary of your environment health across the group how many environments are healthy are you having problems with any of them. a little TBD on what to show in this area but really having that high level summary and then being able to dig down if you need and then when you go into the environment showing an environment level summary of that production environment with environment health project the deployment the most recent deployment health and then some actions you can take as as showing that most recent deployment you have context of what is going into that environment currently. I've cut it down quite a bit from some of the original proposals because this page we really want to show them what is going on and not bog them down by a bunch of different information that they could dig into and find. I've moved it into this again as you can see this is a really big TBD I want to create a nice summary at the top but showing this into group name environment at the production tier is the most recent deployment successful is there anything action you have to take and then showing details about the most recent deployment underneath it with options to view and project and debug problems going that way but by condensing this information down reducing the amount of pagination you need being able to show things all on one page and being able to show just the information you need to take the action that you need to take open to suggestions on this but that's how I've started this it's still fairly rough there's I do want to run this by some users as but but I would get first feedback look even though this is a rough low fidelity now. I had one comment just saying that I thought it looks great I didn't even see this the one that you're showing now I only saw the IA stuff I think it I think it looks with the all the information that you have to deal with which there is a lot you did a really good job of summarizing that and making it clear. I also the thing that came to mind for the summary view up top I think that this single set component is always good for that type of stuff if you you could consider using something that for up there I've seen other pages do that as and what runner does that and then there's a a dev ops report type of thing that does it. And that's called the single stat component. Yeah I'll link it to you from pajamas. Awesome it's pretty flexible too which is great. Then my only other comment was for this would be adding a new navigation item for for groups and we had to do a similar thing for runner I would consider talking to the foundation steam just to make sure I think you have to get approval from them now I can link the handbook page but I also know because they have all their navigation efforts going on it may change something to be aware of. Yeah I know when we were trying to do billing on the growth team we were running into a similar thing there was a process in adding something to the nav I will definitely kind of communicate to this idea with them and see how to go from there. yeah. Erica I think you had the next comment. Yes thanks for sharing this I love that you're sharing that's in this in this meeting. one thing that we're we've learned about the workflow with CI CD variables and the subset of those are secrets is that one of the reasons people want to use the unprotected values is because they tend to use the wrong ones per environment because it's confusing. yeah a subset of that finding is that they use different secrets values for the different environments. I think you could add clarity here if there's a light touch way to even allow people to dig into the different variables that are being used in different environments. I do I think that would help them and it feels if do an overview that that that would be something to highlight or think about. I can definitely think into that I'm still in the process of trying to figure out what is the best information to show here what should be still cut out because some of this deployment information is just copied over from the environment index page. definitely want to do a bit more exploration on is this the amount of information and if there's additional information you said the secrets how do you show that here. thanks for bringing that to my attention. thank you all for the feedback by the way I see Will is next. Yeah I think for the summary view some of the things that could be helpful is just being able to identify not just how many environments are in a successful status but also if there's ones that are pending or if there are ones that are failing or having some difficulties just that people can easily click into those and be taken to those somehow and then also I how in your design you're not using that care at Sasha Cordian style menu that that we currently have just because it's nice to be able to just see some of the specific data that users were having to really stumble around to try to find. Awesome yeah thank you that was I know a lot of our research has shown those collapsible sections when you're trying to find a high level view of everything was just not working out I was trying my best not to even collapse any information and just if there's information you that needs to be hidden maybe it's not the place to put it on this page appreciate and you're welcome. Then hi and I think you have the last comments. Yeah just post one on what we'll say about showing information without using that awful pattern of what you're expanding collapsing it just hides all the info that it's essential in this page pretty much in both in this case the group but also the the project level environments view and also plus one on the summary block I think this give users that add what understanding of how their environments are doing across the board and that's important of course not only for the developers but the managers the the director of buyer percent anyone really that is interested in how the application is doing at the higher level I think that's that's be a great addition addition and I have a couple of follow-up questions Emily and I'm sure if you have the time but I think those those are just the things I was thinking of while looking at the prototypes what type of environments will be displayed on this overview just the protected environments production only and also I was wondering how would users set up this overview. Has the team considered if this would be something that would be just pre-populated coming from all the projects that have the have the environments that meet a specific criteria or we users be able to let's say manage and customize that view based on what's important for them to see for each project. Yeah this is a good question for MVC we've really landed on we want to show just production tier environments and then figuring out later we'll need to scale this up to show the different tiers but pre-populate this based on tier of environments this is where the empty state comes in I don't think I'm the one that designed the empty state I grabbed it from one of the others but if you don't aren't using environment tiers using this empty state to encourage users to set that up that they can pre-populate this page but also use this feature which we don't have any area now where we're really encouraging them to do having the empty state is both a bonus of setting up this but also encouraging people to use environment tiers hopefully that answers your question for MVC we are just stick with production tier environments and to set it up would be enabling tiers in your environments to show them pre-populated on this page. Yeah thanks that answers my question I think following up to that and thinking about too is that when you have the chance look at how the MVC plus would look because for example if I'm not mistaken you can have multiple environments under the same tier if you set it up in the CI file you can have I don't know different production environments, label production but put a different name how would that look in the UI how would users customize I think it would be a good step for you there to see how this page would grow because we're not the challenges that we had with the current environments pages that while designing and also coding it we were not thinking of how that page would scale I think you have the the ability here to predict some of the edgegates but also to avoid I'm happy and happy bets in the UI in the overall UX. Yeah for sure yeah that's something and where I'm early enough into the designs here now that I have to build out what does unhealthy environments look what happens when you have a lot on this page I think we still have quite a bit of time to build out all these educations and then once we start showing more than just the production tier how do you set that up what does that view look and everything that I think there's lots of work to be done on this page but it'll be good work to finally get out to users. Yeah awesome and then my next point is about that it seems if you move forward with this approach up for left environments we could potentially deprecate the environment's dashboard view. What are the team discussions about it if there's any discussion going on around deprecating or replacing the page if they were off this group view? Yeah there hasn't been any official conversations going on but I have chatted with Andrew on the team of the reasons of moving away from it and just the performance issues on that page were hard to sort out that that's where this idea has come from and why we might be moving forward with this and some of the performance issues are really hard to solve for but I think we need some written out conversation with the PMs and everyone on that team to figure out is this a a replacement can they work together what are the main pros of this pros of the environment dashboard and really sort that plan out as . Awesome yeah I think that that would be a good put that justification for deprecating or moving away from that environment dashboard view. There's no traffic there as far as I know and to your point there's many restrictions in terms of the performance of that page that I would say if you can it also when you have the decisions and conversations with the team putting the proposal to that how this page will work potentially solve the jobs we don't solve the problems that the environment's dashboard view does not solve . Thank you and then no sorry go ahead. No I just say thank you that's something I definitely have to think on we'll get that written up. Awesome and then my last thing back is just about the UI and then if I zoom in here yeah when I did the validation for the environment's page I learned that that information about the commit message it's irrelevant to users or it's usually irrelevant when that commit is merging or branch or anything into master because it often shows that same the folk message merge branch and then branch name and that's not readable and that's not a very informative to users my feedback here would be check in the the insights I don't remember correctly now what what's the most relevant information that that we should be displaying here to users and see how and if it could be if it could replace the merge branch message because that's what we have today in the environment's page it's just the same message everywhere with the link and there's already much I think you can use that space in in a in a more a different way rather than just showing this message yeah I agree I think there's stuff we can especially that if we can save real estate on anything in this page and take out things that they don't need at this viewpoint something I'm working towards now that's great to know that's something we can potentially take out of this awesome thanks everyone for your feedback I want to give Gina enough time for her points as but I appreciate taking the time to walk through that thanks Emily I have one other question for you I noticed that the the way that you were for each row there was many columns of metadata in there the job all that's up have you heard I got any feedback around how that impacts scanability across different deployments yeah because it is a lot of information as a side note I've added these in here to this I'm still considering it a low fidelity I've just added in what we have on the environment index page and I'm planning in the next version of this to go through see what information we can remove from there see what information is the most important based on conversation with the engineers to for MVC start with what we have and take away from that if possible just we can reuse some components yeah I agree those sections I think need a bit of cleaning up and figuring out what exact information should be placed there the merge branch message taking that away but yeah I agree I think there's some simplification we can still do in that area yeah I'd be if you end up testing this I would be interested in seeing if people say if they if they want to scan my column does formatting the information in that way impacts that because we're doing that in runner and there have been two or two customers who have been I don't I don't want to see it in this list view I'd rather see it in a table but the majority have been saying it's fine to see it in the way that it is but the view I that we're using is very similar I think the insights would carry over to the list good to know and yeah I'm planning to run this through some solution validation as when we have a more finalized design because there's such a big lift to do hopefully we'll get some of the usability comments from that as and then I have one more point there I'm jumping in before we switch but it would be that when you do the solution validation I think try to include more personas than you might not try to push yourself to include more personas we make this work for more people because I think it can have a bigger impact yeah because I think now the dashboard sorry I'll come is not working for some of our personas opening this up to a bunch of other ones is probably the best fact thanks again for all that I will pass it off to Gina now. Hey thanks I have two updates one of them is for pipeline insights we're dealing with this problem of flaky tests if I gave a definition of these are not but the general one is that when you run tests they can sometimes fail but the failure isn't real it wasn't detected it was because the test is written incorrectly or maybe a test that that test relies on failed something that and if it fails more often than it succeeds without detecting a failure it's considered flaky we're trying to understand from users their pain points now their workarounds with how they're dealing with flaky tests and then definitely how they define them the key insight for us here is how they define them because we want to be able to when we define them for this MVC we want to make sure it matches their expectations I included some of the insights that we've heard far we've only met with three users far but we have a few other participants coming up as and then on the runner side we this is one of our our bigger what's a small feature but it's it's an important feature that we've added for runners it has to do with the whole runner fleet monitoring slash q stuff I've been talking about for a while it's it's difficult for users to be able to see if a runner is running a job at the moment and the reason why that's important is because if they were to update the runner for example it would stop that runner from running any jobs they don't want to impact any current running jobs or else the code just it doesn't go out they want to know if if if that runner is running one we've added a badge to be able to see if it's running or if it's idle is the other word that we're using the tough part about this is that now we have two status badges we have one about if the runner is online and if the runner is running a job our next iteration would be combining those into a single status something active where it's running a job and it's online and then that will allow for less less load on the user any questions or anything I just want to say I love the idea of combining status badges into one thing that works because I've seen it quite a few times and I think it's in the environments areas as where there's multiple status badges and you're not quite sure how they relate to each other I think that's a great idea thanks it will definitely be a tough thing to do because even with runner because everything's through the CLI too people can now get a list of all online runners but all those statuses would have to change it's be a long a long process I think that's it I don't think anybody has anything else thanks for meeting today see everybody soon next week maybe",
  "word_count": 6074,
  "segment_count": 16,
  "cleaned_at": "2025-10-27T16:24:47.822024"
}