{
  "content": "GitLab licensing technology to independent Chinese company FAQ\nOn this page you can view frequently asked questions about GitLab licensing its technology to a new, independent Chinese company.\nOverview\nGitLab announced that it has licensed its technology to a new, independent Chinese company\n. The independent company will help drive adoption of the GitLab complete DevOps platform in China and foster the GitLab community and open source contributions.\nQ. Will existing China reseller and systems integrator customers move to JiHu?\nAt this time, JiHu has just formed, and currently is not offering any product solutions. Users in the local market in China will be informed as soon as JiHu launches product offerings.\nQ. Will JiHu have a different terms of service and customer acceptance policy than GitLab Inc.?\nJiHu is an independent company and will set up their own terms of service and customer acceptance policy. They do not have any obligation to follow GitLab Inc.s terms of service or policies.\nQ. Has GitLab Inc. coordinated with the Chinese government to establish the new company?\nNo, GitLab Inc. has not been working with the Chinese government. JiHu has been working with the Chinese government independently to file the required paperwork to become an official company in China and secure the appropriate licensing for the SaaS business, as required.\nQ. How will intellectual property work between GitLab Inc. and JiHu?\nThere will be three distributions of the GitLab product: CE (Community Edition), EE (Enterprise Edition), and JH (JiHu Edition). The CE distribution will continue to be available globally. The EE distribution will only be sold outside China. The JH distribution will only be sold in China.\nGitLab and JiHu will use two separate repositories where GitLabs repository will be upstream and JiHus repository will be downstream. Changes to GitLab CE and EE will be one-way mirrored to the JiHu Edition, however, changes to the JiHu Edition will not be mirrored back to GitLab CE and EE.\nInstead of mirroring, JiHu will be able to contribute to the Community Edition and Enterprise Edition by following the same meticulous protocols we already have in place for our current contributors. Each contribution must meet GitLabs rigorous standards for security and code quality before being added to the GitLab application.\nAs an independent company, JiHu will manage its own technologies and infrastructure. JiHus SaaS service (GitLab.cn) and GitLab Inc.s SaaS service (GitLab.com) will share no common infrastructure, networking connectivity, systems, services, data, or resources.\nQ. Will JiHu contribute code back to GitLab? How will GitLab Inc. protect the code base from potential malicious intent?\nThere will be three distributions of the GitLab product: CE (Community Edition), EE (Enterprise Edition), and JH (JiHu Edition). There are two separate and distinct code repositories: One containing only the CE and EE distributions and another uni-directionally mirrored repository containing CE, EE, and the JH distribution.\nThe CE distribution will continue to be offered as FOSS (free open source software).\nThe EE distribution will be offered to customers outside of China and will not contain the JH distributions generally contributed features or code. All incremental contributions from JiHu to CE and EE will be upstreamed as merge requests to GitLab Inc.s maintainers for enhanced security review prior to acceptance.\nThe JH distribution will only be offered to customers inside China.\nGitLabs code is source-available and the open source components of GitLab are published under an MIT open source license\n. Like the hundreds of contributions we receive each month from our global community, JiHu will contribute to GitLab CE and EE following the same meticulous protocols we already have in place. Each contribution must meet our rigorous standards for security and code quality before being added to the GitLab application. GitLab Inc. is the maintainer of CE and EE and is solely able to approve merge requests into CE and EE following our software supply chain security procedures. GitLab Inc. will retain full merge rights and control over everything that goes into CE and EE.\nGitLab Inc. has also instituted additional code audit and security oversight for code contributed by JiHu and the open source community in China to ensure both quality and security. We will follow existing processes for security reviews for externally contributed code, with a focus on code functionality that includes any of the following: processing credentials/tokens, storing credentials/tokens, logic for privilege escalation, authorization logic, user/account access controls, and authentication mechanisms. The\nGitLab Inc. Security team\nwill continue to work with our\nDeveloper Relations team\nto ensure that security reviews are conducted according to our established standards.\nQ. How will GitLab prevent supply chain attacks?\nGitLab is able to provide added stringent safeguards for our customers by increasing our deliberate security protections and ensuring additional degrees of separation between GitLab and JiHu. To protect the integrity of the GitLab brand and to ensure the security of our software product and prevent supply chain attacks, we have made a thoughtful decision to license our technology to an entirely independent and local China-based company that enables us to institute even stronger separation between our customers in various markets as well as within our development and hosting environments.\nGitLabs code is source-available and the open source components of GitLab are published under an MIT open source license\n. GitLab code contribution processes have been specifically developed to identify and protect against malicious code and supply chain attacks. There are a multitude of controls in place today that already help us detect and prevent a supply chain attack on the GitLab application, including: code review, table top exercises, pre- and post-deployment security assessments/tests, continual testing of GitLab Inc.s cloud environment, and various detection and alerting technologies. We continue to invest in best-in-class processes as the industry evolves to retain strong controls on contributor identities and bolster our security practices. In addition,\nGitLab Inc.s Red Team\nroutinely performs specific exercises simulating supply chain attacks to validate and improve on all controls. We work closely with bounty programs, as well as security assessment and penetration testing firms to ensure external review of our security posture.\nLast modified April 11, 2025:\nFix broken links (\nff74946e\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/company/faq-gitlab-licensing-technology-to-independent-chinese-company/",
    "title": "GitLab licensing technology to independent Chinese company FAQ | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:51:25.876657",
    "content_length": 6739,
    "section": "handbook"
  },
  "processing": {
    "original_length": 6739,
    "cleaned_length": 6727,
    "cleaned_at": "2025-10-27T16:13:42.670046",
    "processor": "text_cleaner_v1",
    "word_count": 1034
  }
}