{
  "content": "Cynthia 'Arty' Ng README\nPersonal readme page for Cynthia Arty Ng, Staff, Strategy & Operations, Office of the CPO, GitLab\nThis page is meant to provide a bit of information about me and how I work,\nin the hopes of building trust and giving others an idea of what it might be like to work with me.\nIts also meant to make it easy to find and talk to me.\nA little about me\nIm often described as someone who is a bridge between the technical side and the user-facing side.\nThis is actually my first tech job, and first startup. I come from a mostly public services background,\nhaving been a teacher and librarian, with a significant focus on technology and accessibility.\nI used to be a manager, and I clearly still have a fairly manager-like outlook on a lot of work,\nbut I purposely went back to being an individual contributor,\nespecially to focus on project work, and collaborate with other teams.\nI believe Ive come to really embrace the\nGitLab Values\n,\nbut it initially took me months to really internalize,\nand Im still working on excelling in some areas.\nAside from work, youll hear me talk about all sorts of things, but namely\nbooks, movies, food, birds (and birding), puzzles, Lego, Canada, languages, and plushies (check out the pets page)!\nMy assumptions\nBeing at GitLab, I generally assume that people are following or embody the\nGitLab Values\n.\nIn particular, the assumptions I have about others tend to be the same things people say about me:\nYoull\ndo what you say you will\n.\nYoull\nshare, especially by asking for help\n.\nYoure\ndirect\n.\nYoull\nprovide feedback if you have any\n.\nAvailability and communication preferences\nI prefer asynchronous written communication, but also love to chat and get to know team members.\nNot urgent? Mention me on an issue.\nUrgent or time sensitive? Ping me on Slack.\nIm a big fan of donut/coffee chats, and learning more about others.\nIf you would like a synchronous meeting, feel free to find a free time on my calendar and send an invite.\nIf its outside my working hours, you can still send an invite to propose a time.\nFinding me\nYou will find me regularly in team meetings,\nand in various\ndonut\nchannels.\nI also participate in\nTMRGs\n,\nnamely Women+, and Global voices.\nWays to connect with me:\nSlack: arty-chan\nGitLab (internal)\nSupport Driven\nWrite the Docs\nGitLab.com:\n@cynthia\nPersonal Blog:\ncynthiang.ca\nDigital card (with links to social accounts):\nAbout.Me\nExpertise\nTechnical topics (as of 2023-11-01):\nAuthentication/Authorization (SAML, SCIM, permissions, etc.)\nCI\nCustomersDot, especially CDot  GitLab.com connections, and console\nSaaS, including GitLab.com console\nUser account issues, including intersection with legal/security\nUsing GitLab for work\nWorkflow/Processes\nDocumentation\nTraining\nUX/Accessibility\nCross-team communication\nTracking and prioritizing work, including for performance reviews and promotions\nApplying GitLab values, including TeamOps\nMentoring/coaching and being a non-manager leader\nStrengths and weaknesses\nI take ownership of my work and focus on results with a bias for action.\nAt best, this means I deliver, and get a lot done.\nAt worst, I lose focus of the human element, seem very certain of an opinion, and/or Im unintentionally discouraging or not giving others the opportunities to contribute.\nWhat to do at its worst\n: Tell me youd like to contribute or remind me to think of the human impact.\nLet me know that you might disagree with my idea, as many of them may sound like strong opinions even though they are not.\nBecause I dont do this consciously, I will never get mad at someone for letting me know.\nIm direct.\nAt best, it means Im being transparent and providing feedback.\nAt worst, the feedback will read as criticizing, forgetting the kind part of\ndirectness\n.\nWhat to do at its worst\n:\nGive me feedback\non what didnt work for you.\nLevel of directness varies by country/culture and I recognize that Im on the direct end, so its okay to remind me of that.\nI reprioritize constantly.\nAt best, this means that important and impactful things get done quickly.\nAt worst, it means that I miss a deliverable that you were waiting for.\nWhat to do at its worst\n: Give me a deadline for what you need. Check in on progress if you need to.\nIf what Im prioritizing doesnt match your priorities, I should be able to articulate whats blocking me.\nI like to share ideas and solve problems out loud.\nAt best, this means great brainstorming sessions.\nAt worst, I dont think something through before I blurt it out, it might seem dismissive of others ideas, or dominate the discussion.\nWhat to do at its worst\n: Ive been working on doing this less in group settings, but tell me if Im talking too much.\nI want to consider all aspects.\nAt best, this means lowering risk, and making people feel included.\nAt worst, I make things seem more complex than they need to be, or I cause information overload.\nWhat to do at its worst\n: Ask me to summarize and simplify.\nIm great at making connections.\nAt best, I get to know a lot of people and things, and connect them.\nAt worst, it means Im a jack of all trades, master of none kind of person.\nWhat to do at its worst\n: Block off some time in my calendar if youd like me to dig deeper into something (with you).\nLast modified July 4, 2025:\nRemove or update outdated OCEO info (\n98f3ffe0\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/product/readmes/cynthia/",
    "title": "Cynthia 'Arty' Ng README | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:49:53.632019",
    "content_length": 5409,
    "section": "handbook"
  },
  "processing": {
    "original_length": 5409,
    "cleaned_length": 5370,
    "cleaned_at": "2025-10-27T16:13:42.676668",
    "processor": "text_cleaner_v1",
    "word_count": 938
  }
}