{
  "content": "How to build a remote team\nHow to build a remote team\nHow it works at GitLab\nFor GitLab, being an all-remote company did not start as an intentional decision. It was a natural evolution as our first team members started choosing to work from home.\nTraditional, on-site companies often take processes, camaraderie, and culture for granted and allow it to develop organically. But in an all-remote company, you have to organize it. This can be hard to do at first, but then as you scale it becomes more efficient, while the on-site, organic approach can quickly fizzle out.\nNow that were the worlds largest all-remote company with over 1,300 team members in 65+ countries, weve learned a lot at GitLab about how to collaborate effectively and strengthen our culture, all while working remote. Take a look at how we make it work.\nWe facilitate informal communication\nMaking social connections with coworkers is important to building trust within your organization. One must be\nintentional\nabout designing\ninformal\ncommunication when it cannot happen more organically in an office. All-remote companies need to facilitate these interactions for their teams.\nLearn more about\nenabling informal communication in an all-remote company\n.\nHandbook, goals, and documentation\nRemote work is also what led to the development of our publicly viewable\nhandbook\n, which captures everything youd need to know about the company. If you cant tell, we like\nefficiency\nand dont like having to explain things twice.\nEach department and teams quarterly goals, or\nobjectives and key results (OKRs)\n, are also clearly documented in our handbook for visibility across the company. We check in on these goals monthly, so theres as much transparency as possible around what each team is accomplishing.\nOur approach to\ndocumentation\nalso helps with\nonboarding new team members\n, because everything they need to know is in one place.\nWe also have an extensive\nonboarding template\nand we host a\nGitLab 101\nfor new hires to ask questions.\nDocs instead of whiteboards\nWere often asked, But how do you whiteboard without everyone physically together? We use Google Docs for collaboration. Every\nmeeting\nhas a Google Doc agenda, which is used for documenting discussions, decisions, and actions. Everyone in the meeting can add notes at the same time, and we even finish each others sentences sometimes.\nBy brainstorming in text instead of drawings, were forced to clearly articulate proposals, designs, and ideas, with less variance in interpretations. A picture may be worth a thousand words, but its also open to as many interpretations as there are people viewing it.\nWith Google Docs, we use indentations to go more in-depth on a given topic. This method retains context for comments, discussions, and ideas, even if someone wasnt present for the original conversation.\nDocs instead of water coolers\nDocumentation also helps with transparency, which is critical to remote work. While decisions made around office water coolers may be familiar in traditional workplaces, input is limited to those present.\nThose who are not present feel left out, and youre missing an opportunity to hear different perspectives.\nThe GitLab way of working is more\ninclusive\n. By documenting everything, no one is left out of the conversation and a diverse set of perspectives can be heard, not only from GitLab team members but also from customers and community contributors.\nWere transparent about hiring and compensation principles\nHiring\nWeve published our\nhiring process\n, including example screening questions, in our handbook.\nWhile this may be unique, we see it as simply staying true to our\ntransparency value\n. The process shouldnt be a mystery.\nLetting candidates know what to expect allows them to focus on whether the role and the company are right for them, while we evaluate that too.\nCompensation\nAs an all-remote organization with team members and candidates around the world, its also important that were as open as possible about our\ncompensation principles\n.\nThats why we created a\ncompensation calculator\nthat helps determine compensation for more than 200 regions globally.\nTake a look at\nhow our compensation calculator works\n, and learn more about\nwhy we pay local rates\n.\nCountry hiring guidelines\nHiring globally as an all-remote company has many\nadvantages\n, including bringing diversity to our team. But it also poses unique\nchallenges\nbecause many countries differ in their rules, laws, and regulations.\nFind out more about how we handle this in our\ncountry hiring guidelines\nin the handbook.\nWe encourage flexibility and balance\nWork from anywhere\nIn the\nGitLab Unfiltered\nvideo above, two GitLab colleagues discuss the benefits of living in a lower cost-of-living environment near friends, family, and community.\nAt GitLab, when we say our people can work from\nanywhere\n, we really mean it. We care about the\nresults\nof their work, not where its getting done.\nThis flexibility often means something different for\neach person at GitLab\n.\nThere are others who join and travel the world with remote co-working and co-living\norganizations\n.\nMany of our team members appreciate the ability to still be able to work while visiting friends or family away from home.\nEven for those who typically work in their home office, this\nflexibility\nmeans they can do things like run errands on a weekday, take their child to school, spend more time with family, or walk their dog during the day.\nWe have a channel on Slack called\n#office-today\nwhere our team members can share photos of their work location or view on any given day.\nTime away from work\nIts important to clarify that being able to work from anywhere does\nnot\nreplace the need to take time off of work.\nWe recognize how crucial it is to build in time when you can mentally take a break from your work, and as a company, we encourage our team members to do that. Learn more about\nhow time off works at GitLab.\nI work closely with our executive team here, and they have been so supportive and encouraging when family-related conflicts arise. They are constantly reminding me that family first is our mantra, and give me ease of mind to take time away when needed. Sid, our co-founder and CEO, told me if its a beautiful day out and I just want to go enjoy it, I should do that. Moments like these make me so proud to be a part of the GitLab team.\n- Cheri, Manager, Executive Assistant\nTips for leaders and other companies\nIn the\nLinkedIn Talent on Tap video\nabove, GitLab co-founder and CEO Sid Sijbrandij shares advice on managing within a remote workplace. Discover more in GitLabs\nRemote Work playlist\n.\nHere are some best practices that may help your all-remote team be successful.\nManaging your team\nDont require people to have consistent set working hours or say when theyre working.\nDont encourage or celebrate long working hours.\nDont encourage or celebrate working on a team members day off (e.g. a weekend or holiday) unless it is required as part of their job responsibilities, such as direct/indirect customer support.\nEncourage\nteamwork and saying thanks\n.\nLearn more about\nmanaging a 100% remote team\n.\nCommunication\nEncourage people to\nwrite down all information\n.\nAllow everyone in the company to\nview and edit every document\n.\nConsider every document a draft, dont wait to share until its done.\nUse screenshots in an issue tracker instead of a whiteboard, ensuring that everyone at any time can follow the thought process.\nEncourage\nnon-work related communication\n(talking about private life on a team call) for\nrelationship building\n.\nEncourage group video calls for\nbonding\n.\nEncourage one-on-one\nvideo calls\nbetween people (as part of onboarding).\nHost\nperiodic summits\nwith the whole company to get to know each other in an informal setting.\nHiring\nBe transparent about your\nhiring process and practices\nso that interviewing time can be spent evaluating the candidates ability to do the job.\nDont limit yourself\nto\nonly\nhiring people who have a passion for remote work. Start by looking for candidates who align with your company\nvalues\nand the role itself.\nAssign new hires a\nbuddy\nso they have someone to reach out to in their first weeks.\nDefine clear goals and\nperformance indicators\nfor each role from the start so that you can measure success once youve hired someone for the role.\nTips for employees\nArguably the biggest advantage of working remotely and asynchronously is the\nflexibility\nit provides. This makes it easy to combine work with your personal life, although it might be difficult to find the right balance.\nOur team members often share\ntheir best advice\nabout working from home, and you should ask your coworkers about what remote work tactics work best for them. Here are some tips you might find helpful:\nFind your routine\nYou may work better with a\nconsistent workday routine\n, or you may find that its best to determine when your\nwaves of peak productivity\nare, and design your work day and routine around them. These may shift and change depending on the season, holidays, family schedules, etc.\nTake small breaks throughout your working hours to keep your creativity or productivity going.\nIf you worked at an office before, you might be missing your default group of coworkers at lunch. Now that you have the flexibility to choose what you do with that time, reach out to a friend and ask them to lunch.\nI think you need to throw the concept of nine to five out the window and actively experiment to find what schedule lets you make the most of your time.\nI often find the midday slump to be so real, so if Im feeling this way I step away for a while and then come back for a few hours in the evening when I generally feel supercharged.\n- Tanya Pazitny, Quality Engineering Manager\nBalance work and life\nExplicitly plan your\ntime off\nso that youll intentionally take time for yourself.\nWhen youre not working, disconnect by turning off Slack and closing down your email client. At GitLab, this only works if all team members abide by the\ncommunication guidelines\n.\nEnable the working hours feature on your calendar so that team members in other time zones know not to schedule meetings during times when youre not working.\nCommunicate clearly\nRemote teams are less likely to know whats going on in each others daily lives, so its important that youre able to\nexpress yourself\nand ask for help when you need it.\nMake the most of your\nvideo calls\nso that you can build relationships with your team.\nDecide where to work\nDesignate a space thats used solely for work so that you can mentally switch from home to office. Dont have a separate room to use as an office? Consider using a screen or partition to physically divide the space.\nMake sure you have the equipment you need to be productive (for GitLab team members, heres a helpful\nguide\n).\nJoin a coworking space or meet up with someone else who works remotely to cowork in person.\nTry out different background sounds\nlike music, ambient noise, or silence to see what works best for you while youre working.\nIf you have family or roommates at home while youre working, consider\nsetting boundaries\nwith them about your workspace to reduce interruptions.\nCreate an ergonomic workspace\nThe goal of\noffice ergonomics\nis to design your\nworkspace\nso that it fits you and allows for a comfortable working environment for maximum productivity and efficiency.\nSince we all work from home, GitLab wants each team member to have the\nsupplies\nand knowledge they need to create an ergonomic home office.\nHere are some tips from the\nMayo Clinic\non how to arrange your work station.\nChair\n: Choose a chair that supports your spinal curves. Adjust the height of your chair so that your feet rest flat on the floor or on a footrest and your thighs are parallel to the floor. Adjust armrests so your arms gently rest on them with your shoulders relaxed.\nKeyboard and mouse:\nPlace your mouse within easy reach and on the same surface as your keyboard. While typing or using your mouse, keep your wrists straight, your upper arms close to your body, and your hands at or slightly below the level of your elbows. Use keyboard shortcuts to reduce extended mouse use. If possible, adjust the sensitivity of the mouse so you can use a light touch to operate it. Alternate the hand you use to operate the mouse by moving the mouse to the other side of your keyboard. Keep regularly used objects close to your body to minimize reaching. Stand up to reach anything that cant be comfortably reached while sitting.\nTelephone\n: If you frequently talk on the phone and type or write at the same time, place your phone on speaker or use a headset rather than cradling the phone between your head and neck.\nFootrest\n: If your chair is too high for you to rest your feet flat on the floor or the height of your desk requires you to raise the height of your chair use a footrest. If a footrest is not available, try using a small stool or a stack of sturdy books instead.\nDesk\n: Under the desk, make sure theres clearance for your knees, thighs and feet. If the desk is too low and cant be adjusted, place sturdy boards or blocks under the desk legs. If the desk is too high and cant be adjusted, raise your chair. Use a footrest to support your feet as needed. If your desk has a hard edge, pad the edge or use a wrist rest. Dont store items under your desk. GitLab recommends having an adjustable standing desk to avoid any issues.\nMonitor\n: Place the monitor directly in front of you, about an arms length away. The top of the screen should be at or slightly below eye level. The monitor should be directly behind your keyboard. If you wear bifocals, lower the monitor an additional 1 to 2 inches for more comfortable viewing. Place your monitor so that the brightest light source is to the side.\nNote: If you develop any pains which you think might be related to your working position, please visit a doctor.\nDedicate time for health and fitness\nIn the\nGitLab Unfiltered\nvideo above, Darren (GitLab) and Anna-Karin (Because Mondays) discuss a number of challenges and solutions related to remote work, transitioning a company to remote, working asynchronously, and defaulting to documentation.\nIts sometimes hard to remember to stay active when you work from home. Here are some tips that might help:\nTry to step away from your computer and stretch your body every hour.\nIf possible, choose a workspace thats exposed to\nnatural light\n.\nAvoid Digital Eye Strain by following the\n20-20-20 Rule\n. Every 20 minutes look into the distance (at least 20 feet/6 meters) for 20 seconds.\nUse an app - there are some that will remind you to take a break or help you with your computer posture:\nTime Out\n(macOS)\nSafeEyes\n(GNU/Linux)\nMove every day\nGo for a walk or do a short exercise for at least 15 minutes a day.\nDo something active that can be done within a short amount of time like rope jumping, lifting kettlebells, push-ups or sit-ups. It might also help to split the activity into multiple shorter sessions. You can use an app that helps you with the workout, e.g.,\n7 minute workout\n.\nGetting out of the house before I start my day is very important for me.\nEither walking the dog or going for a swim to clear my head and get the blood flowing.\n- Daniel Gruesso, Product Manager\nTry to create a repeatable schedule that is consistent and try to make a habit out of it. Make sure you enjoy the activity.\nIt can also help to create a goal or challenge for yourself, e.g. registering for a race.\nEat less refined sugar and simple carbs, and eat complex carbs instead. Try to eat more vegetables. Dont go to the kitchen to eat something every 15 minutes (its a trap!). Keep junk food out of your house.\nHave a water bottle with you at your desk. You will be more inclined to drink if its available at all times.\nTry to get enough sleep at night and take a nap during the day if you need one.\nAt GitLab, we want to ensure each team member takes care of themselves and dedicates time to stay healthy. You can also join the Slack channel\n#fitlab\nto discuss your tips, challenges, results, etc. with other team members.\nContribute to this page\nWe recognize that the whole idea of all-remote organizations is still\nquite new, and can only be successful with active participation from the whole community.\nHeres how you can participate:\nPropose or suggest any change to this site by creating a\nmerge request\n.\nCreate an issue\nif you have any questions or if you see an inconsistency.\nHelp spread the word about all-remote organizations by sharing it on social media.\nReturn to the main\nall-remote page\n.\nLast modified September 25, 2025:\nMove Paid Time Off page to new Time Off Types page with redirects (\n43e92fe2\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/company/culture/all-remote/tips/",
    "title": "How to build a remote team | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:50:39.468623",
    "content_length": 16838,
    "section": "handbook"
  },
  "processing": {
    "original_length": 16838,
    "cleaned_length": 16756,
    "cleaned_at": "2025-10-27T16:13:42.375394",
    "processor": "text_cleaner_v1",
    "word_count": 2902
  }
}