{
  "content": "Compensation\nFind answers to your questions about GitLabs compensation framework.\nJob Architecture Project Update\nGitLab is currently undergoing a Job Architecture project to modernize our compensation framework. As part of this initiative, the compensation calculator was retired on May 30, 2025. All handbook information related to compensation is subject to change when the new framework is implemented in the August/September timeframe.\nWhats Changing\nWe are transitioning from our current San Francisco-anchored compensation model to market-aligned compensation ranges that use local market data in local currencies.\nThis change will:\nEliminate location factors and currency conversion complexities\nAlign with industry-standard compensation practices\nProvide more accurate, market-based pay ranges for each role and location\nCreate clearer career progression frameworks\nCurrent Status\nCompensation calculator:\nRetired as of May 30, 2025\nNew framework launch:\nMarket-aligned compensation ranges will be implemented by\nAugust 30, 2025\n(Revised Date Pending)\nImpact to pay:\nNo current team members cash compensation or granted equity will be reduced as part of this project.\nGetting Compensation Information\nYour current range:\nAvailable in your Workday profile under the compensation tab if your range was previously available in the Compensation Calculator\nCommission-eligible Sales roles not previously in the calculator will be visible in Workday in\nAugust\n(Revised Date Pending)\nCareer development ranges:\nRequest a consultation through HelpLab\nQuestions:\nContact HelpLab\nFor Teams in the Netherlands and Germany\nPlease note that all changes described above are proposals subject to required works council consultation and approval processes. We are actively engaging with the works councils in these countries and will incorporate their input before finalizing any changes.\nNo decisions have been made final for these regions, and we are committed to following\nall requirements for consultation.\nAdditional Information\nPlease reference the\nJob Architecture Information Guide (internal only)\nfor additional details on the project.\nNote: All information below this point reflects our previous compensation framework and will be updated upon completion of the Job Architecture project.\nIntroduction\nOn this page, were detailing why we have the compensation framework we have now.\nContact Total Rewards\nIf you have any feedback or questions relating to compensation, please reach out to\nTotal Rewards\n.\nGitLabs Compensation Principles\nWere an open organization, and we want to be as transparent as possible about our compensation principles. Our compensation model is open to data driven iterations.\nWe are\npaying local rates\nbased on\ncost of labor market\n. There is\nno\ncost of living input in our compensation philosophy.\nCompensation aims to be at a\ncompetitive rate\nfor your job family, your location, your level, your experience, and your contract type.\nWe use a\ncompensation calculator\nto ensure transparent and consistent compensation.\nWe do not disclose individual compensation since compensation is\nnot public\n.\nWe adjust our calculator based on survey data, feedback from applicants and team members, and candidate data. Please email\ntotal-rewards@ gitlab\nif you want to contribute.\nWe offer\nrestricted stock units (RSUs)\nfor most positions.\nWe base compensation on current position and performance at GitLab not on what we paid you last month and, generally, we dont reduce compensation.\nIncreases within the market pay bands will be based on performance.\nAt hire, we base our compensation offer on the position and experience in the market.\nFor promotions, increases are based on ensuring alignment to the new roles market range.\nAt\nAnnual Compensation review\n, increases will ensure alignment to the market (by being within the entire range of the calculator), and resources will be allocated to top performing team members within the organization.\nGitLab will continue to monitor\npay equality\nto ensure underrepresented groups are paid at the same rate as the company.\nWe want to follow the processes on this page for everyone, please email\ntotal-rewards@ gitlab\nwhen we dont. If you have a specific question around your compensation or one of your direct reports please schedule a call with\ntotal-rewards@ gitlab\nto review.\nWe will update this page and the processes throughout the year.\nWell review your pay as soon as your job-family or level factor changes.\nIf we change our\nSF benchmark\nfor a job family without changing the requirements, we review the compensation both for existing team members and new hires. If the SF benchmark is changed together with the requirements this review might happen at the time of the change or in our yearly cycle.\nWe offer\nbonuses and incentives\n, but we dont offer ping pong tables or free lunches. We think it is more important to offer people flexibility and freedom.\nWe hire across the globe, but were not location agnostic. Your timezone, the location factor in your region, and the vicinity to users, customers, and partners can all be factors. For example, we may favor one applicant over another because they live in a region with a lower location factor or because we need someone in that timezone.\nPeople on quota (account executives, account managers, and sales leadership) have variable compensation that is about 50% of their On Target Earnings (OTE). Individual contributors in the sales organization have variable compensation that is purely based on commission.\nCompensation decisions around level and experience levels and for functions not in the calculator are taken by the\nCompensation Group\n.\nCompetitive Rate\nWe want our compensation to be at a level where we can recruit and retain people who meet our requirements.\nOur requirements for all\njob-families\nare at\nor above\nthe average in the market.\nTherefore, we can expect to be at or above the 50th percentile of the survey data gathered from providers like Comptryx and Radford.\nPlease do not use the term market rate since this can mean either competitive rate or survey data.\nAlso see our\nSF benchmark\n.\nWhen discussing a competitive rate for a single person at GitLab, please refer to this as their lottery factor. For example, if this person won the lottery and left the company what impact would that have. Other common industry terms are walk away factor or bus factor, but those both hold a negative connotation.\nPlacement in the Compensation Range\nAs part of offering a competitive rate within our\ntransparent Compensation Calculator\n, team members are able to see where they fall within the compensation range for their role in their location. Typically in the technology sector, the majority of team members are likely to sit between the minimum and slightly above the median of the overall compensation range. It is not common to see a team member at the top of the range as this would leave little to no room for salary growth.\nIt is important to note that where someone falls within the compensation range is\nnot\nan indicator of performance, nor is it a sign of promotional readiness. For more information on how performance is linked to compensation please review the following\nhandbook section\n. This is\ndifferent\nfrom the Compa Groups GitLab used to have when the bands were more narrow. Additionally, where a team member sits in the range may change as GitLabs compensation philosophy around competitive rates iterates to allow more room for salary growth.\nSharing Compensation\nThere are no policies in place at GitLab that prevent team members from sharing their personal compensation data, though we encourage that any concern a team member has with compensation be directed directly to your manager or Total Rewards as the most efficient route to address concerns and arrive to a resolution.\nPaying Local Rates\nWhy we pay local rates\nCompetitive rates for roles vary depending on regions and countries.\nWe pay a\ncompetitive rate\ninstead of paying the same wage for the same role in different regions.\nPaying the same wage in different regions would lead to:\nIf we start paying everyone the highest wage our compensation costs would increase greatly, we can hire fewer people, and we would get less results.\nA concentration of team members in low-wage regions, since it is a better deal for them, while we want a geographically diverse team.\nTeam members in high-wage regions having much less discretionary income than ones in low-wage countries with the same role.\nTeam members in low-wage regions being in\ngolden handcuffs\nand sticking around because of the compensation even when they are unhappy, we believe that it is healthy for the company when unhappy people leave.\nIf we start paying everyone the lowest wage we would not be able to attract and retain people in high-wage regions, we want the largest pool to recruit from as practical.\nAs more companies transition to partial or all remote workforces, we are\ntracking (internal only)\nthe pay philosophy decisions made by these companies to understand the effects these decisions may have on the tech industry and future of remote pay.\nHire the best candidate\nWe hire the best candidate for each role regardless of location, cost, or other factors.\nDuring the sourcing we do optimize what potential candidates we approach in order to bring more diversity (both geographically and people from underrepresented backgrounds) to our team.\nBlog Post\nWe also wrote a\nblog post about paying local rates\n.\nMarket-Based Approach\nWe have a market-based approach to compensation because:\nIt allows for us to adapt to market changes, thus remaining competitive for local talent\nRole, location, and level benchmarks keep compensation bands consistent. Market-based benchmarks also help with keeping it fair and consistent rather than expecting our team members to negotiate their pay.\nPrevents wage compression which occurs when new employees negotiate and get higher wages than those being paid to current team members.\nAs long as budget permits, we do whats right for the market even if it means paying a team member higher than their expected pay.\nCompensation Group\nThe Compensation Group is comprised of the CEO, CFO, and Chief People Officer. The Compensation Group is responsible for all Total Rewards escalations based on the approval matrix. When there is no time to coordinate with the group, the CEO can make a decision and inform the group. When the CEO is away (e.g. vacation), the two other members of the group can make a decision and inform the group. This group is different from the Compensation Leadership Development Committee at the\nboard level\n.\nApproval Matrix:\nApproval Type\nApprovals Needed\nProcess\nCompensation Requests outside of band (cash/equity) for new hires and current team members\nChief People Officer\nProcess Document\nApproval of Benefit Plan Changes (due to implementation or renewal)\nIf Under 50k USD, Finance Business Partner (G&A)\nIf 50k-100k USD Finance Business Partner (G&A) and VP, Finance\nIf 100k+ USD Finance Business Partner (G&A), VP, Finance, and CFO\nTotal Rewards to summarize implementation or renewal details\nFinal Approval of Annual Compensation Review\nChief People Officer, CFO, and CEO\nTotal Rewards to present final proposed increases and budgetary impact\nReview/approval of Executive and Board Compensation\nChief People Officer and CEO\nTotal Rewards to present summary of proposal, once approved escalate to Compensation Leadership Development Committee for Final Approval\nInternal Demotion requests\nChief People Officer\nDemotion Process\nCompensation for Acting and Interim Roles\nEffective Q2 of FY 2021, we have established a one time bonus payment process for team members that are asked to step into an acting or interim management role. Team Members in an acting or interim management role should review\nthe expectations of an individual in the management group\n.\nCriteria for Eligibility\nFor an interim role to be considered, the need for coverage would need to be longer than a 30 day time period.\nThe interim role has to be at a higher level than the current role of the team member.\nIf a team member assumes 100% of the workload of a lateral role for 60 days or more\nin addition to their permanent full time role,\nan interim bonus may be considered by the\nPeople Business Partner\nand leader of the group.\nEffective 2023-02-01, interim bonuses in Go-to-Market roles (CRO Organization, Sales Development) will be available to people managers temporarily occupying a lateral or higher management position\nin addition to their permanent full time role.\nIn case the interim role is within another job family, team members will also be eligible for the interim compensation on a lateral level.\nSince Acting roles do not typically end in promotion, the decision on whether the acting role meets the eligible criteria rests with the Hiring Manager and the Department head.\nCalculation of Interim Bonus\nThe formula for the bonus recognizes the length of time that the team member is playing the interim role. Payment of the one time bonus would occur at the completion of the interim role. The bonus would be calculated using the following formula:\nThe greater value of the standard discretionary bonus amount ($1,000 at the current exchange rate) OR the following calculation:\nFor team members on a base salary compensation plan, your bonus will be an additional 10% of your salary for the duration of the interim role period. The calculation is as follows:\n(Annual Base Salary in Local Currency/365) x.10 (10%) x # of Calendar Days in the Interim Role\nFor team members on an OTE (On Target Earnings) compensation plan in Go-to-Market roles, interim compensation will generally be based on results achieved by the interim team in the interim period:\nInterim leaders will dotted-line manage the new team, meaning they will not assume direct management of the team in Workday, but will instead act as a temporary leader. As such, quotas will not change during the interim period.\nWhen interim managing a lateral team:\nThe interim bonus will be calculated based on Net ARR closed during the period x a representative BCR (base commission rate), calculated based on the leaders OTI and the interim roles annual quota\nWhen interim covering for a higher leadership position:\nThe interim bonus will be calculated based on Net ARR closed during the period x a representative BCR (base commission rate) for the higher leadership position\nStandard commissions payments will continue for the duration of the interim role\nAll in-plan (within OTI) components are eligible to be included in an interim bonus calculation for a GTM role, e.g. Net ARR, New Logo, Professional Services Bookings, etc.\nFor teams measured on pooled compensation plans (e.g. SAs and CSMs), interim bonuses will be based on OTE for the interim role while in seat instead of performance: (Annual OTE in local currency/365) / x.10 (10%) x # of Calendar Days in the Interim Role\nAll people managers in GTM roles are candidates for interim management assignments, outside of members of the CRO or CMO leadership teams, i.e. direct reports of the CRO or CMO\nTotal bonus payments for GTM team members in an interim management role shall not exceed $50,000 USD for a single interim leadership assignment\nThe interim bonus should be calculated based on the team members salary during the interim period, not the salary after the interim period.\nIf your compensation changes during the interim period (for example, relocation, country conversion, etc.), we will calculate the interim bonus based on the pay rate of each calendar day.\nTracking and Submitting Interim Bonuses\nTracking\nInterim/acting roles should be tracked in Workday, in some cases the process is initiated in Greenhouse or may also be tracked by the manager by completing a Submission of Acting Role for a Team Member\nform\n.\nGuidance on different processes can be found below:\nGreenhouse\nActing/Interim Tracker\nAll interim roles that have gone through our Greenhouse interview process\nLateral acting role in the same job family\nMore senior acting/interim role in the same job family\nLateral acting roles in different job families\nGreenhouse - Acting/Interim Tracker examples:\nEngineering Manager takes on an acting role as a Product Designer\nEngineering Manager takes on another Engineering Manager role simultaneously in a different group\nWorkday examples:\nAn Engineering Manager takes on an interim role as a Senior Engineering Manager\nA Product Manager takes on an interim role as a Senior Backend Engineer (after having gone through an interview process)\nThe process for tracking interim/acting roles is as follows:\n(For Acting)\n, Managers will align with their Manager and People Business Partner and align on the following:\nWhether the role is interim or acting\nWhether the role is in a new job family or the same job family\nWhether the interim/acting role is lateral or a higher level\nThe effective start date of the interim/acting period\nOnce agreed and approved, Managers will submit the\nSubmission of Acting Role for a Team Member form\n.\n(For Interim)\nPeople Business Partner will submit a\nJob Change - Change Job Details\nrequest in Workday. Job title should not be changed, as compensation and job family are not altered as part of the interim/acting process. Only a modification to the team members\nBusiness Title\nis required. This step is only done for interim positions as acting positions are not tracked in Workday.\nSubmitting\nWhen the interim/acting period ends, the following process should be followed to submit the interim bonus request:\n(For Acting bonuses)\nThe manager references the start/end dates Acting period as initially submitted through the Acting form for the bonus calculation.\n(For Interim bonuses)\nThe manager references the Workday\nJob\ntab and clicks into\nJob History\nand review the Business Title column to confirm the start date of the interim period\nOnce confirmed, the Manager submits the bonus in Workday. Follow the\nRequest a One-Time Payment job-aid\nto submit an OTP. Manager must also provide the start and end date of the of interim period in Workday under the\nAdditional Information\nsection in Workday\nNote:\nThe team member must be an active team member of GitLab at the end of the interim role period to be eligible to receive a bonus payment. If a team member leaves GitLab during the interim role period, they will not be eligible for a prorated payment.\nExamples of the Interim Bonus Calculations below\nSenior Engineer has a base salary of $125,000. She has taken on the interim role of Engineering Mgr for 3 months (Jan-March) which is a total of 90 days. The bonus for this interim role would be\n($125,000/365) x.10 x 90 = $3,082.19\nFinance Business Partner has a base salary of $100,000. He has taken on an interim role covering multiple teams while his coworker is on leave for 4.5 weeks which is a total of 31 days. The bonus for this interim role would be\n($100,000/365) x.10 x 31 = $849.32\nso we would round up for this bonus and process as a discretionary award.\nArea Sales Manager interim manages a lateral team after a peer ASM has been promoted. The ASM has a base commission rate of 1% for Net ARR and $3,000.00 per New Logo. During their interim coverage the Area closes $1,000,000.00 of nARR and 2 First Order new logos. The bonus calculation would be ($1,000,000.00 x.01) + (2 x $3,000.00) = $16,000.00.\nArea Sales Manager interim manages an entire Region after an AVP leaves GitLab. AVP base commission rates are 0.3% for Net ARR and $800 per New Logo. During the interim coverage period, the team closes $5M of Net ARR and 4 New Logos. The bonus calculation would be ($5,000,000.00 x 0.003) + (4 x $800.00) = $18,200.00.\nExchange Rates\nPoint in time rate as 2025-02-01\nCurrency\nRate from USD\nRate to USD\nAUD\n1.58865\n0.62947\nAED\n3.673\n0.27226\nBRL\n5.76668\n0.17341\nCAD\n1.42314\n0.70267\nCHF\n0.90378\n1.10647\nCLP\n953.28003\n0.00105\nCNY\n7.30905\n0.13682\nCZK\n24.002\n0.04166\nDKK\n7.14618\n0.13994\nEUR\n0.95814\n1.04369\nGBP\n0.79749\n1.25393\nHUF\n385.79201\n0.00259\nILS\n3.56495\n0.28051\nINR\n86.7306\n0.01153\nJPY\n153.087\n0.00653\nKES\n129.15\n0.00774\nKRW\n1446.57927\n0.00069\nMXN\n20.4955\n0.04879\nNOK\n11.18474\n0.08941\nNZD\n1.76855\n0.56544\nPHP\n57.88397\n0.01728\nPLN\n4.00125\n0.24992\nRON\n4.7697\n0.20966\nRUB\n89.50047\n0.01117\nSEK\n10.77666\n0.09279\nSGD\n1.34627\n0.74279\nUSD\n1\n1\nZAR\n18.55789\n0.05389\nPaid in your local currency\nThe compensation calculator is updated using the February 1 point in time exchange rates according to what is shared by Finance. We are using the point in time exchange rate due to significant lag when utilizing an average exchange rate.\nAdjustments to existing team members compensation who are paid in local currency are made\nonly during\nthe applicable\ncompensation review cycle\n. We only adjust compensation during the review cycle since being paid in local currency means that your local purchasing power does not change.\nExchange Rates for Bonus Processing\nAll\none-time bonuses\nincluding Discretionary, Referral, and Working Group Bonuses where the intended value is awarded in USD will be converted to local currency using the set exchange rates above. This is a reversion of the prior policy put in place to use monthly rates with the reversion going into effect as of September 1, 2023. In the future, when we are able to put an efficient process in place for maintaining more up-to-date conversion rates in Workday, we will further revise this policy to use more current rates.\nNot paid in your local currency\nTeam members contracted through CXC or IT BV may have the option to be paid in USD or EUR when there is volatility in their local currency. This change can be made only once during your employment and only if CXC and payroll can support it. USD and/or EUR payment options are not available in all countries.\nThe conversion from local currency to USD or EUR will be calculated at the time of the update. All future salary adjustments will be based on the new currency amount, regardless of fluctuations in the local currency. This provides stable compensation for team members who opt into this arrangement.\nIf a team member is currently paid in a non-local currency, they may request to move back to their local currency. Once a team member has requested to move back to their local currency, this decision will be final.\nPlease reach out to People Operations via\nHelpLab\nin order to understand if you are eligible to update your currency to USD or EUR and to initiate this process.\nHourly Employees\nGitLab is committed to following all applicable wage and working hours laws and regulations. To help ensure that all work performed for GitLab is compensated correctly, team members compensated on the basis of hours worked must\nreport and record time\naccurately.\nSales Compensation\nSales and Sales Development roles at GitLab that are subject to quota and paid commission based on the\nSales Compensation Plan\nare not located in the\ncompensation calculator\n. This includes roles in the following departments:\nChannel\nCommercial Sales\nEnterprise Sales\nSales Development\nThese roles are still\nbenchmarked using market data\nand are assigned to a pay differential zone based on their\nlocation factor\naccording to the following table:\nZone\nLocation Factor Range\nZone Differential\nZone 4\n0.01 - 0.49\n0.60\nZone 3\n0.50 - 0.69\n0.75\nZone 2\n0.70 - 0.85\n0.85\nZone 1\n0.86 - 1.00+\n1.00\nExchange rates for commissions payments are as defined per the terms of the Sales Incentive Compensation Plan. Please reach out to the Sales Commissions team for further information.\nDirector Compensation\nDirector compensation is determined as part of the\nGitLab Compensation Calculator\nand is comprised of base salary and bonus. The location factors for Directors have a floor built in where the location factor for a team member is subject to either the US Director Minimum location factor of 0.8 or Global Director Minimum location factor of 0.7. If someone is in a location with a higher location factor then this minimum does not apply and the higher location factor will be used.\nDirectors who are not already enrolled in the Sales Compensation Plan or other performance incentive plan are eligible for a 15% bonus of current base salary. More information on the bonus plan can be found in the\nCompany Director and above Bonus Plan\nsection.\nExecutive Compensation\nExecutive Compensation (VP and above) is derived outside of the GitLab Compensation Calculator using the following process:\nThe Total Rewards team collects survey data to review against current compensation to ensure alignment in cash (base/variable) and equity refresh values.\nSurvey Data from the GitLab peer group: GitLab will analyze the peer group data from Radford against peer group data from Compensia.\nThe Total Rewards team will advise on an increase.\nThe recommendation will be reviewed by the e-group leader for VPs and above. The final approval for VP compensation is the Compensation Group. Total Rewards will work with finance to ensure alignment to budget.\nE-Group compensation is reviewed in partnership with Compensia based on the peer group data provided. The CEO will recommend increases and refresh grants for his direct reports to the Compensation Leadership Development Committee for approval.\nThe Total Rewards team will then notify the CEO or direct manager of the increase who will then communicate it to the individual.\nAs each Executive has an individual market assessment upon hire, we expect compensation to be aligned to market at each compensation review. If there are large changes in the market for a specific role, those will be addressed.\nCompany Director and above Bonus Plan\nDirectors and above are eligible for the Company Bonus Plan.\nCommunication\nPrior to the bonus payment and after Compensation & Leadership Development Committee approval, the CFO will confirm the achievement % of the bonus plan in the #director-and-above slack channel.\nTiming:\nPayments expected to occur 60 days after the end of the fiscal period but are dependent on the accounting close process and committee approval.\nPayout:\nThe bonus will be paid out semi-annually.\nThe first semi-annual payment will be funded up to a maximum of 80% of target bonus amount for the period of February through July. Any full plan year adjustments will be made as part of the final bonus payout.\nExample: A director who has been eligible for the bonus plan from February 1 has an annual target of 30,000 USD. Their target bonus amount for the first half of the fiscal year, February through July, is 15,000 USD. Therefore, they will receive 80% of 15,000 USD or 12,000 USD for their first semi-annual payment.\nThe final bonus payout will be based on actual performance against plan less amount paid at the semi-annual payout.\nIf the first semi-annual bonus is achieved but Company performance falls below the annual threshold the second half bonus will not be achieved but the first half bonus will not be rescinded or otherwise payable back to the Company.\nApprovals:\nThe bonus plan is approved by the\nCompensation Leadership Development Committee\nof the Board of Directors.\nPerformance against Plan targets is reviewed and approved by the\nAudit Committee\nof the Board of Directors.\nBonus payouts are recommended by the CFO and approved by the Compensation Leadership Development Committee of the Board of Directors.\nProration and Eligibility:\nThe Director bonus will be prorated for team members who start or are promoted into the Director bonus pool between February 1 and July 31 (first half bonus), or start or are promoted between August 1 and January 31 (second half bonus).\nIn addition, the team member must be actively employed by GitLab at the time of payout.\nGitLab reserves the right to change or discontinue the bonus program at any time. All bonus payouts are discretionary and require the achieving of specific company results that will be communicated each year.\nSales Commissions handbook page\n.\nBonus Payout Approvals\nThe Compensation Leadership Development Committee approves all bonus payouts for direct reports to the CEO and overall bonus funding at the end of each Fiscal Year. The Compensation Group internally at GitLab approves all other bonus payouts.\nThe Finance team will generate a calculation of the total bonus payout for the Fiscal Year within 30 days of the last day of the fiscal year including: Employee #, Name, Reporting to, Division, Department, Title, Hire Date, Total Eligible, Total Payout.\nThe Total Rewards Team will audit the calculation and eligibility list.\nThe final payout amounts will be approved by the VP, Total Rewards and VP, Finance.\nThe Total Rewards Team will collaborate with the Finance team to include the total spend for the bonus plan, attainment, and executive specific payout for the Compensation Leadership Development Committee meeting. Approval of the bonus plan would be captured in the Committee meeting minutes.\nOnce approved by the Compensation Leadership Development Committee, the Total Rewards team will notify Payroll that the bonuses are ready for processing.\nLearning GitLabs Compensation Framework\nAs part of our Q1 OKR, we will be working on ensuring there are materials for a compensation certification. The following are the initial questions to generate the certification.\nThe Why Questions\nWhy do we have the compensation framework we have now?\nWhy does GitLab aim to pay a competitive rate?\nWhy does GitLab pay local rates?\nWhy does GitLab have a Compensation Calculator?\nThe What Questions\nWhat is the foundation of GitLabs compensation framework?\nWhat is the formula of the Compensation Calculator or otherwise known as the Calculator Inputs or Factors?\nWhat does the SF Benchmark mean on the Compensation Calculator?\nWhat does the Location Factor mean on the Compensation Calculator?\nWhat does the Exchange Rate mean on the Compensation Calculator?\nThe How Questions\nHow do we continue to make sure that our team members are compensated according to their skill level and receive equitable pay?\nHow do we make sure that the different Compensation Calculator inputs remain relevant and competitive to market?\nHow does the Total Rewards team carry out the Annual Compensation Review?\nKnowledge Assessment\nYou can test your knowledge on our compensation by taking the\nGitLab Compensation Knowledge Assessment\nquiz.\nIf you have questions about compensation or the content in the Knowledge Assessment, please reach out to the\nTotal Rewards\nteam.\nAnnual Compensation Review Cycle\nNotice: The below pertains to the recently completed FY26 Annual Compensation Review Cycle. Updated...\nThe Compensation Calculator\nOn this page, we explain the different factors that make up our Compensation Calculator and its alignment to GitLab's values and Compensation Principles.\nLast modified October 15, 2025:\nUpdating and removing obselete LevelUp link (\n92b3d81a\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/total-rewards/compensation/",
    "title": "Compensation | The GitLab Handbook",
    "scraped_at": "2025-10-24T18:14:42.179647",
    "content_length": 31013,
    "section": "handbook"
  },
  "processing": {
    "original_length": 31013,
    "cleaned_length": 30972,
    "cleaned_at": "2025-10-24T18:19:45.161402",
    "processor": "text_cleaner_v1",
    "word_count": 5007
  }
}