{
  "content": "Finance\nWelcome to the GitLab Finance Handbook\nThe GitLab Finance Department includes multiple Teams: Accounting, Financial Planning & Analysis, Tax and Business Operations Programs.\nQuick Links\nFinance Issues\nPlease use confidential issues for topics that should only be visible to team members at GitLab.\nAccounts Payable\nExpense Guidelines\nOperating Metrics\nProcurement\nSales Comp Plan\nSignature Authorization Matrix\nAuthorization Matrix Policy\nStock Options\nForms\n2025 GitLab Inc W-9 Document and Certificate of Residence\nForm CA-590 - Please request by email to\ntax@gitlab.com\nCorrespondence\nPlease use the\n#finance\nchat channel in Slack for questions that dont seem appropriate for the issue tracker or internal email correspondence.\nAccounts Payable\n- inquiries which relate to vendor and merchant invoices, or team members expenses should be sent to our Accounts Payable mailbox -\nap@gitlab.com\n. You can also reach the AP team on Slack in the\n#accountspayable\nor\n#expense-reporting-inquiries\nchat channels. Invoices that require payment processing should be sent to\nap@gitlab.com\n.\nBilling Operations\n- customer billing inquiries should be sent to our Billing mailbox \nbilling@gitlab.com\n.\nAccounts Receivable\n- customer payment/remittance inquiries should be sent to our Accounts Receivable mailbox -\nAR@gitlab.com\nPayroll\n- inquiries which relate to contractor invoices should be sent to our Payroll mailbox -\nnonuspayroll@gitlab.com\n.\nCFO Approvals\nPlease use the\n#cfo-approvals\nchat channel in Slack for alerting the CFO to a request for his approval\nTag the CFOs Staff EBA in the Slack request for visibility and followup\nAppropriate Finance team members in the approval flow must approve prior to requesting CFO approval\nAll requests must go through the appropriate approvals process, include a link to the Issue or description and receive all approvals prior to requesting CFO approval\nWe\nFinance\nFinance Handbooks\nAccounting\nBusiness Technology\nFinancial Planning & Analysis\nInvestor Relations\nTax\nGeneral Topics\nLegal and Financial Information\nFor commonly requested company information, please visit our\nwiki page\n.\nCompany Accounts\nLogin information for the following accounts can be found in the Secretarial vault\non 1Password:\nFedEx\nAmazon\nIND (Immigratie en Naturalisatie Dienst, in the Netherlands) company number\nIf you need this information but cannot find it in your shared vaults, check with the People Operations Team members to get access.\nFiscal Year\nA fiscal year is a one-year period that corporations use for accounting and budgeting.\nGitLabs Fiscal Year runs from February 1 to January 31. The fiscal year naming correlates to the ending month of the given fiscal year, for example FY26 is GitLabs fiscal year running February 1, 2025 to January 31, 2026.\nQ1: February 1 through April 30\nQ2: May 1 through July 31\nQ3: August 1 through October 31\nQ4: November 1 through January 31\nFiscal Year\nCalendar Year\nFY26-Q1\n2025-02-01 to 2025-04-30\nFY26-Q2\n2025-05-01 to 2025-07-31\nFY26-Q3\n2025-08-01 to 2025-10-31\nFY26-Q4\n2025-11-01 to 2026-01-31\nRefer to our\nwriting style guidelines\nfor proper use of date formats.\nRevenue non-committee\nInternal Management Members:\nChief Financial Officer (DRI), Chief Executive Officer, Chief Revenue Officer (model, guidance, plan, target)\nInvoice template and where to send\nVendor invoices are to be sent to\nap@gitlab.com\nand\npayroll@gitlab.com\nfor contractors. An\ninvoice\ntemplate can be found in Google Docs by the name of Invoice Template.\nNon-US contractors not from Hungary, Italy, Japan, New Zealand, Nigeria, South Africa, Switzerland, and Ukraine will get pay their monthly wages and expenses through iiPay. Here is the process:\nenter bank information in Workday under Bank Information tab. Note - new contractor should enter their bank information within 3 business days from their start date.\nenter VAT number if it is available\nsubmit monthly salary/bonus/commission invoice in through Google form by the 8th of each month (as described to you during onboarding)\nsubmit expenses through Navan Expense by the 8th of each month\nthe scheduled payment date is the 22nd of each month\niiPay will send out remittance advice along with the scheduled payment via your GitLab email address\nNon-US contractors from Italy, Nigeria, South Africa, Switzerland, and Ukraine will need to send their monthly invoice for salary/bonus/commission and any\nexpenses\nby the 15th to\npayroll@gitlab.com\n.\nIn many cases, VAT will not be payable on transactions between GitLab BV and EU-based\nvendors/contractors, thanks to Shifted VAT. To make use of this shifted VAT:\nThe vendor/contractor writes the phrase VAT shifted to recipient according to\narticle 44 and 196 of the European VAT Directive on the invoice along with the\nVAT-number of GitLab IT BV (NL860316828B01).\nOn the vendors VAT return the revenue from GitLab BV goes to the rubric Revenue within the EU. It goes without saying that vendors are responsible for their own correct and timely filings.\nGitLab BV files the VAT on the VAT return, and is generally able to deduct this VAT all as part of the same return.\nTimesheets for Hourly Employees\nPeople Ops and Finance will share a private Google Sheet with you where you will log your hours for each day in the hours column.\nThere is a dropdown in the pay type column, with the default being Regular. There are also options for Overtime, Vacation, Sick, and Bereavement. Choose the appropriate pay type for your time.\nIf you work overtime or more hours than agreed upon in your contract, please obtain approval from your manager and forward to Finance before payroll cutoff.\nYour timesheet is due one day prior to the submit payroll date, which is outlined for the calendar year on your timesheet.\nHow spend is allocated to departments\nBudgets are aligned to departments, and budgets follow the owner who requested the spend. When determining who should request the spend, consider the owner of the outcome.\nFor example, work to enable a sales partner that will not be incorporated into the product would go to Sales. Work that will be part of the product and supported by engineering, should be charged to the Engineering budget.\nFinance Business Partner Alignment\nFunction\nName\nCustomer Support\nR&D Finance\nR & D\nR&D Finance\nSales\nSales Finance\nProfessional Services\nSales Finance\nMarketing\nMarketing Finance\nG & A\nEllen Boyd and Jess Smith\nTypes of Work that the team does\nLevel 1: Keeping the lights on activity. Always striving to make this area as efficient as possible so more Layer 2 focus can be attained. Example: closing the books.\nLevel 2: Operational Efficiencies, Business Engagement and Partnering, actionable insights for the organization. Examples: improving close process, partnering with sales to make a business decision\nAccounting and Reporting\nThis page contains GitLabs accounting and reporting policies, which can be made public....\nAccounts Payable\nThis page contains GitLabs Accounts Payable department policies, procedures and guidelines....\nAuthorization Matrix\nPlease refer to the authorization matrix here\nCommittee Composition\nDisclosure Committee Composition Chairperson: Chief Executive Officer, Chief Financial Officer,...\nFinance Growth and Development\nWelcome to the GitLab Finance Growth and Development Page\nThe GitLab Finance Department is dedicated...\nFinance Team Performance Indicators\nExecutive Summary KPI Health Status Recurring revenue variance ex-JV Confidential Confidential...\nFinancial Planning & Analysis\nWelcome to the FP&A Team Handbook. Our missions is to maximize GitLab's long-term valuation by enabling e-group and FP&A to plan, prioritize, and execute effectively\nGitLab Finance Team READMEs\nLearn more about working with various members of the Finance team\nGlobal Travel and Expense Policy\n1. POLICY GitLabs Global Travel & Expense Policy is meant to provide guidance to all Team...\nInvestor Relations\nWe have an externally facing investor relation website. The page you are on now the handbook that...\nPayroll\nPlease refer to the Payroll internal handbook page...\nSales Compensation Plan\nFY23 Compensation T&Cs can be found in the Internal Handbook:...\nSpending Company Money\nAll team members and contractors must protect our Company assets, such as equipment, supplies, cash,...\nThe GitLab Procurement Team\nWhat is Procurement? The Procurement team manages GitLabs Supplier Lifecycle through the...\nThe GitLab Tax Team\nThe tax department is responsible for GitLab's overall tax strategy including all components of tax compliance, tax planning and accounting for income taxes. In addition, the tax department manages GitLab's statutory requirements including statutory audits, filing of entity-level financial information, transfer pricing, and ensuring intercompany transactions are recorded appropriately.\nThe Internal Audit Function\nPlease refer to the Internal Audit page in the internal handbook.\nTimekeeping Policies and Procedures\nInternal handbook link\nTravel Safety and Security\nTravel Safety and Security Team member safety and security are a top priority for GitLab. If a team...\nLast modified July 30, 2025:\nUpdating People Connect to People Operations references - various HB pages (\n5f8b6106\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/finance/",
    "title": "Finance | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:50:50.718820",
    "content_length": 9299,
    "section": "handbook"
  },
  "processing": {
    "original_length": 9299,
    "cleaned_length": 9287,
    "cleaned_at": "2025-10-27T16:13:42.382574",
    "processor": "text_cleaner_v1",
    "word_count": 1415
  }
}