{
  "content": "UX Research shadowing\nAll new Product Managers and Designers at GitLab should complete research shadowing as a part of their onboarding before conducting independent research.\nAll new Product Managers and Product Designers should go through this research shadowing process as a part of their onboarding before conduting independent research.\nThis research shadowing process is intended to ensure that stable counterparts have sufficient understanding to be able to undertake UX research independently. Counterparts will read through training materials and observe the execution of a UX research study all the way through from planning to analysis. They will be paired with a UX Researcher that can answer any questions they have and provide support during this process.\nShadower process\nIdentify the UX Researcher\nassigned to your stage group\n. This person will be your contact during this shadow process. Reach out to them and introduce yourself and let them know youre starting research shadowing.\nRead through pages that are relevant to you and your project(s) within the\nUX Research handbook section\n. Your researcher can answer any questions you may have.\nProblem Validation shadowing\nOnce you start the shadow process, the researcher will identify an upcoming problem validation study they feel will be suitable for you to shadow.\nIf the researcher wont be conducting any suitable research in the near future, they may coordinate with you to observe a study being conducted by another researcher.\nOnce your researcher has identified an appropriate study, theyll start including you on each part of the research process. This will include things like the research plan, discussion guide, etc.\nRead through these materials as theyre created, and ping the researcher with any questions you have.\nYoull be added to research sessions as theyre scheduled. Youll observe, take notes, and participate in any debrief that happens. Let the researcher know which sessions youll observe.\nYou should attend at least two sessions. If you want to observe more than that you can work it out with the researcher.\nThe researcher will include you on any analysis of the research and send you the final insights document.\nOnce the study has concluded, the researcher will reach out for a final check-in. Use this time to ask any remaining questions you have. At this point, you should have enough understanding to conduct research on your own.\nSolution Validation shadowing\nWhen conducting your first solo Solution Validation at GitLab, you will need to have a researcher (preferably from your group or section) shadow your first solution interview.\nThis is to ensure you get feedback about your approach, and that a UX Researcher and your Product Design Manager are aware so they can support you.\nSolution Validation\nis conducted by the Product Designer and PM counterpart.\nThe role of research in Solution Validation is to provide an initial framework and to provide feedback on the goals of your study.\nAfter a researcher has shadowed your interview (either live or by watching the recording), they will provide written feedback to you and cc your Product Design Manager.\nUX Researcher process\nWhen a new hire reaches out to you to start the research shadow process, start thinking about what upcoming research study would be suitable for the shadower to observe. If there are multiple new hires coming on around the same time you can batch them together to optimize your time and effort. The study you choose for shadowing should be somewhat standard, with as few atypical elements as possible. If you dont have any suitable studies happening in approximately the next month and a half, you may need to transfer responsibility to another researcher. Ask your manager if youre unsure.\nOnce youve identified the study, start including the shadower on each part of the research process. Tag them in issues and share documents like the discussion guide with them. Be available to answer any questions they may have. The goal is that they have a clear idea how to execute each phase of the research process.\nAs you schedule sessions, include the shadower on the invites. They should let you know what sessions they plan to observe, with a minimum of two.\nBe sure to include the shadower on any analysis documents as well as any findings produced.\nOnce the study has concluded, reach out to the shadower for a final check-in. This is their last chance to ask whatever questions they still have. After this point the shadower will be considered ready to execute research on their own.\nLast modified July 2, 2025:\nAdd product dev folder and move relevant pages (\n83bfc789\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/product/ux/ux-research/research-shadowing/",
    "title": "UX Research shadowing | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:50:33.752195",
    "content_length": 4724,
    "section": "handbook"
  },
  "processing": {
    "original_length": 4724,
    "cleaned_length": 4711,
    "cleaned_at": "2025-10-27T16:13:42.520402",
    "processor": "text_cleaner_v1",
    "word_count": 773
  }
}