{
  "content": "Legal & Corporate Affairs (\"LACA\")\nOur Mission\nWe leverage our versatile skill sets to drive positive outcomes for GitLab and our customers. Approachable and collaborative, LACA team members are trusted thought partners to our colleagues across GitLab, and facilitate efficient and informed decision making in all areas of the business.\nIn short: LACA Were your one phone call.\nLegal & Corporate Affairs Functional Groups\nCommercial\nThe GitLab Legal\nCommercial\nteam is responsible for all contracting matters at GitLab, including procurement, revenue, channel, technical, and alliances, while partnering with sales, technical, and business stakeholders to ensure alignment with GitLab contracting standards and efficient execution timelines. The team supports GitLabs go-to-market and procurement functions, providing knowledge and creativity in advising on contractual and regulatory matters to facilitate customer-centric results in accordance with the Companys values.\nHelpful links:\nSales Guide  Collaborating with GitLab Legal\nCommercial Legal Internal Handbook\nHighspot - GitLab Legal Hub\nCorporate & Compliance\nThe\nCorporate & Compliance\ngroup drives strategic results for GitLab via cross-functional relationships to support a climate of principled corporate governance and the companys culture of compliance.\nCorporate Development\nThe\nCorporate Development\ngroup conducts diligent and thorough analysis to strategically identify, evaluate and execute potential acquisitions to accelerate the product roadmap and advance the companys competitive position in the market.\nEmployment\nThe Legal\nEmployment\nteam serves as a strategic partner across the organization, providing expert guidance and proactive legal solutions throughout the entire team member lifecycle.\nEnvironment, Social, and Governance (ESG)\nThe\nESG\ngroup works cross-functionally to integrate ESG considerations, ESG regulatory compliance, and responsible business practices as part of GitLabs overarching mission to make our customers successful.\nPrivacy, Product, and Intellectual Property\nThe\nPrivacy\nand\nProduct and Intellectual Property\ngroup enables fast-paced product development within applicable regulatory confines; privacy solutions so customers can confidently co-create in those products; and robust protection of Company IP.\nPublic Policy\nThe\nPublic Policy\nfunction enables GitLab to compete and innovate as freely as possible while advocating for sound governance that benefits our customers and the broader technology community.\nRisk Management and Dispute Resolution\nThe\nRisk Management and Dispute Resolution\ngroup directs GitLabs unified, transparent and ethical approach to defending company interests while resolving disputes should they arise.\nStrategy and Legal Operations\nThe\nStrategy and Legal Operations\ngroup promotes continued process improvement such that LACA may be efficient and effective in its performance, including procurement of the most suitable tools and technology.\nHow to Reach Us\nFor quick questions that\ndo not\nrequire legal advice, deliverables, or any discussion of confidential information, you can reach out to LACA in Slack at\n#legal\n. We find this channel best for questions about process, who handles what, or how to find certain things if the handbook has not yielded the right result for you after searching. #legal is not a private channel, so your inquiry will be visible to the entire company. One of our team members will do their best to answer your question in a timely fashion.\nMost questions regarding specific customers require a legal case in Salesforce. Follow the process\nhere\nto open one.\nFor other questions related to deliverables and non-sensitive information, create an issue in the\nLegal and Compliance project\n. Be sure to use the template most suited to your request to engage the right team members.\nFor sensitive, private, or confidential matters, email\nlegal_internal@gitlab.com\n.\nAnonymous Internal Ethics and Compliance Reporting\nWe take employee concerns very seriously and encourage all GitLab team members to report any ethics and/or compliance violations by using\nEthicsPoint\n. Further details can be found in the\nPeople Group Handbook\nunder\nHow to Report Violations\nand in our\nCode of Business Conduct and Ethics\n.\nGitLab Policies\nSee\nGitLabs Ethics and Compliance Program\nfor a list of policies, compliance standards, guidelines, and other resources.\nAuthorization Matrix\nThe\nAuthorization Matrix\ndesignates who is authorized to sign legal documents. Only GitLab team members with signature authority can execute agreements on behalf of GitLab.\nNon-Disclosure Agreements\nFollow the\nnon-disclosure agreement process\nto send an NDA.\nNAVEX Compliance Courses\nFor information about compliance training, including new hire requirements, and tips for using the NAVEXEngage platform, see\nhere\n.\nFreedom of Information Act (FOIA) Requests\nWhat is a Freedom of Information Act (FOIA) request?\nThe Freedom of Information Act (FOIA) provides public access to all United States federal agency records except for those records (or portions of those records) that are protected from disclosure by any of\nnine exemptions or three exclusions\n(reasons for which an agency may withhold records from a requester). Occasionally the records of a federal agency under a FOIA request may include GitLab records in the possession of the agency (i.e., when the agency is a customer of GitLab). In such an event, the federal agency will notify GitLab of the FOIA request and provide GitLab with the documents that the federal agency intends to release in response to the FOIA request. A GitLab legal team member will review the list and content of the documents identified by the federal agency pursuant to the FOIA request and will provide the appropriate response and/or make redactions to those documents, as necessary, prior to their release.\nIn the event you receive a notification from a US federal agency pursuant to a FOIA request, indicating that GitLab documents or information have been identified for release by an agency, please immediately forward the request to\nFOIA@gitlab.com\n.\nAgile Planning Terms\n(Additional Terms)\nThese Agile Planning Terms (Terms) are between GitLab Inc. with offices at 268...\nAgile Planning Terms V1\nDeprecated 2024-08-29\n(Additional Terms)\nThese Agile Planning Terms (Terms) are...\nAI Functionality Terms\n(Additional Terms)\nThese AI Functionality Terms (Terms) are between GitLab Inc. with offices at...\nAI Functionality Terms V1\n(Additional Terms)\ndeprecated 2023-10-31\nThese AI Functionality Terms (Terms)...\nAI Functionality Terms V2\nDeprecated 2024-08-29\n(Additional Terms)\nThese AI Functionality Terms (Terms)...\nAI Functionality Terms V3\ndeprecated 2025-03-31\n(Additional Terms)\nThese AI Functionality Terms (Terms) are between GitLab...\nAnti-Corruption Policy\nOverview of Anti-Corruption Policy\nAnti-Fraud Policy\nGitLab's Anti-Fraud Policy\nAnti-Retaliation Policy\nGitLab's Anti-Retaliation Policy to establish guidance for reporting ethics or compliance concerns or other inappropriate behavior while providing protection against retaliation for reporting in good faith.\nCode of Business Conduct & Ethics\nOverview of the Code of Conduct and Ethics at GitLab.\nCommercial Legal\nLanding page for Commercial Legal handbook information\nConference Sweepstakes Official Rules\nConference Sweepstakes Official Rules\nContent Removal Guidelines\nDMCA (Digital Millennium Copyright Act) takedown request requirements We take the intellectual...\nContract Management and Storage\nThese instructions provide a step-by-step guide for GitLab Team Members on properly filing fully executed contracts and vendor-related documents in our designated storage systems.\nCorporate & Compliance Legal\nThis page offers a single source related to corporate legal information.\nCorporate Communications Policy\nOverview of the Corporate Communication Policy at GitLab.\nDORA (Digital Operational Resilience Act) Mapping\nHow GitLab addresses the key contractual requirements of the Digital Operational Resilience Act...\nEU Data Act Supplemental Terms\nThese EU Data Act Supplemental Terms (EU Data Act Terms) are between GitLab Inc. with offices at...\nEU Illegal Content Report Form\nUse this form to report content that you believe is illegal in the European Union. This form is intended for individuals claiming legal rights in the EU, as well as individuals or entities designated as trusted flaggers pursuant to the EU Digital Services Act (DSA)\nExternal Materials Compliance Tips\nCompliance tips for developing materials for external use\nFulfillment Reseller Flow-Through Terms\nThese Fulfillment Reseller Flow-Through Terms (the Agreement) are made as of the date...\nGitLab Acceptable Use Policy\nThis policy helps us identify unacceptable use of our services, and applies to all users of all...\nGitLab API Terms of Use\nUnderstand your rights and obligations when using GitLab's publicly-available APIs\nGitLab Data Processing Addendum and Standard Contractual Clauses\nGitLab Data Processing Addendum\nGitLab for Education Program Agreement\nEducation Program Agreement Date of last revision: 2022/11/16\nThis Education Program Agreement...\nGitLab for Open Source Program Agreement\nOpen Source Program Agreement Date of last revision: 2022/08/19\nThis Open Source Program Agreement...\nGitLab Inc. Philanthropy Policy\nView GitLab's Philanthropy Policy\nGitLab Legal Team READMEs\nGet to know the Legal Team in our individual README pages\nGitLab Privacy\nThis page helps GitLab Team Members understand the privacy practices at GitLab and to facilitate a culture that respects and prioritizes the privacy of our Team Members and users\nGitLab Professional Services Terms\n(Additional Terms)\nThese Professional Services Terms (\"Terms\") are between GitLab Inc....\nGitLab Related Party Transactions Policy\nOverview of the Related Party Transactions Policy at GitLab.\nGitLab SAFE Framework\nOverview of the SAFE Framework at GitLab.\nGitLab Subscription Agreement\nSubscription Agreement This Subscription Agreement (Agreement) is between GitLab Inc. with offices...\nGitLab Testing Agreement\n(Additional Terms)\nThis Testing Agreement (Agreement) is between GitLab Inc. with...\nGitLab Testing Agreement v1\nDeprecated: 2023-05-18\nThis Testing Agreement (Agreement) is between GitLab Inc. with...\nGitLab Testing Agreement v2\nDeprecated: 2023-06-29\nThis Testing Agreement (Agreement) is between GitLab Inc. with...\nGitLab Testing Agreement V3\nDeprecated 2024-08-29\nThis Testing Agreement (Agreement) is between GitLab Inc. with...\nGitLab Testing Agreement v4\nDeprecated 2025-02-28\n(Additional Terms)\nThis Testing Agreement (Agreement) is between GitLab...\nGitLab's Ethics and Compliance Program\nMission GitLab Inc. (collectively with its subsidiaries,GitLab, we,...\nGitLab's Modern Slavery Act Transparency Statement\nThis is the current Modern Slavery Act Transparency Statement\nGuidelines for Use of Third-party IP in External Materials\nGuidelines for the use of third-party content in external materials\nGuidelines on public discussion of competitor product features\nThese guidelines govern how to discuss and reference competitor product features and screenshots in public issues, GitLab [documentation](http://docs.gitlab.com), and other public-facing media.\nLegacy Terms and Agreements\nLegal, Employment at GitLab: A Strategic Partnership\nEmployment law governs the relationship between employers and employees. At GitLab, the Legal...\nMarketing Guide: Collaborating with GitLab Legal\nThis page provides educational resources and process guides to GitLab Marketing for recurring Legal requests\nMaterials Legal Review Process\nFollow this process to obtain legal review of materials for internal and external use\nNavigating the EU Data Act with GitLab\nImportant Notice The information in this summary is intended as an overview and outline of certain...\nNon-Disclosure Agreement Process\nHow to send or request an NDA\nPartner Code of Ethics\nGitLab Partner Code of Ethics and Due Diligence\nPatents\nLearn about Patents and GitLab's Patent Program\nPolicies\nProcess for a Conference Sweepstakes (w/wo a Survey)\nProcess for a Conference Sweepstakes (w/wo a Survey)\nProcess for UX Research Prize Draws\nProcess for UX Research Prize Draws\nProcurement Guide: Collaborating with GitLab Legal\nThank you for visiting! The purpose of this resource is to provide GitLab team members with...\nProduct and Intellectual Property\nLegal Product and IP team page\nPublic Policy\nOur Mission The Public Policy function enables GitLab to compete and innovate as freely as possible...\nPublicity Waiver and Release Guidelines and Process\nGuidelines and process for use of Publicity Waiver and Release agreements\nRecord Retention Policy\nThis Records Retention Policy promotes and assists with the implementation of procedures, best practices, and tools to promote consistent life cycle management of GitLab records\nReseller Agreement\nBefore submitting a Deal Registration, please review the Master Partner Agreement.\nPLEASE READ THIS...\nRisk Management and Dispute Resolution (RMDR)\nRMDR processes, policies, and resources\nSales Guide  Collaborating with GitLab Legal\nThis resource provides assistance to the GitLab Sales Team on operational and educational elements of working with GitLab Legal for Customer negotiations\nStategy & Legal Operations\nThe Strategy & Legal Ops team promotes and institutes streamlined processes, efficient tools,...\nSustainability\nInformation and processes related to Sustainability and ESG\nTechnology Partner Agreement\nPLEASE READ THIS AGREEMENT CAREFULLY BEFORE USING ACCESSING OR CONSUMING THE SOFTWARE OR SERVICES...\nTrade Compliance\nWhat are trade control laws? Trade control laws, which often consist of sanctions, export controls,...\nTrademarks at GitLab\nTrademark information for GitLab team members\nUX Research Team Promotional Rules\nStandard Official Rules\nVendor Data Processing Addendum\nVendor Data Processing Addendum\nWhistleblowing at GitLab\nGitLab's Whistleblowing Handbook page, with links to whistleblowing policies.\nLast modified August 28, 2025:\nAdding Public Policy to LACA landing page (\n9f1ce3a2\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/legal/",
    "title": "Legal & Corporate Affairs (\"LACA\") | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:51:10.391032",
    "content_length": 14223,
    "section": "handbook"
  },
  "processing": {
    "original_length": 14223,
    "cleaned_length": 14201,
    "cleaned_at": "2025-10-27T16:13:42.610879",
    "processor": "text_cleaner_v1",
    "word_count": 2015
  }
}