{
  "content": "Product Handbook\nMost of the content in the product handbook talks about\nhow\nwe do product at GitLab.\nWelcome to the Product Team Handbook\nThe Product Team is led by\nManav Khurana\n.\nThe Product Handbook focuses on\nhow\nwe do product at GitLab.\nPlease see\nProduct Direction\nto learn about\nwhat\nthe Product Team plans to build.\nProduct Team Functions\nProduct Management\nUser Experience\nProduct Team Mission\nWe create products and experiences that customers love and value.\nConsistency wins as you scale\n. Our organizational goal is to create a Product Manager (PM) system that maximizes the chances of success across new products, new features, and new team members.\nWe are shipping an experience\n, and not just a product. Dont forget about the links between the product and the website, pricing & packaging, documentation, sales, support, etc.\nIts about our customers and doing a job for them\n, not the product itself. Think externally about customer problems, not internally about the technology.\nIts about love AND value\n. Will customers value what we are building? We need to make sure what we build helps build and extract customer value.\nContributing to the Product Handbook\nThe product handbook is widely referenced by product managers and cross-functional team members. Therefore, we want to follow a consistent change management process so all affected collaborators are aligned and informed when there are changes (specially new requirements, processes, meetings, etc.) that affect their workflow.\nIt is helpful to indicate which type of change you are suggesting:\nSmall improvement (typos, clarifications, etc.)\nAdding a new section\nModifying existing section\nDocumenting a new process\nAdding a new page or directory\nOther\nFor a small improvement, please feel free to merge the MR yourself. Otherwise, please tag the appropriate code owner for review and approval. The guidance below should be followed for driving awareness:\nInforming team members about the changes\nIt is your responsibility to communicate with relevant team members about your merge request. Here are some best practices to follow:\nFor significant changes affecting the whole Product or Engineering team, consult your manager or product leader for the best communication strategy.\nFor changes specific to product management, tag\n@gl-product-pm\nin the merge request before merging.\nIndicate in the comment whether you are requesting contributions and feedback or simply providing information.\nFor changes relevant to other teams, tag department leads such as the VP of UX, VP of Development, or the Director of Quality Engineering in the merge request before merging.\nShare and cross-post the merge request link with a brief description in relevant channels such as Slack\n#product\n,\n#product-leadership\n,\n#eng-managers\n, and\n#ux-managers\n.\nFor more guidance on communication, refer to the\nGitLab Communication tips and best practices\n.\nProduct Management\nIf youd like to collaborate with product management see\nHow to Engage\nguide.\nProduct Principles\nThe\nProduct Principles\nsection is where you can learn about our strategy and philosophy regarding product development here at GitLab.\nProduct Processes\nFor a detailed view on how we do Product Development, read up on our established\nProduct Processes\n.\nProduct sections, stages, groups, and categories\nTo learn how the GitLab product and our Teams are organized review our\nProduct Categorization section\n.\nAbout the GitLab Product\nLearn about\nGitLab as a product\n, including what does it mean to be a single application, our subscription tiers and pricing model, and the basics of permissions in the platform.\nProduct Manager Responsibilities\nUnderstand the\nroles and responsibilities of product managers\n.\nBeing a Product Manager at GitLab\nWant to know more on what being a Product Manager at GitLab is like? Checkout our\nProduct Management\nguide for helpful information like our Career Development Framework and learning/development resources.\nProduct Performance Indicators\nLearn how we measure success in Product via our\nProduct KPIs\n, which are tracked in our\nProduct project\n. For best practices and guidance on how to add instrumentation for features please review our\nAnalytics Instrumentation workflow\n.\nOur Product Leadership Team\nLearn about\nour Product Leadership Team\nand learn about them via their personal READMEs.\nCommunicating with the Product Division\nBelow are team emails and handles that can be used for different departments and sub-departments in the Product Division. These groups are used for internal communication and the\n@mention\ncan only be used by project members. Please remember that tagging\n@mention\non issues will generate in-product\nto-do items\nand email notifications to\nall\nteam members in that project, so use it only when you need to communicate with the entire team. For communication specifically for product managers, please leverage\nHow to Engage\n.\n@gl-product-leadership\ntags all group managers, directors and VPs in the Product Division\n@gl-product-plt\ntags all direct reports to the VP Product in the Product Division\n@gl-product-pm\ntags to all members of Product Management, Product Monetization and Program Managers in the Product Division\n@gl-product\ntags to all members in the Product Division: Product Management, Product Monetization, Program Management, Product Design, User Research, and Technical Writing\nproduct@gitlab.com\nemails all members of Product Management, Product Monetization and Program Management in the Product Division\nux-department@gitlab.com\nemails all members of UX (UX Research, Technical Writing and Product Design) in the Product Division\n@gitlab-com/gitlab-ux\ntags all members of UX (UX Research, Technical Writing and Product Design) in the Product Division\n@gitlab-com/gitlab-ux/managers\ntags all people managers within UX (UX Research, Technical Writing, and Product Design)\n@gitlab-com/gitlab-ux/designers\ntags all Product Designers and Design Managers in UX\n@gl-docsteam\nfor all Technical Writers in UX\n#technical-program-management a place to reach the entire TPgM team across organizations\nWhen you are tagging\n@mention\n:\nClearly state why you are tagging the entire product team and what action you need product team members to take.\nWrite a short summary in the same comment so team members can quickly understand the necessary context.\nReview the issue title and description to ensure it has relevant details other product team members need\nBEFORE\nsubmitting the comment. The issue title will be the subject of email notifications and in-product to-do items.\nIf asking team members to review a change, please directly link to the specific page on the\nreview app\nand any relevant issues or MRs.\nAI-assisted features\nThis page contains information about AI at GitLab.\nCollaboration on shared feature and experience areas\nCollaboration process and documentation of shared feature areas for product groups\nGitLab Product Management\nThis document describes what Product Management does, where, when, and how to engage with the...\nPersonas\nRoles vs personas Personas describe the ideal target for GitLab. They help us define our messaging...\nProduct Group and Team Pages\nPurpose Each team is empowered to work efficiently and document their practices in the GitLab...\nProduct Leadership Team Resources\nOverview This section of the handbook collects all the resources related to the Product Leadership...\nProduct Principles\nThese are core principles we believe world class product organizations exhibit. The goal is to build a PM system that fosters and honors these principles, in a way that works for GitLab.\nProduct Processes\nAs a Product Organization, we work to create a flexible yet concise product development framework for developing products that customers love and value.\nProduct READMEs\nProduct sections, stages, groups, and categories\nPrinciples - Processes - Categories - GitLab the Product - Being a PM - Leadership\nInterfaces We...\nUX Department\nThe GitLab UX department comprises four areas to support designing the GitLab product: UX Research, Product Design, Technical Writing, and Foundations\nLast modified September 2, 2025:\nUpdate the Product Team page with Manav and README link (\n5e2d904b\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/product/",
    "title": "Product Handbook | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:51:00.450638",
    "content_length": 8278,
    "section": "handbook"
  },
  "processing": {
    "original_length": 8278,
    "cleaned_length": 8276,
    "cleaned_at": "2025-10-27T16:13:42.449086",
    "processor": "text_cleaner_v1",
    "word_count": 1264
  }
}