{
  "content": "GitLab.com Subscriptions\nHow GitLab.com subscriptions work\nGitLab.com subscriptions work slightly differently to Self-managed licenses.\nUnlike Self-managed licenses which grant equal access to features across an installation, GitLab.com subscriptions are applied to\nnamespaces\non GitLab.com (typically groups). Members of groups that have subscriptions applied to them will enjoy those features anywhere within the licensed namespace. For example, if\nBigCorp\nhas an Ultimate license, the sub-groups\nBigCorp/Frontend\n,\nBigCorp/Backend\nwill each have access to Ultimate features and share a common pool of Shared Runner minutes.\nCommon Misconceptions\nMisconception\n: If Im in an Ultimate group, my GitLab.com profile should say Ultimate\nReality\n: GitLab.com subscriptions are scoped to a namespace, and individual users could participate in many groups with different subscription types. For example, they might have personal projects on a Free subscription type, participate in an open-source project that has Ultimate features (because its public) while their company has a Premium subscription.\nMisconception\n: Subscriptions grant the midas touch and any group or project a subscription-bearing user creates will get the features of their subscription level. i.e. an Ultimate user will be able to create Ultimate groups in which all members will have Ultimate features.\nReality\n: Subscriptions can be applied to\ngroup namespaces only\nand all items created within said namespace will receive the features of the subscription level.\nReality\n: All users invited to the group namespace will be able to enjoy the features of that subscription\nonly while working in the subgroups and projects\nwithin the group\n.\nReality\n: Users accounts, also called personal namespaces, will by default be on the\nFree plan\n. Any group, subgroup, or project created in a personal namespace will also be on the\nFree plan.\nReality\n:\nNote, as of November 17, 2020, GitLab no longer offers new subscriptions for personal namespaces.\nMisconception\n: A license key will be emailed out and applied somewhere in the UI of GitLab.com\nReality\n: Subscriptions are managed, and applied, through\nhttps://customers.gitlab.com\non a linked GitLab.com account\nMisconception\n: Someone in accounting made the purchase and can pass along the subscription to the team using it.\nReality\n: Subscriptions are managed by a GitLab.com account who has\nOwner\nin the group.\nMisconception\n: I should purchase my subscription first before setting up accounts on GitLab.com\nReality\n: You can do this in any order, most will find it easier to set things up on.com before they purchase, with the exception of those who want to set up SAML.\nMisconception\n: I can apply different subscription levels to subgroups.\nReality\n: Subscriptions are applied to top level groups; sub-groups inherit their license (and Shared Runner minutes) from the top-level group.\nMisconception\n: Minutes are deducted from my group for any jobs that are run, even on my personal runners.\nReality\n: Runner minutes are deducted only from jobs run on GitLab.com Shared Runners, you can set up your own runners per project or group without affecting your shared minutes.\nTrials\nTrials should be initiated by users by going to the Settings page of the group that they want to apply the trial to.\nAt writing (2019-06-05) Premium trials are not generally available.\nSupport can manually downgrade a trial by request\nAt writing (2019-06-05)\nTrials must be manually downgraded before a purchase can be made.\nSupport is\nnot\nincluded with trials\nPlease participate in\nthis issue\nInternal namespaces\nGitLab subscriptions for internal namespaces are managed by the IT Operations team. To request\na subscription to an internal group or internal project, please submit an\nindividual access request\n.\nCommon issues the Support Team encounters with sales-assisted purchases\nNew Customers\nThe support team sometimes receives tickets in Zendesk from sales-assisted clients with basic questions like how to set up groups, how to add additional users, why subscriptions are applied to groups vs users, permission questions, etc. Support will direct them to corresponding documentation to address their questions.\nCustomers are typically not aware that creating an account in the CustomersDot does not create an account on GitLab.com or how to link a CustomersDot account to their GitLab.com account.\nUpgrades/Downgrades\nThere is presently not a self-service way for customers to upgrade/downgrade subscriptions so any of these requests must go through the sales team via a queue in Zendesk.\nRequests can sometimes be delayed by the volume or lack of information provided when the ticket is sent to Sales.\nDealing with True-ups\nSupport team sometime receives tickets in Zendesk from sales-assisted clients with problem conerning true-up being reconciled before the subscription renewal.\nCase: The customer purchased a license for\n39\nPremium seats with start date of\n2020-03-04\nand end date\n2021-03-04\n. During the license period, the customer add more users to the system that incurs\n112 Users over license\n/\nTrue-up\n. If this is charged as True-up on SFDC, the new license will not include the extra users in the current term so the customer would end up with a license with\n39\nseats and\n112\ntrue-up which cannot be uploaded to their system because they now have\n39 + 112\n=\n151\nbillable users on the system.\nIf the customer would like to deal with\nUsers over license\n/\nTrue-ups\n, it should be charged as\nAdd-on users\nto the license as mentioned in\nQuarterly Self-Managed Seat Reconciliation & Billing\n.\nDealing with Add-ons Users\nIn contrast to Dealing with True-ups, if the customer purchased\nAdd-on users\nwhile theres only a few weeks left before their renewal, please reconcile the\nUsers over license\n/\nTrue-ups\nat the renewal instead.\nAssisting the customer on purchasing\nAdd-on users\nwhen theres only a few week left until the license expires will resulted in an error license once the purchase is processed. Please take into consideration the existing license Service Period, the time it takes to process the purchase, and the time for the customer to upload the license.\nHow we can set the customer up for success\nThe best way to assist a user or system admin on any new platform is to arm them with the resources they will need when questions arise. During the onboarding process after the sale, the user/admin will receive an email from GitLab with pertinent information about their subscription. Highlight this and encourage them to save it somewhere easily accessible.\nWhile many of the links below are included in the email, it would be helpful to review each of the following resources personally with the user/admin.\nGitLab Documentation\nAdministrator Documentation\n(self-managed only)\nSubscription setup and management\nLicensing and subscription FAQ\nUploading your license\n(self-managed only)\nFeatures available by plan:\nGitLab.com\n&\nSelf-Managed\nSupport portal\nStatement of Support\nA few more best practices to ensure a smooth start\nOn this page, youll read about differences between GitLab.com and Self-Managed functionality. Whenever in doubt, dont hesitate to ask us about a particular feature/functionality which is important to your prospect prior to promissing it is available. For a question like this, contact us on Slack in the\n#support_gitlab_com\nor\n#support_self-managed\nchannel.\nBe sure to stress to the new user/admin to submit their support issues directly to us via the\nSupport Portal\ninstead of using you as a go-between. This will provide the most timely and comprehensive support we can offer.\nIf you find yourself having to submit something on behalf of the user/admin, do not submit a ticket via the Support Portal/Zendesk. Instead, create an issue in\ninternal-requests\n.\nFor GitLab.com, make sure the user understands how to link their GitLab.com account to the\nCustomersDot\nand how to associate their group with their subscription. See\nmanaging subscriptions page\nfor instructions.\nImportant differences between GitLab.com and Self-Managed subscriptions\nThe\nPricing page\nincludes a Frequently asked questions for GitLab.com section that answers What features do not apply to GitLab.com? in detail. Here are some highlights:\nFeatures availability including\nSAML\n/\nLDAP\nis Free vs.\nSAML SSO\nis Premium.\nAccess controls: customer is admin on GitLab instance vs. group owner on GitLab.com\nLog information and auditing: unrestricted access vs. no access on GitLab.com (can work with Support/Security to answer questions)\nOn GitLab.com, each user is signing a contract (TOS, privacy policy, etc) as individuals, regardless of what email domain they use. Because of that, we cannot provide their employer with any personally identifiable information (like email address, log info, etc.) as it would be a violation of the users contract.\nInstance wide settings: custom vs. same for all GitLab.com users\nInfrastructure: manage your own, anywhere vs. GitLab manages HA Architecture, instance level backups/recovery, upgrades, based in US\nLast modified July 8, 2025:\nEUS - Access Requests Update (\nb88590d3\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/marketing/brand-and-product-marketing/product-and-solution-marketing/enablement/dotcom-subscriptions/",
    "title": "GitLab.com Subscriptions | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:50:07.579800",
    "content_length": 9210,
    "section": "handbook"
  },
  "processing": {
    "original_length": 9210,
    "cleaned_length": 9189,
    "cleaned_at": "2025-10-27T16:13:42.402748",
    "processor": "text_cleaner_v1",
    "word_count": 1440
  }
}