{
  "content": "Understanding the Basics\nWhat is Tier 2 On-Call?\nThink of incident response like a triage system in a hospital:\nTier 1 is the first responder and they respond to all alerts across all systems. They determine whats actually broken and how serious it is.\nTier 2 (SME Specialists) are the experts who get called in when an issue requires deep knowledge of a specific domain or service. You know the code, architecture, and quirks of your particular system inside and out.\nWhen Tier 1 encounters something complex in your domain, they escalate to you. Youre the specialist they trust to fix it.\nHow Does This Fit Into Our Organization?\nOur incident response has multiple layers to make sure the right person is handling the right problem at the right time:\ngraph TD\nA[\" Alert Triggered\"] -- B[\"Tier 1 On-CallFirst Responders\"]\nB -- C{\"Requires DomainExpertise?\"}\nC --No D[\" Tier 1 Resolves\"]\nD -- E[\" Document & Close\"]\nC --Yes F[\" Escalate to Tier 2\"]\nF -- G[\"Tier 2 SMEDomain SpecialistYOU\"]\nG -- H[\" Investigate &Apply Deep Knowledge\"]\nH -- I{\"ComplexEscalation?\"}\nI --No J[\" Tier 2 Resolves\"]\nI --Yes K[\" Escalate toManagement\"]\nJ -- L[\" Document & Close\"]\nK -- L\nstyle A fill:#ff6b6b\nstyle B fill:#4ecdc4\nstyle G fill:#ffe66d\nstyle D fill:#95e1d3\nstyle J fill:#95e1d3\nstyle E fill:#c7f0d8\nstyle L fill:#c7f0d8\nstyle K fill:#f38181\nWhat Does Tier 2 On-Call Actually Involve?\nWhen youre on-call, youre responsible for being reachable during your shift (well define exact hours for your rotation), responding within 15 minutes when you get paged with a critical issue, investigating and resolving problems in your domain, communicating progress and next steps during incidents, documenting what happened so others can learn from it, and handing off to the next on-call engineer when your shift ends.\nYoure not expected to know everything or fix every problem instantly. Youre expected to be available, engaged, and willing to dig into issues when they arise.\nWhy Do We Have Tier 2 On-Call?\nThis program exists to keep the platform stable by having experts ready to respond to domain-specific problems, balance the load so not everyone gets paged for every issue, develop engineers by giving you ownership and experience with production issues, and build institutional knowledge by documenting what breaks and how we fix it.\nWho Is Involved?\nThe Tier 2 on-call program involves you and your teammates as Tier 2 engineers, your rotation leader who manages the schedule and escalation paths, Tier 1 on-call who are the first responders that will page you, the IMOC who coordinates during complex incidents, and management who provides support and handles escalations.\nRelated Pages\nYour First Shift\n Prepare for your first on-call rotation\nCommunication and Culture\n Learn how we communicate during incidents\nOn Call Processes and Policies\n Learn about Tier 2 specific responsibilities\nLast modified October 19, 2025:\ndrs-add-landing-page-tier2 (\n6f2cba79\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/engineering/devops/oncall/understanding-the-basics/",
    "title": "Understanding the Basics | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:51:18.312011",
    "content_length": 3081,
    "section": "handbook"
  },
  "processing": {
    "original_length": 3081,
    "cleaned_length": 3008,
    "cleaned_at": "2025-10-27T16:13:42.550029",
    "processor": "text_cleaner_v1",
    "word_count": 485
  }
}