{
  "content": "GitLab Epic Summary with Duo Agent\nProcess for summarizing epic status based on related issues, comments and statuses.\nOverview\nThis document outlines our process for generating weekly summaries for our in-progress epics.\nThe Problem\nIt can be difficult to efficiently see the current status, health and next steps for a given epic.\nThe Solution\nWe use Duo Agent with a standardized prompt to generate a summary in a format that is pertinent to our team as well. The summaries also serve as snapshots of where we were at a given moment.\nCreate a table of in flight issues and their workflow status\nSurface any blockers or impediments\nCall out any missed steps from previous summaries\nCalculate completed progress percent by weight\nNotify concerned parties\nProcess\nStep 1: Weekly DRI update\nFor each epic of which you are the DRI add the epic URL to the prompt and run.\nEpic summary prompt, click me to expand\nFill in epic summary markdown template for this epic and create a top-level comment with an update.\nFor the SUMMARY section Provide a descriptive update of what happened since the last update summary of this epic. Evaluate next steps from previous update to ensure they were achieved, or note why they weren't.\nThe COMPLETE section should be the total weight of all completed issues as a percentage of all issue weights.\nSTATUS should answer \"what is the health status of the epic?\" Evaluate the health status of this epic based on: scope increases (more issues added, significant total weight increase in the middle of the project), impediments or blockers encountered and due date delivery at risk. Answer this question using only (:large_green_circle: On track :large_yellow_circle: Needs Attention :red_circle: At risk).\nDUE_DATE_AT_RISK should answer \"Is the due date at risk?\" Answer this question using only (:large_green_circle: On track :large_yellow_circle: Needs Attention :red_circle: At risk).\nFor the NEXT_STEPS section cover what are the next steps that would move this epic forward towards completion.\nThe NOTIFY section should be a list of users that would be interested in reading this summary. It should be in the format: \"\n@user\n,\n@user2\n, etc\"\nThe Impediments, risks & blockers section should provide an additional summary of blockers and impediments that were encountered. Remove entire section if no impediments\nThe Remaining work section should be a table with the headings Issue, Weight and Status. It should snapshot of state of the issues at the time of making update. This helps us see the progress in time, especially when scope increases, additional issues are added etc. Only include issues that are in progress and not complete. The status column should contain the current workflow tag of the issue.\nThe template is as follows\n# Status update - Jan 01 2025\n##:clipboard: Summary\n\n1.\n**Complete:**\nxx% (change from xx%) \n1.\n**Status:**\n:large_green_circle: On track :large_yellow_circle: Needs Attention :red_circle: At risk\n1.\n**Update:**\n##:construction: Impediments, risks & blockers\n\n1.\n1.\n##:todo: Remaining work\n\n Issue  Weight  Status \n-----------------------\n   \"workflow::verification\" \n   \"workflow::in dev\" \n   \"workflow::in review\" \n*\nTotal issues:\n*\nTotal closed issues:\n*\nTotal weight of estimated issues:\n*\nTotal weight of completed issues:\n*\nCurrently we are\nxx%\ncomplete by issue weight with\nx\nunestimated issues.\n## Next Steps\n\n1.\n1.\n## Notify\n\ncc:\n@...\nStep 2: Review and Post\nReview the summary for:\nSound summary guidance\nClear next steps\nAccurate notification list\nTeam Benefits\nClear Understanding\n: No guesswork about what needs to be done next and what has been completed\nTime Savings\n: Summaries can be automatically generated and the template can be modified to meet current needs\nWhen to Use\nWhen you want to communicate the current progress of an epic or snapshot the current progress at a milestone.\nSuccess Criteria\nWe measure success through a reduction of comments asking for updates regarding the current state of the epics or its related issues.\nFeedback and Iteration\nThis process should evolve based on team feedback and results.\nPrompt effectiveness and accuracy\nDuo Agentic performance improvements\nLast modified October 14, 2025:\nRemove trailing spaces (\n3643eb9e\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/engineering/development/growth/ai-prompts/epic-summary-prompt/",
    "title": "GitLab Epic Summary with Duo Agent | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:49:59.580334",
    "content_length": 5127,
    "section": "handbook"
  },
  "processing": {
    "original_length": 5127,
    "cleaned_length": 4302,
    "cleaned_at": "2025-10-27T16:13:42.310076",
    "processor": "text_cleaner_v1",
    "word_count": 684
  }
}