{
  "content": "Data Steering Committee at GitLab\nGitLab Data Steering Committee Handbook\nData Steering Committee Purpose\nThe purpose of this Data Steering Committee is to oversee and drive the strategic direction of GitLab Enterprise data initiatives. The forum ensures that data is leveraged effectively to support business goals, improve decision-making processes, and drive innovation. It acts as a governing body to help establish policies, standards, and best practices for data governance, data quality, data privacy, data adoption, and data security.\nData Steering Committee Charter\nThe Data Steering Committee Charter sets out the broad expectations on the responsibilities and outcomes achieved by the committee. It tries to set the meeting format, participants and desired agenda across broad data management topics.\nScope\nThe enterprise data initiatives/projects should broadly be under the scope of following categories:\nData Strategy\nData Quality Management\nData Security\nData Lifecycle Management\nData Architecture and Modeling\nData Discovery/Metadata Management\nData Mastery and Reference Data\nData Adoption/Data Literacy\nData as value driver and outcome oriented\nResponsibilities\nDefine, approve and communicate enterprise data strategies, data policies, data standards, procedures and metrics.\nTracks and enforces regulatory compliance and conformance to data policies, standards and procedures\nUnderstand and promote the value of data assets\nInitiate, track and oversee the delivery of committed quarterly KRs\nImportant decision making to bring consensus around data processes, enterprise metric definitions, data mastery or reference data and validation procedures\nComposition\nThe Data Steering Committee consists of\nHead of Data & Insights\nLeadership team of Data & Insights\nSenior leadership from lines of business\nSenior leadership from IT\nSenior leadership from Security, Legal and Audit\nData Governance Program Manager\nSubcommittees or Working Groups\n The Data Steering Committee may form and delegate authority to subcommittees, consisting of one or more members of the overall Committee. These subcommittees would be responsible for evaluating and providing recommendations for specific topics before the Committee.\nMeetings and Communication\nMost of the communication will be done ASYNC through slack channel.\nThe meetings will be scheduled on a need basis. The meeting will be chaired by the Head of Data & Insights. Meetings may be called by the Chair as needed. Any member may propose additional meetings by contacting the Chair, if needed.\nMeasuring and Reporting\nThe following reporting will be built (in future, targeting H2 FY26) to track the progress and success of the initiatives -\nProgram Status Reporting\nData Quality Dashboard\nData Asset Library\nCharter Review\nThis charter will be reviewed every year by Data Steering Committee to ensure it continues to meet the needs and includes the evolving best practices.\nLast modified January 8, 2025:\nRemove trailing spaces (\nc104140c\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/enterprise-data/organization/data-steering/",
    "title": "Data Steering Committee at GitLab | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:50:03.588329",
    "content_length": 3060,
    "section": "handbook"
  },
  "processing": {
    "original_length": 3060,
    "cleaned_length": 3059,
    "cleaned_at": "2025-10-27T16:13:42.334969",
    "processor": "text_cleaner_v1",
    "word_count": 447
  }
}