{
  "content": "Security at GitLab\nSecurity Vision and Mission\nOur vision is to transparently lead the world to secure outcomes.\nOur mission is to enable everyone to innovate and succeed on a safe, secure, and trusted DevSecOps platform. This will be achieved through 5 security operating principles:\nAccelerate business success with a focus on:\nPrioritize boring, iterative solutions that minimize risk\nFind ways to say Yes\nUnderstand goals before recommending solutions\nUse GitLab first\nEfficient operations with a focus on:\nTechnical controls over handbook rules\nLeverage automation first (robots over humans)\nResponsible decisions (Spending, Tooling, Staffing, etc) over low ROI (return on investment) decisions\nReusable or repeatable over singular solutions\nTransparency with a focus on:\nResponsible protection of MNPI (material non-public information)\nEvangelize\ndogfooding\nof GitLab publicly\nLead with metrics\nBalance security with usefulness\nRisk Reduction with a focus on:\nSecure by default\nPreventative controls over detective controls\nSolving root causes over treating symptoms\nVisibility through Coverage, Discoverability, Observability\nCollaborative Culture with a focus on:\nWorking together on common solutions\nSolve shared problems with shared solutions\nSimplifying language for everyone to understand\nAvoiding security jargon\nSeek opportunities to help others succeed\nDivision Structure\nThe Security Division provides essential security operational services, is directly engaged in the development and release processes, and offers consultative and advisory services to better enable the business to function while minimising risk.\nTo reflect this, we have structured the Security Division around four key tenets, which drive the structure and the activities of our group. These are:\nProduct Security\nSecurity Operations\nCorporate Security\nSecurity Assurance\nApplication Security\nInfrastructure Security\nSecurity Platforms and Architecture\nVulnerability Management\nData Security\nSecurity Logging\nSecurity Incident Response Team (SIRT)\nTrust and Safety\nRed Team\nThreat Intelligence\nSignals Engineering\nCorporate Security\nHelpdesk Support\nTech Stack Systems\nEngineering Teams\nField Security\nSecurity Compliance\nSecurity Governance\nSecurity Risk\nSecure the Product - The Product Security Department\nThe\nProduct Security Department\nis primarily focused on Securing the Product. This reflects the Security Divisions current efforts to be involved in the Application development and Release cycle for Security Releases, Infrastructure Security, and our HackerOne bug bounty program.\nThe term Product is interpreted broadly and includes the GitLab application itself and all other integrations and code that is developed internally to support the GitLab application for the multi-tenant SaaS. Our responsibility is to ensure all aspects of GitLab that are exposed to customers or that host customer data are held to the highest security standards, and to be proactive and responsive to ensure world-class security in anything GitLab offers.\nProtect the Company - The Security Operations Department\nSecurity Operations Department\nteams are primarily focused on protecting GitLab the business and GitLabs platform. This encompasses protecting company property as well as to prevent, detect and respond to risks and events targeting the business and our platform. This department includes the Security Incident Response Team (SIRT) and the Trust and Safety team.\nThese functions have the responsibility of shoring up and maintaining the security posture of GitLabs platform to ensure enterprise-level security is in place to protect our new and existing customers.\nLead with Data - The Threat Management Department\nThreat Management Department\nteams are cross-functional. They are responsible for collaborating across the Security Division to identify, communicate, and remediate threats or vulnerabilities that may impact GitLab, our Team Members or our users and the community at large.\nAssure the Customer - The Security Assurance Department\nThe\nSecurity Assurance Department\nis comprised of the teams noted above. They target Customer Assurance projects among their responsibilities. This reflects the need for us to provide resources to our customers to assure them of the security and safety of GitLab as an application to use within their organisation and as a enterprise-level SaaS. This also involves providing appropriate support, services and resources to customers so that they trust GitLab as a Secure Company, as a Secure Product, and Secure SaaS\nProtect the Organization - Corporate Security\nGitLab is both a company and a product. The\nCorporate Security\ndepartment focuses on implementing and protecting the information technology (IT) related systems that the company uses to conduct business internally, and provides the hardware, software, and tools that our team members and 3rd party service providers (aka contractors) need to be productive and get their job done efficiently. The configurations that we implement for team members internally are designed to protect our customers and their data.\nWe have a 24x5\ntechnical support helpdesk\nfor team members and have engineers that configure and maintain many of our company-wide\ntech stack applications\n.\nWe invest heavily in\ndevice trust, identity management, and infrastructure governance\nto provide the highest level of security assurance for the administrators of our product and ensure all appropriate controls are in place when handling customer data.\nOther groups and individuals\nSecurity Program Management\nSecurity Program Management is responsible for complete overview and driving security initiatives across Product, Engineering, and Business Enablement. This includes the tracking, monitoring, and influencing priority of significant security objectives, goals, and plans/roadmaps from all security sub-departments.\nSecurity Program Manager Job Family\nSecurity Program areas of focus\nDrive Accountability & Visibility for Program Objectives & Goals\nDrive, Gather, & Examine Program Needs & Opportunities through Intra & Inter Organizational Collaboration\nProvide Insights & Suggestions Impacting Program Strategy & Roadmap\nAssist in Gathering & Prioritizing Program Risks, Requirements, & Alignment to Influence Remediation\nDrive & Define Acceptance Criteria, Value Proposition, Milestones to Visualize and Communicate Program Effectiveness\nDevelop Repeatable, Scalable, Efficient, Effective, Processes & Procedures\nProduct development\nIn keeping with our\ncore values\nand the belief that\neveryone can contribute\n, the Security Division is committed to\ndogfooding\nand contributing to the development of the GitLab product.\nContacting the Team\nReporting vulnerabilities and security issues\nFor information regarding GitLabs\nHackerOne bug bounty program\n, and creating and scheduling security issues, please see our\nengaging with security\npage and our\nResponsible Disclosure Policy\n.\nReporting an Incident\nIf an urgent security incident has been identified or you suspect an incident may have occurred, please refer to\nEngaging the Security Engineer On-Call\n. Examples include, but are not limited to:\nLost or stolen devices\nLeaked credentials\nEndpoint compromise or infection\nExposure of sensitive GitLab data\nGitLab provides a\npanic@gitlab.com\nemail address for team members to use in situations when Slack is inaccessible and immediate security response is required.\nThis email address is only accessible to GitLab team members and can be reached from their gitlab.com or personal email address as listed in Workday. Using this address provides an excellent way to limit the damage caused by a loss of one of these devices.\nAdditionally if a GitLab team member experiences a personal emergency the People Group also provides an\nemergency contact email\n.\nSub-groups and projects\nMany teams follow a convention of having a GitLab group\nteam-name-team\nwith a primary project used for issue tracking underneath\nteam-name\nor similar.\n@gitlab-com/gl-security\nis used for @mentioning the entire Security Division\n@gitlab-com/gl-security/security-managers\nis used for @mentioning all managers in the Security Division\nSecurity Division Meta\nis for Security Division initiatives,\nmeta\nand backend tasks, and catch all for anything not covered by other projects\nSecurity Assurance (@gitlab-com/gl-security/security-assurance)\n@gitlab-com/gl-security/security-assurance/sec-compliance\n@gitlab-com/gl-security/security-assurance/field-security-team\n@gitlab-com/gl-security/security-assurance/security-risk-team\n@gitlab-com/gl-security/security-assurance/governance\nProduct Security (@gitlab-com/gl-security/product-security)\nProduct Security Meta\nFor department wide management and planning issues.\n@gitlab-com/gl-security/product-security/appsec\nis the primary group for @mentioning the Application Security team.\n@gitlab-com/gl-security/product-security/appsec/psirt-group\nis the primary group for @mentioning the Product Security Incident Response Team (PSIRT)\n@gitlab-com/gl-security/security-research\n@gitlab-com/gl-security/threatmanagement/vulnerability-management\nSecurity Operations (@gitlab-com/gl-security/security-operations)\nSecurity Operations Department\n@gitlab-com/gl-security/security-operations/sirt\nis the primary group for @mentioning the Security Incident Response Team (SIRT).\nSIRT (private)\nfor SIRT issues.\n@gitlab-com/gl-security/security-operations/trust-and-safety\nis the primary group for @mentioning the Trust & Safety team.\n@gitlab-com/gl-security/security-operations/redteam\nCorporate Security (@gitlab-com/gl-security/corp)\nFunctional Teams Org Chart\nIssue Tracker\n@gitlab-com/gitlab-com/gl-security/corp/managers\n- Management Team\n@gitlab-com/gitlab-com/gl-security/corp/helpdesk\n- End User Services Helpdesk Team (see\nSupport Handbook Page\n)\n@gitlab-com/gitlab-com/gl-security/corp/logistics\n- Laptop and Phone Logistics\n@gitlab-com/gitlab-com/gl-security/corp/code\n- Code Platforms Engineering\n@gitlab-com/gitlab-com/gl-security/corp/device\n- Device Trust Engineering\n@gitlab-com/gitlab-com/gl-security/corp/identity\n- Identity Engineering\n@gitlab-com/gitlab-com/gl-security/corp/infra\n- Infrastructure Governance Engineering\n@gitlab-com/gitlab-com/gl-security/corp/saas\n- SaaS and Tech Stack Engineering (shared responsibility handled by Device Trust and Identity Teams)\n@gitlab-com/gitlab-com/gl-security/corp/dept\n- Entire Department\nSlack Channels\n#security_help\n: The catch-all channel for security questions that are not direct support requests. If youre not sure where to go, start here.\n#it_help\n: For all your internal end user support needs and CorpSec support needs. All support related questions and requests should be directed here.\n#security_discuss\n: Security discussions, announcements, and regular updates from the security teams. This is a good channel for cross-function collaboration with internal transparency.\n#abuse\n: Used for reporting suspected abusive activity/content (\nGitLab Internal\n) as well as general discussions regarding anti-abuse efforts. Use\n@trust-and-safety\nin the channel to alert the team to anything urgent.\n#ciso\n: For general communication from our CISO and CISO Directs. Team and division updates and other topics.\nThe following group tags can help you get the attention of a specific department, team, or specialty:\nPrimary Security departments\n:\n@security-assurance\n: Contains all members of the Security Assurance department.\n@security-corpsec\n: Contains all members of the Corporate Security department.\n@security-prodsec\n: Contains all members for the Product Security department.\n@security-operations\n: Contains all members of the Security Operations department. If you need to open a security incident, please use the Slack slash command\n/security\ninstead of a tag.\nLeadership and program support\n:\n@security-leadership\n: All Security people-managers\n@security-program-mgmt\n: All security program management team members\nSpecific teams and specialties\n:\n@fedramp-compliance\n: All SecAssurance members that support FedRAMP\n@security-governance\n: All members of the Security Governance team\n@sirt-members\n: All members of the Security Incident Response Team (SIRT)\n@sec-assurance-team\n: All members of the Security Compliance, Risk, and Governance & Field Security teams\n@field-security\n: All members of the Field Security team\n@appsec-team\n: All members of the Application Security team\n@trust-and-safety\n: All members of the Trust & Safety team\n@security-identity\n: All members of the Identity team\n@red-team\n: All members of GitLabs Red Team\n@threat-intelligence\n: All members of GitLabs Threat Intelligence team\nDivision, Department, and Team updates\nWe believe it is important to share regular updates at various levels of the Security Division, and we use Slack as the primary mechanism for providing these updates. Our updates are open to all GitLab team members using the following process:\nStart of each month:\nA thread per-department is started in\n#security_discuss\nby each department leader (CorpSec, ProdSec, SecAssurance, SecOps). These threads are pinned for the duration of the month.\nThread template:\n Weekly Updates\nExample:\nAugust Product Security Weekly Updates\nWeekly:\nAt least once a week, teams provide updates they wish to share within the appropriate thread. For example, updates from Vulnerability Management would be placed in the Product Security thread for the given month.\nThese weekly updates, while highly encouraged, are strictly optional and should represent content that ICs and managers feel should be highlighted. Teams are encouraged to define processes and DRIs around these updates that work for them.\nIndividuals providing the weekly updates are encouraged to use the Also send to #security_discuss option within the thread to increase visibility.\nEnd of each month:\nDepartmental leaders prepare a monthly update, including no more than\nthree updates per team\n, and post it in\n#ciso\nwithin the first week of the following month.\nEach monthly update should include a brief preface written by the departmental leader covering any notable themes or other strategic updates.\nEach of the three updates per-team should be no more than 2-3 sentences and include at least one link to allow readers to gain additional context. Links should be to GitLab Issues or Epics wherever possible. If information is confidential and not able to be added to an Issue or Epic, a note should be added indicating this.\nIt is recommended that departmental leaders build their monthly update over the course of the month via a GitLab issue (\nsee an example\n) in collaboration with their managers and senior ICs.\nTwice-Monthly Security Leadership Meetings\nSecurity Leadership meets twice a month over Zoom to discuss division-wide topics. Individual contributors from across the security organization are invited to present their work, ideas, or projects to this leadership forum.\nIf youre interested in presenting:\nDiscuss the topic with your manager first\nYour manager will help you:\nAdd your topic to the agenda with supporting materials\nRequest an appropriate time slot (5-25 minutes)\nCoordinate scheduling your presentation\nNote that these meetings are not on the general Security calendar. Your manager will ensure you receive the meeting invitation for your scheduled time.\nWe encourage all team members to take advantage of this opportunity to share your work and insights with security leadership.\nRansomware\nFor an overview of the communication and response process for a suspected ransomware attack, please see our\nResponding to Ransomware\npage.\nImportant topics\nTokens\nThe following best practices will help ensure tokens are handled appropriately at GitLab. For detailed requirements regarding the use of tokens at GitLab, please see our\ntoken management standard\n.\nWhen creating a\nPersonal Access Token\n, be sure to choose the appropriate\nscopes\nthat only have the permissions that are absolutely necessary.\nOftentimes a\nProject Access Token\nmight be sufficient instead of a Personal Access Token. Project Access Tokens have a much more limited scope and should be preferred over Personal Access Tokens whenever possible.\nAlways set an expiration for your tokens when creating them. Tokens should preferably expire in a matter of hours or a day.\nBe mindful to keep these personal access tokens secret. Be particularly careful not to accidentally commit them in configuration files, paste them into issue or merge request comments, or otherwise expose them.\nPlease consider periodically reviewing your currently active Personal Access Tokens and revoking any that are no longer needed.\nPersonal Access Tokens will be highly discouraged within the GitLab production environment, and disallowed/disabled wherever possible. Existing tokens shall remain, but additional issuance will not be permissible/possible.\nIf you believe a personal access token has been leaked, revoke it immediately (if possible) and\ncontact the security team\nusing the\n/security\nSlack command.\nReceive notification of security releases\nTo receive security release blog notifications delivered to your inbox, visit our\ncontact us\npage.\nTo receive release notifications via RSS, subscribe to our\nsecurity release RSS feed\nor our\nRSS feed for all releases\n.\nFor additional information regarding security releases, please visit the Delivery Teams\nsecurity releases\npage.\nResources\nTools\nIncident-Tools (private)\nfor working scripts and other code during or while remediating an incident.\nIf the tool is applicable outside of the\nGitLab.com\nenvironment, consider\nif its possible to release when the\nsecurity\nissue becomes\nnon-confidential. This group can also be used for private demonstration projects for\nsecurity issues.\nsecurity-tools (mostly private)\ncontains some\noperational tools used by the security teams. Contents and/or configurations\nrequire that most of these projects remain private.\nCalendar\nWe welcome GitLab team members to join meetings that are on our shared\nSecurity Calendar\n.\nOther Frequently Used GitLab.com Projects\nSecurity crosses many teams in the company, so you will find\nsecurity\nlabeled\nissues across all GitLab projects, especially:\ngitlab-foss\ngitlab\ninfrastructure\nproduction\nWhen opening issues, please follow the\nCreating New Security Issues\nprocess for using labels and the confidential flag.\nOther Resources for GitLab Team Members\nSecurity Best Practices, using 1Password and similar tools, are documented\non their own security best practices page.\nSecure Coding Training\n.\nGitLab.com\ndata breach notification policy\n.\nGitLab Internal Acceptable Use\nPolicy\n.\nFor GitLab.com, we have developed a\nGoogle Cloud Platform (GCP) Security Guidelines Policy\ndocument, which outlines recommended best practices, and is enforced through\nour security automation initiatives.\nGitLab Security Tanuki for use on security release blogs, social media and security related swag as appropriate:\nWeb-RGB\nPrint-CMYK\nand one\nexclusively for stickers\n.\nSecurity READMEs\nWorking in Security\nContributing to GitLab the product as a Security team member\nThreat Modeling\nLast modified October 3, 2025:\nMore policy reorganization (\n10563f30\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/security/",
    "title": "Security at GitLab | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:50:22.050012",
    "content_length": 19298,
    "section": "handbook"
  },
  "processing": {
    "original_length": 19298,
    "cleaned_length": 19252,
    "cleaned_at": "2025-10-27T16:13:42.481138",
    "processor": "text_cleaner_v1",
    "word_count": 2656
  }
}