{
  "content": "Support time off buddy system\nGuidelines for leveraging the Support time off buddy system\nOverview\nWhen you have upcoming time off, it can be daunting to prepare your tickets\nbefore youre out. Sometimes, this can even lead us to avoid taking time off due\nto the stress of dealing with ongoing tickets. While your peers and managers are\nhere to help, it can be difficult to ask for this help for some folks. In order\nto help out with these challenges, consider finding a\nSupport time off buddy\n!\nTime off buddies are intended to help tackle the following common problems:\nReduce burden of taking time off\nProvide continuity for customers and reports while out of office\nHelp keep each other accountable for taking time off\nHelp keep each other accountable for not checking in with work during time off\nProvide opportunities for focus days\nThe initial trial\nWe trialed the time off buddy system in 2022. You can find the original proposal\nand further discussion in the\nSupport Team Meta issue\n.\nThe original trial buddies were:\n Aric Buerer  Izzy Fee \n Bo Carbonell  Brie Carranza \n Keelan Lang  Julie Martin \n Sam Bernal-Damasco  Eric Rosenberg \nIf you have questions about the method, please reach out to any of the original\nparticipants to get their thoughts!\nResponsibilities\nAt a minimum, time off buddies are expected to review their buddys tickets each\nday until their buddy returns, and take action on tickets as needed. This\ndoes not\nmean that buddies must take ownership of the tickets. Instead, a\nbuddy should be prepared to take action if a ticket needs attention. This may\ninclude:\nFinding another resource to take over\nCommunicating with the customer that the assignee is out of office, and\ndiscussing if the customer is okay to wait for the assignee to return\nAlerting a manager of any spicy tickets or customers\nSince this is intended to be a low barrier program, the base responsibilities\nare intentionally simple. Time off buddies should work together to outline any\nadditional responsibilities or expectations.\nChoosing a buddy\nWe need to tell people how to choose buddies!\nTips\nEach engineer should manage their responsibilities in a way that works for\nboth buddies. To get started, here are things that we had success with in the\ntrial:\nSet up a time off pairing session with your buddy 1-2 days before you plan\nto be out of office to discuss your open tickets and other expectations.\nSet up a catch-up pairing session with your buddy 1-2 days after your return\nto get up-to-speed on the state of your tickets.\nInform your buddy of upcoming out of office as soon as its scheduled\nSet your buddy as covering for ticket reopens (and other agreed-upon\nresponsibilities) in Time Off by Deel.\nUse pairings\nWhen preparing to leave for time off, or when returning from time off, consider\nusing a\npairing session\nto keep your buddy informed.\nUse internal ticket comments\nPut a brief comment explaining the state of a ticket and expected next steps\nbefore leaving for time off. This also helps in the event that your buddy needs\nto hand off your ticket to someone else in your absence.\nUse Zendesk views\nYou can set up a Zendesk view to track your buddys tickets while theyre out.\nFAQ\nAm I in charge of my buddys tickets while theyre out?\nYour buddy is not expected to take over your tickets while you are out, but they\nshould serve as the interim DRI to help progress any of your active tickets.\nSee\nresponsibilities\nfor more info.\nShould I use my time off buddy for holiday coverage?\nYou can use the time off buddy system however it works for you. However, please\nfollow the Support team guidelines around\nholiday time off ticket management\nto ensure that all Support coverage goals are met.\nDoes my buddy need to be in the same region as me?\nWhere possible, you should follow the guidelines for\nchoosing a buddy\nto ensure the best coverage. You may have\na buddy in another region, as long as it works for you and helps, rather than\nhinders.\nHow many people can I be a buddy for?\nIdeally, buddy pairing should be 1 to 1. This lets you tailor a system that\nworks best for both engineers, so that you can get the most out of the system.\nIf youd like, you can have more than one time off buddy. In this case, be sure\nto keep the manager of one value in mind. It can be tempting to help as many\npeople as possible, but dont let it be to your own detriment.\nLast modified August 6, 2024:\nUpdate pages to remove SGG references (\nf88a0ea3\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/support/support-time-off-buddies/",
    "title": "Support time off buddy system | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:49:57.568097",
    "content_length": 4555,
    "section": "handbook"
  },
  "processing": {
    "original_length": 4555,
    "cleaned_length": 4501,
    "cleaned_at": "2025-10-27T16:13:42.507691",
    "processor": "text_cleaner_v1",
    "word_count": 799
  }
}