{
  "content": "The GitLab Mentorship Program hosted by the Women TMRG\nMentorship opportunities for women at GitLab sponspored by a partnership between the Women TMRG, GitLab Learning and Development team, and the GitLab DIB team\nThe GitLab Mentorship program hosted by the Women TMRG is a 5-month career development opportunity for participants to build trust across the organization, enable pathways for internal growth and development, and increase collaboration across teams. The program is hosted by the Womens TMRG.\nQuestions, comments, and feedback can be posted in the\n#women-at-gitlab-mentorship\nslack channel.\nYour browser does not support the video tag.\nHistory\nIn 2020, the Womens TMRG partnered with the Sales Organization at GitLab to offer the Women in Sales Mentorship Program pilot. This initial iteration was a huge success and inspired the scale of this iteration to include a wider audience. The program now runs on a yearly basis and has been expanded to include mentees who identify as women and non-binary team members.\nPlease see the results section for a list of sessions since launch.\nTestimonials\nDont take our word for it - check out what mentors and mentees at GitLab have to say about the program!\nFrom the Mentees\nThis mentorship program has been one of the highlights from my time at GitLab so far. My mentor is a great example of an empathetic leader who is great at strategic planning and communicating effectively. I was able to learn things during the program that I immediately applied to my work, and she inspired and motivated me in a way will persist much longer. My mentor has become one of my new role models, and I plan on keeping in touch with her far beyond this programs end.\nThis was my first mentorship experience and Im so glad I participated. I found my self confidence in my mentor session. I lacked that for so many years and to be reminded of my self value and worth was so enriching. I would highly recommend participating!\nFrom the Mentors\nIve been a Mentor throughout my career, the GitLab program is hands down the best experience Ive had. Both Mentor and Mentee are provided with resources and guidance to ensure a successful connection.\nOne of the elements I really enjoyed about this program was the opportunity to meaningfully connect with someone outside of my team - we both learned from each other!\nProgram Structure\nTitle\nDescription\nStart of Program Feedback Form\nA Culture Amp survey to measure results of the program. Participation is\nrequired\n.\nMentor/Mentee Training\nCompletion of the self-paced\nHow to be a Good Mentor or Mentee\ncourse on LinkedIn Learning is\nrequired\nof all mentors and mentees. If you prefer to review text-based information, you can instead review\nthis slides\n, created using content from the LinkedIn course.\nInitial program kickoff\nA 25-minute discussion to meet other mentors and mentees in the program. Attendance is\nencouraged\n.\n1:1 Mentor Sessions\nMentors and mentees should meet every other week for 30-minutes for a total of 5 months (with the option to extend). Sessions are led by the mentee and should be focused on specific goals. Attendance is\nrequired\n.\nMentor/Mentee Resources\nAsync resources\nare available as a training guide for all mentor/mentee pairs. These resources include suggested articles to read and discuss, strategies for goal setting, sample meeting agendas, and additional training material. Use of resources is encouraged but not required.\nEnd of Program Feedback Form\nA Culture Amp survey to measure results of the program. Participation is\nrequired\n.\nCurrent Program Timeline\nFill out\nthis Google form\nto be notified of mentorship programs happening in FY26!\nDate\nDescription\nRelated Resources\n2025-09-22\nCall for Mentors\n2025-09-22\nCall for Mentees\n2025-10-19\nApplications Close\n2025-11-05\nPairing of mentor relationships complete and communicated to applicants\nBy 2025-11-10\nPre-Program survey sent via Culture Amp\nBy 2025-11-21\nMentor/Mentee pre-program coffee chats\nTBA\nInitial program Kickoff meeting\nWeek of 2026-05-01\nEnd of program feedback due\nBeing a Mentor\nAs a mentor, you benefit from:\nFast feedback loop between team members and leadership\nOpportunity to form relationships with team members in other departments\nOpportunity to support Women at GitLab and live our values\nMentor requirements\nYou have been with GitLab for at least 3 months at the time of application\nYou have availability in your schedule to meet with your mentee on a bi-weekly basis for at least 30 minute meetings for the entire length of the program\nYou plan to make every effort to attend all live trainings included in the program structure\nYou are not on a\nFormal Coaching plan\nor PIP (Performance Improvement Plan)\nNote: Anyone at GitLab, regardless of gender identity, can apply to be a mentor in the Women at GitLab mentorship program.\nApplications will be prioritized based on:\nSkill and prior experience as a mentor\nPerformance in current role\nAvailable and appropriate mentee match in the current session\nApply\nPlease complete\nthis interest form\nto be notified of the next program iteration.\nApplying as a mentor does not guarantee you a spot in the program and eligibility will be evaluated based on criteria above.\nIf youve participated in a previous GitLab mentor program, you are welcome to apply again!\nBeing a Mentee\nAs a mentee, you benefit from:\nIncreased visibility with leadership\nIncreased professional development opportunities\nCareer coaching and guidance\nOpportunity to form relationships with leaders on other teams\nMentee requirements\nYoure a woman, including cis and trans women, or non-binary team member at GitLab.\nYou have been with GitLab for at least 3 months at the time of application\nYou have availability in your schedule to meet with your mentor on a bi-weekly basis for at least 30 minute meetings for the entire length of the program\nYou plan to make every effort to attend all live trainings included in the program structure\nYou are not on a\nFormal Coaching plan\nor PIP (Performance Improvement Plan)\nApply\nPlease complete\nthis interest form\nto be notified of the next program iteration.\nApplying as a mentee does not guarantee you a spot in the program, and eligibility will be evaluated based on criteria above.\nIf youve participated in a previous GitLab mentor program, you are welcome to apply again!\nFAQ\nCan I participate as both a mentor and a mentee?\nYes, this is a possibility. Its important that team members talk with their managers to discuss their capacity to participate in both roles in this program. Participation in both roles will require a 2hr commitment per month (two 30 minute sessions as a mentor and two 30 minute sessions as a mentee).\nIts possible that we will have a shortage of mentors and be unable to complete all mentor/mentee pairs. If there is a shortage of mentors and youve applied as both a mentor and a mentee, you will be assigned\nonly\nas a mentor in this program.\nI participated in a past mentorship program at GitLab. Can I still participate in the current iteration?\nYes! Past participants in any mentor program and as either mentees, mentors, or both, are encouraged to apply to participate again.\nId like to participate but I cant commit the entire length of the program. Can I still apply?\nIf you cannot commit to the 5 month program, please consider applying for a future mentorship program at GitLab. Its important that both mentors and mentees are available for the full 5 month program to achieve the best results.\nIm not eligible to be a mentor or a mentee in this program. What are my options for future participation?\nOther mentorship resources at GitLab can be found\nhere in the handbook\n. Team members are always encouraged to build mentor/mentee relationships independently. You can find resources and a list of available mentors in the\nLearning and Development handbook\nResults\n2023\nTotal Participants: 136 team members / 73 mentor/mentee pairs\nIn 2023, mentees and mentors were surveyed using Culture Amp before and after the program to meausre key impacts of their mentorship. The following data outlines the impact that mentorship had on these impacts for mentees and mentors.\nWe used CultureAmp to collect feedback. CultureAmp sorts data as\nfavorable\n,\nneutral\n, and\nunfavorable\nbased on responses. The data below indicates the rating for each question, and the number by which the score changed from pre to post program, if at all.\nMentee Results\nAll mentee impacts trended upwards post program, with the greatest impact being on mentees sense of support network at GitLab. Survey participation went from 91% to 64% pre to post.\nQuestion\nTrend Pre to Post Program\nI know where to find GitLab resources to support my career growth.\nFavorable, +14\nI have a network of support to help me reach my goals at GitLab.\nFavorable, +30\nI have a vision of how Id like to grow over the next 12 months at GitLab.\nFavorable +7\nSummary:\nThe experience of a mentee has an overall favorable rating, and positively impacts mentees knowledge of growth resources, support network, and personal vision.\nMentor Results\nBoth mentor impacts trended sligntly downward. Survey participation went from 91% to 67% pre to post.\nQuestion\nTrend Pre to Post Program\nI have relationships with team members outside of my own department.\nFavorable, -2\nI am confident in my ability to support others towards achieving their goals.\nFavorable, -2\nSummary:\nThe experience of a mentor has an overall favorable rating, with negligible impact on mentors relationships outside their department and confidence in supporting others towards their goals.\n2022\nParticipation\nTotal Participants: 120 team members / 63 mentor/mentee pairs\nUnique Departments Represented by Mentees: 21\nUnique Departments Represented by Mentors: 24\nSkills Developed\nSkill development was a key variable used to measure success of this program.\nTop 5 skills developed by Mentors\nSituational Coaching (70.8%)\nListening (66.7%)\nMentorship (58.3)\nAwareness (41.7)\nEmpathy (41.7)\nTop 5 skills developed by Mentees\nCommunication (71.4%)\nSelf-Promotion (57.1%)\nLeadership (52.4%)\nGoal Setting (47.6%)\nSelf-Value (47.6)\nFeedback\n84% of mentors agree the program strengthened their\nleadership skills.\n91.7% of mentors agree the program strengthened their\ncoaching skills.\n100% of mentors agree they had the time, resources, and support needed to be a great mentor, would serve as a mentor in a future program, and would suggest the program to their colleagues.\n95.3% of mentees agree that their mentorship contributed to the achievement of their career and development goals at GitLab.\n95.2% of mentees agree that their mentorship contributed to the achievement of their business goals in FY23 Q1 and/or FY23 Q2 at GitLab.\n95.2% of mentees agree that this program strengthened their self-confidence.\n100% of mentees would suggest other GitLab team members join this program as a mentee.\nI am grateful the company has invested in the Women in GitLab mentorship program. My mentor and I had both a very structured approach to our relationship, but then also took the time to get to know each other and build trust, which allowed for open and honest discussions. I would recommend other team members showing up for this program, both on the mentor and mentee side!\nHaving someone that is not my manager to work through developmental goals has been extraordinary and I am grateful to my mentor for all the feedback and support as I went from feeling heavy with imposter syndrome to believing in myself and my knowledge level!\nWomen at GitLan Mentorship Program has been a crucial experience for me. My mentor is an outstanding leader who supported me in most useful ways, strengthening especially my self-value and goal-setting skills. She sought out opportunities for me, asked good questions and listened intently - all that has already helped with furthering my career development here at GitLab. Im grateful to her and for that program, and I recommend it greatly.\nThe Women at GitLab Mentorship program gave me the opportunity to grow as a mentor by providing resources on how to better my listening and guidance skills so that I could better mentor across disciplines.\nThe GitLab mentorship program is an incredible opportunity to step out of your usual role and look at your management style from a more holistic perspective, taking a moment to get out of the weeds and look more at the big picture. I learned so much from my mentee! I took these learnings back to my team, in terms of my management style. It also gave me time to recognize the strengths of my team in terms of how we present large initiatives to a boarder audience as this was an ask of my mentee and something we worked on together.\n2021\nParticipation\nTotal Participants: 66 team members / 33 mentor/mentee pairs\nUnique Departments Represented by Mentees: 19\nUnique Departments Represented by Mentors: 18\nKick-off session recordings:\nSession 3:\nWatch\nsession 1\nand\nsession 2\non the GitLab Unfiltered YouTube channel.\nSkills Developed\nSkill development was a key variable used to measure success of this program.\nTop 5 skills developed by Mentors\nSituational coaching (73.9%)\nMentorship (52.2%)\nListening (47.8%)\nCoaching (43.5%)\nCommunication (34.8%)\nTop 5 skills developed by Mentees\nCommunication (78.9%)\nConfidence (63.2%)\nStrategy and idea pitching (36.8%)\nSelf-promotion (36.8%)\nSelf-value (31.6%)\nFeedback\n84.3% of mentees plan to continue meeting with their mentor\n55% of mentees want to participate as mentors in future iterations of this program\n91.3% of mentors had the time, resources, and support to be a great mentor\n86.9% thought their mentee was a good fit based on their career history and expertise\nLast modified October 21, 2025:\nLevelUp Platform Transition: Removing and Updating Handbook Links (\nc320a1b0\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/company/culture/inclusion/tmrg-gitlab-women/mentorship-program/",
    "title": "The GitLab Mentorship Program hosted by the Women TMRG | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:50:46.962460",
    "content_length": 13888,
    "section": "handbook"
  },
  "processing": {
    "original_length": 13888,
    "cleaned_length": 13869,
    "cleaned_at": "2025-10-27T16:13:42.410968",
    "processor": "text_cleaner_v1",
    "word_count": 2265
  }
}