{
  "title": "CI/CD UX Meeting - 2024-01-17",
  "video_id": "Bti1O3n2VNE",
  "url": "https://www.youtube.com/watch?v=Bti1O3n2VNE",
  "transcript": " Okay. Hi everyone. This is the ICD-WaxMeT 2024 January 17. Let's see. We'll start from the top. I actually have to move my point to the bottom because that's a question for here. I think we start with the Sommigina. Thank you. Thank you. I have a few updates. One is that I'm almost done with the competitive evaluation for fleet visibility and I did link the issue which has the FIGJM file in it. It is actually very eye-opening to see what the other products are doing. I won't mention their names but if you're interested take a look or just wait for me to post the summary. It's probably going to be faster if you just wait. And then a couple of other things that are coming up I wanted to get some eyes on to see if anyone has worked on something similar. One of them is that for the fleet dashboard we're going to be adding a filter to filter by tags and it's going to be a global filter for the dashboard so it will filter all panels in that dashboard. If anybody has worked on something similar I just I would appreciate your feedback on the placement of the filter there and if it's clear. And then the other issue is a CSV export for time period. So we have in the fleet dashboard one of the panels is allows you to export the usage information as a CSV report and then from there people usually take that and like create internal dashboards or filter using whatever other tool that they're excel or something like that. And now we want to allow them to choose the time period rather than just by default being previous month. So I'm going to be working on that in this coming milestone and that's more of just sharing for awareness. Yeah. If Tina. Oh good. Now I was going to talk about the the filter one the filter placement. I'm trying to find the information in my brain but I think when when we work on what's an environment dashboard was yes environment dashboard. I think so. Wait, it's just too many features. There is I think it's better if I just write because I need to put an information in my brain but I do have some feedback about this and also just some solution validation that was done before. My question here is you have the filter that drop down component. Yeah. Do you think in the future you're going to have more elements there in UI that the user can interact with? If we do it would only be one more and it would be this time you could filter by some type of time period. Those would be the only two that would be able to impact every single data point on the dashboard. And then have you played around have you experimented with the that filter bar right the search bar where you have like the tokens of chips like what we have in merger quest the issues view. And if so why was the the drop down the option that you sorry everybody it's like dinner time I've been sitting for the computer for too many hours I'm like I'm no idea of course I need to find out but anyways why what this instead of the missh good the bar. Yeah so we use the filter bar on the runner's list view like the typical view that you come into if you go to the runner's page and we receive feedback that the experience filtering there isn't ideal because with tags specifically with tags every single time you go into that bar you have to add another tag. You have to say filter by tag add the tag and then say filter by tag add the tag and there's typically a lot of like there's pretty common sets of tags so by allowing them to see that in a drop down I don't know if I added a search bar in the this the menu. Yeah so you could search for that tag and kind of like stay in one place and do it all at once. And then we just found we've also heard that it's not as discoverable when it's in the filter component because you don't know what filters are available to you so I'm starting I haven't really edited what that page is going to look like in the future but at some point we will improve the filtering for that list view. I don't know when it will be. Yeah got it thanks for the text or the insights. Yeah I agree makes sense like you don't know what you can filter by right. We'll read that filter the search bar. Yeah. How about you also like show pills like below this mentioning all the tags that are selected because it's not a crowded space you have space yeah because I mean this is the only thing that's been filtered by and you just not being able to see all the tags which are selected I would say that is problematic to click on the drop down and then get an idea about what this filter is all about. True that's a great point. I initially wasn't planning on showing them all but I think I could play around with just showing like the chips like the actual labels underneath. Yeah I think that's a great addition as feedback to come and then I also have just really really minor feedback. I just like I like that you're starting to playing around with the drop down because I also could hear from you that the concern of using the current filtering bar patterns. It's drop get lab and then I know that we have a little bit of minor usability issue on that so I could totally get it but I think my my problem when I saw the design was like because I didn't think that the drop down is connected to the whole page so maybe you could consider I don't know I'm just thinking out loud maybe adding a small borderline below the drop down so make more visual hierarchy there would be helpful. Yeah that's a good idea I've also noticed a lot of other filter like when you use the filter component there's a gray background. Yes I could try that out too. Yeah maybe that'll help like I guess but I need I need to see but you can definitely play around with it. Okay yeah thanks for the feedback and then the one minor thing I wanted to say is I'd be curious if people would clue into that being a filter more if it was on the right side over the left because I feel like filter and sorting places and get lab always seem to be on the right and I'm wondering if that would make it more clear or not. Okay I'll try I'll try that too. I wasn't planning on putting this through solution validation but now that we're talking about all the feedback I'm wondering if maybe I should just do a quick on on lottery to test. I don't know yeah like I don't really know if I want to do that. Yeah I think I just think if you have something coming up like any research that you have coming up you can just like plug this question in. Yeah because you implementing the very first version will not be problematic but later for making improvement plug this question into any research that is already scheduled you don't have to do something like dedicated to this. Yeah that's a good idea okay. Right. Okay well thanks for all the feedback on the spot I appreciate it. I will give it to Emily now. So I only have one announcement since I spent last week watching all the unmotorated interviews what we've closed off the Kubernetes dashboard views with our improved preview that we were testing. We found out that users really liked it they were able to troubleshoot essentially like the pod area a lot better than they were before using the single stats. So it's a great addition to the cluster UI and the next steps are actually to work on moving this UI under the environment details page because we tested this on the environment list page but we know we're running out of kind of space that page has a lot of problems with things loading and adding a big tree on that page is definitely not something we want to do so we want to test out moving this over and then also crafting up a more complex version of the tree just to see how it scales but overall went really well and I wanted to give a big thanks to Will who recommended this unmotorated test. We were able to complete the study over a holiday period which I know is usually a slow period for user testing and we weren't initially accepting to close this off in 168 but we did so thanks again Will for the recommendation for this. Yeah thanks Emily and I did want to add here that you know I think this overall process was really valuable to go through because as I wrote the doc we were originally planning to develop a whole other page so we were going to have to like go through foundations a team to try to get approval I think Sengen is probably really familiar with with this process based on everything that happened last year but through like Emily's design process and like collaboration with the PM Victor we ended up deciding like let's just keep it on the environment's page instead of like having another page that we you know have to like surface to users so overall great work. If no one has any questions about this I can pass it over to Vittka. Thanks Emily I was looking for the link to your design that I got lost in the submission validation issue. Let me post link to the Figma actually because there's a tiny Figma links lost in the issue but I think it'll probably be easier if I just link directly. I mean without looking at the design I would just share why I was looking for it because you mentioned a good point like overloading a page is definitely not a good idea but I was looking to understand if there is a possibility to provide a toggle between two views. Yeah well that's actually what we're looking to do in the details page like a between two views or two views you can access. The problem with the list page right now is it has already so much information that I think adding more information into it. Yeah me too. It's the tab will overlap the page. Right. I just saw the tree view design also and I think it looks really it reminds me a little bit of the pipeline view like the I don't know what we call that tree. Yeah it looks like a tree graph. Yeah the graph I guess. I think it just looks very GitLab. GitLab I thought you did. That was my first reaction that this looks like a graph from GitLab. Yeah. I used inspiration from that pipeline jobs graph actually because it's the only one in GitLab. I knew that kind of related so I was like I'm going to just use that as inspiration and see if I can work this tree into that design. So there's still a few small UX issues like I think we have to clarify the arrows a bit more but yeah overall starting from there I think was a really good starting point. Thank you everyone. Yeah coming to my point so Miria and I are able to make big changes to the variables management experience. I know that we are still calling it beautiful fine of our UI but we ended up like also doing some back-end work that was long pending which was around adding descriptions for variables so that it's easier for someone to you know find a variable that they're looking for because they might be one with similar like a bunch of variables with kind of similar names that sometimes users create and it's very difficult to understand it is through a glimpse that which one was meant for what and why they were created. So I thought it's going to be easier but that's just one and we have made improvements with validations added a lot of them. We have improved almost like a bunch of help texts and changed the nature the behavior of the input boxes made the draw more pajamas compatible and also like contributed to the guidelines for our draws in pajamas as a part of this overall this was I think a very successful one and we enjoyed a lot so expect a blog from both of us coming soon. The next one that I'm looking at right now is most research I know that I've been talking about it since a very long time but it was really difficult to get people to speak with but I'm just very happy that finally we do have people and this is for the first time and I would say ever that we have so many people who are willing to share that feedback about most trains. I'll be concluding this research this week and posting the analysis next week or like mid of next week and I have a lot of insights that are valid for very different teams so just stay tuned and that's all. I can take over and then just waste a bunnies note here she's not attending. I think most of you have seen that you shared the job token design right in the CICD UX and oh sorry this is the configured job token at the group level yes that's exactly the one. So if you haven't had a chance to provide her feedback please leave a comment I reviewed a design I was just dropping a couple of comments here I'm actually impressed that you know that she managed to use the design patterns and the whites it's really polished I think there are a couple of things that we can provide feedback on especially on right there's already discussion on wording and then small interactions but overall it's really nice to see her first prototypes her first design issue out there in the wild so good job funny and I also think we did that for supporting her that's her own body buddy. She made that up ahead though. I mean the way she like explored although different use cases for this feature and went into the real depth something that we missed the very first time when this this feature was being built on at Project Label and we kind of built upon it over time but looking at how she made all those considerations before her very very very first draft it was really commendable so yeah I appreciate our work on this yeah really cool I'm going to leave a comment here in the document but also in Asia for her I think a good next step is to you know move that acceptance criteria and the comments that she's leaving in the designs area to the issue description because right about the behavior about the rules anyways just the overall functionality it's good to have that in the issue description but if you haven't had a chance yet to review it please hope support for me and as you also post some questions and scenarios about the CI job token work it's in I think this is the validation issue yes this is the solution validation issue I think you had a chance already right we to work with her on this one right yeah they know specifically what questions she still has open but now I think Marcel and I we answered most of the questions almost all in fact I invited Marcel because I did not want this to be heavy on my perspective I just wanted someone to challenge what I had written and yeah I think she has all the answers but still if somebody feels differently I would really welcome you to post your answers here awesome and buddy let us know because you'll probably watch this later on um and then there's two more point two additional points here she's also mentioning the next steps for that CI job token is to create a validation plan and start from the clean the validation so she can refer to Emily's work for dashboard on this one so Emily do you want me to voice a comment you want to comment I never know how to do yes um it was just if funny um needed any context or feedback around the solution validation that I just did feel free to reach out and I can chat about it a little bit more and I just have an if I know not really it's just a comment to tell her that she should create the recruitment issues soon because it's not easy and get in touch with Erica so is it Erica or will supporting the biopin security team it's Erica right it's Erica yeah yeah it's very fine oh yes and she also worked on the scorecard and she apparently everyone had a chance to see that and of course her has picked up one of the suggestions of her recommendation that she's uh that she documented and there's already a merger quest so also good to see right that uh uh momentum and the engagement also for customers for the community on the work that she's doing so overall what it has been busy she hasn't had the chance to join this class but it's nice that she's also able to update us here about for work so so um and then if you don't have any questions I'll pass it over to the subject thanks Hayana so I have two items so the first one is about the think fixation that we did last week so it was really great we didn't chat about any design relevant elements because it was intended to just become a more of a technical discussion was full of discussion around how to use API should we change architecture but I think it was great that I could hear a lot of from back on engineering perspective as well around this project so okay um so it was really cool and we wanted to make sure that we were aligned on this in terms of the project planning perspective so we're working on the proposal from the back end architecture like planning so Fabio is working on and then we're also discussing shortly after the call and then we're keep discussing around this so the long story short what we're discussing at the moment is like how do the CICD catalog would like to become is it like GitLab catalog that includes a lot of different elements inside one catalog or do we want to speak to become a GitLab CICD catalog that includes CICD components with CICD steps CICD template type of component so it's more of a discussion for the future vision and I'm happy that like we're discussing this so that we can make a proper design and product planning so that we can work on working towards the roadmap and make sure we are aligned on the same goal so it went pretty well in my opinion and based on this we so it's only the empty issue so far but dove and I started to think about like we should validate if this vision really makes sense or not so today I just really quickly created an issue that the research issue is self is empty for now but I would probably need some of your feedback because we wanted to take this opportunity to test things out that is not exist in the market as well as it's not part of the product but we wanted to make sure if it is really aligning with the user's needs or not so it's that and my second item is also more of an FYI that I also went through the solution validation it was during the holiday season and it was a moderated test so it went fairly like well and the good thing is so we wanted to test out the different visual by representing the component so currently if you check the CIC decadal it shows one project in a row but we are asking ourselves like is it better to show the component inside the project so seems like it was well but I I plug in one unrelated question to this research that how would you filter and find the components that are created by your colleagues to test out the filtering experience and actually we got a lot of constructive feedback on this so we need more immediate action item so yeah it was a good test and thanks Eric Kai if you're listening to this call for helping out planning the research issue so yeah if you're interested in let me know if you have better idea on how we are going to improve the filtering experience I think it would be a whole topic that I may want to share in the CIC decadal UX review meeting at some point any questions in fast if not all I don't have a question you mentioned that you would want some help like some feedback but where do we go to provide that I don't have a really well described issue but I had created one empty issue so I'm going to link it here where is the tab sorry too many meetings today so thanks Phil um okay so this is the issue that I'm going to work on in the next one or three milestone and I want to really revamp the whole filtering experience for example one question do we need a tab here and the second question like how does this filtering tap with the search full working well together and I'm pretty much concerned about using this pattern so I'm happy to explore alternative UI for this okay thanks for asking so moving over to Hianna yes so switchboard updates you see hi and the update I want to give to the team is that we may sort of change this to the role requirements that you can find in the CIC off issue but also they'll review with you because most of you are part of the interview team right so the big change is that we are only interviewing and we're going to be hiring intermediate product designer so when assessing right when interviewing the candidates and also fill in the scorecard please keep in mind that we are moving them to the pipeline into the interview process considering them intermediate designers and also make some updates in the switch the priority of some of the skills both the soft skills and hard skills for this role so as you can see here top three to five top three and five three to five anyway top five sorry skills is foundational research I think for switchboard there's a lot of heavy lifting that needs to be done and a product designer we experience in research it's really important they need to be very strong collaborators with you know B.M. engineering auto designers mainly looking for some of the HES work with a design team before or at least you know had some pair designers we have interview designers that they were like design team of one they were the only first designer in you know a startup etc I think that especially for if you think of where switchboard is right now where we are getting started with a lot of the core functionality a core of the user experience someone that has you know a bit the more of experience in collaborating with other designers to get the understanding the insights all how to use design system that they are used to you know just figuring things out with the team I think that's essential if they are not already technical they are interested in HTML and CSS so I'm sure if in your score cards your interviews you talk about that about those skills but I would like them to at least be you know proficient in basic HTML and CSS that means that they are going to have a better understanding of design interactions that they will be able to communicate with the front-end engineers right about the components that when we review merge quests they will just be able to jump in and do the work that they see done and I already mentioned reusability interactions as with the design system and experience working on complex products before I was really looking for someone that had a dev tools experience that's always tricky because get lab with such a specific work that you all do here so complex products that can be like working banking you know in compliance anything that really requires them to dig into this messy hairy problems and show that they can apply design inspiration to you know proposal solution that they can use research skills that they can collaborate with their teams anyways involve engineering in their design process so and I'm not sure that's what I'm looking for and the nice to have skills technical skills in general right that could be like anything outside the scope of HTML and CSS as I mentioned really nice if they have dev tool dev tooling experience maybe they're a user of get lab maybe they I don't know they're coming from one of our competitors and also onboarding platform workflows or admin platforms experience that's also nice to have I think before one of my mandatory skills was that they had experience in onboarding design right but very tricky to find and combine all of that I think it's we made some tweaks there to make sure that we are not finding the right candidates on paper but that you know we find the right person for this job and that for the things that they they need to improve this because they need to improve that we create the opportunities for them to gain those skills what changes I think to you mainly is you know only intermediate so if you think someone is at the intermediate level but they're like I don't know early intermediate or I don't know a very strong intermediate I'll like it to highlight that in your notes and also when I say intermediate it's like a get lab intermediate right because a lot of the candidates that we interviewed recently especially end of last year we showed like two weeks ago they had a title senior but they were like not get lab seniors right so it's difficult to not difficult but we have to kind of set that expectation with the candidates so I'll pause now see if you have any questions and if any of these made sense so yeah they can align the expectations for the upcoming interviews I just have one question I really haven't been getting any interviews for this role so I wasn't sure if that was something was missing there or I wasn't sure yeah that has been the challenge and it's also why we're making these changes to the the requirements I've interviewed only I don't know maybe a six eight candidates in the in the last four months that's not a lot right because initially the the candidates that were being as green and they were qualified they were and that's going to answer to those questions too expensive or there were two senior right they were they were good designers but switchboard is an area that if if we put someone that is two senior they're going to finish the work like in a year and then what we cannot risk like getting someone put someone there so that's to be borrower right it's a problem area where the designers design and they need to have room for growth right they need to be able to learn also on the fly for example have experiencing research but have never worked with a research team so they're going to collaborate with will right you're going to learn something so yes for this this role we haven't had so many interviews we had candidates that were screened and were qualified and they moved to the team interviews I think VTK maybe Sanger interview a few then but then rejected after after a couple of interviews well answer to a very short question but that's very much it yeah I think you you kind of answered my first question so I did add a like another question like since finally you've done you know you mentioned six to eight different interviews with some like more senior candidates are there any concerns that like intermediate candidates will still be able to match up well with what you're looking for for those top three to five mandatory skills yeah I think so and that's the assessment we've made after having these interviews right and after also looking at the bulk of applications that we had right I'm sure if I remember at some point I mentioned like I'm reviewing a thousand applications because a lot of people are applying and as I mentioned they are seniors with they're like not good lab senior you'll have the experience working complex uh uh products uh that we need or understanding uh research methodology et cetera et cetera um I do think we'll find an intermediate candidate uh at this level because farm member correctly like Gina both Gina and Lee and Sujong right you the three of you join as that intermediate level right but you all came with a very strong baggage very strong experience in very specific things right and another thing we have to look at is that this team you're all seniors right so looking at the business uh when we hire yet another senior in this team right there's only gonna be so many staff and with and manager opportunities in the company so we also need to think about that right the career path and development and room for growth for a new person in the team so that's related to the point I mentioned about you know composition expectations for people there to senior depending on location factors but also budgeting and uh uh career progression in the edis role that is a two question or a will yeah thanks for to go through that or me yeah of course um and the question is um should we have a question? yeah sorry this is a little bit out of scope and if it's something that we can't talk about in the recording also I'm fine with that but as you mentioned that there's a lot of seniors on our team and that there's you know not every the growth opportunities are only going to be there if there's like a certain amount of openings and etc um are there any is there any work going on to maybe change up our um I don't know what the word is but basically like the growth opportunities for product designers because right now like you're saying you're senior and then you're either staff or manager is there going to be like other opportunities in between that? yes I think we have I'm not sure if the merger question was merged I don't think so but I know that Valerie and and Peter they were working on the principal product designer which is staff plus right similar to what engineering and also product has that's something uh that Christie was also working on because we need to make sure it's right that let's say after I mean after you get promoted for example to senior product product design manager you could become a director but then what's in between right it's a limbo that uh that we need anyway just this will clarify and I know that this is part of the discussions um that leadership had at least you know last year I'm not sure yet when this will become a let's say something that is in the handbook right of a a job um because we also need to have the business need for that right so we didn't have staff designers in the past right we also didn't have senior design managers so as we grow we also have to make sure that we are not only adding people they are too senior because that also means we might lose them right at some point so that's all part of the changes for this particular role uh and also mainly because I think switchboard is complex but it's not as large as for example verifying right uh where yeah you have a very well-established uh set of functionality that yeah that will require expertise that requires a more senior designer um so yes answer your question but I don't know what okay thank you thank you thank you for your questions by the way and I know that we are at almost a time so I'm just going to drop my question here uh I discuss this with some of you already but um I want to see if you all can help me I have uh to this umbrella to switch board by the way but I have to complete a UX scorecard as part of a Q4 okay R um that will require me to validate a job to be done right to run a scorecard and a job to be done for a product area outside of CITD outside of switchboard I can pick anything but I want to pick something that relates to well verify and release right um sorry verify environments it's and I remember that that changed and my question to you is uh do you have any suggestions do any recommendations on a cross stage job to be done that makes sense uh to be used for a scorecard that can help us you know experiment or at least assess the the that user experience um thinking that the recommendations will be beneficial to your product areas that makes sense it's late but what do you think? I have the same suggestion here that I shared with you and everyone on one uh you help me like come up with this I discuss with the designer with the other team uh of the other team which is go to view and that's how like I farm this for uh testing the usability of uh merging experience which is a very wide experience and I can totally give you the highlights the tags from the update that validated this uh I would just need some time maybe tomorrow thanks me appreciate it um I was thinking I'm not sure uh yeah I didn't discuss this with you Sunjim we didn't have time today but I was thinking of a running a job to be done a drain scorecard also for one of the jobs to be done in create but related to the pipeline like the editor experience right either the code suggestions or um using I don't know VS code whatever using extensions because I think that could be interesting to you but they don't have jobs to be done for that for the category um so yeah that that's the type of thing I'm uh I'm looking for um so I'm thinking secure could be cool I think that could overlap with verify just thinking about like security widget vulnerabilities that all connects back to like commits and pipelines yeah that also makes sense because I think one of the uh is that you will or is the Erica that it's Erica that was working on um a study for I think C.I. I think you see I adoption and something that about that related relates to security compliance workflows um yeah it's definitely Erica it's Erica right yeah okay anyway I forgot that we still have wheels uh part of the agenda so I'll just for now unless will you want to uh yeah voice a comment here yeah I saw that you added the link to the jazz to be done yellow file so I was just kind of like scrolling through it um and I came across this one it looks like it hasn't been validated but it touches it's technically under distribution so that's involved with like actually installing get it lab um and then it touches on Kubernetes which is covered by the environments team so it looks like there's a couple different like stages involved so I don't know that might be another area to consider but unlike the one that Vita had shared I don't know if this is like it's got the evidence behind it as much as hers does yeah thanks Will I link here the the this job to be done the file yeah I'll do some digging think there's uh there must be some additional information in the uh direction pages or these categories this area but appreciate the feedback um and then over to you Will yeah I don't really have a whole lot of updates I did want to just add to what Emily said earlier about her solution validation study that I think she did a great job collaborating with Victor and myself on this work and she was extremely efficient getting everything done especially around the holidays um and she also did a great job like running the study in user testing and then providing us with updates on like each participant asking me for feedback on like whether she needed to like you know reject certain participants and kind of get new ones in get higher quality feedback and then she also consolidated all of those individual sessions until I get overall summary which was really detailed and and also to see but that's kind of it for me thank you Will and Emily thanks for the shout out thanks everyone yeah I never worked so I mean we want the never when we wanted to or never we want to it's gonna be for ever on the internet so okay thanks everyone for joining me and for seeing a little bit of time hope you enjoyed rest of the day and I'll see you later bye",
  "segments": [
    {
      "id": 0,
      "seek": 0,
      "start": 0.0,
      "end": 239.32000000000002,
      "text": ". Hi everyone. This is the ICD-WaxMeT 2O24 January l7. . We'll start from the top. I have to move my point to the bottom because that's a question for here. I think we start with the Sommigina. Thank you. Thank you. I have a few updates. One is that I'm almost done with the competitive evaluation for fleet visibility and I did link the issue which has the FIGJM file in it. It is very eye-opening to see what the other products are doing. I won't mention their names but if you're interested take a look or just wait for me to post the summary. It's probably be faster if you just wait. And then a couple of other things that are coming up I wanted to get some eyes on to see if anyone has worked on something similar. One of them is that for the fleet dashboard be adding a filter to filter by tags and it's be a global filter for the dashboard it will filter all panels in that dashboard. If anybody has worked on something similar I just I would appreciate your feedback on the placement of the filter there and if it's clear. And then the other issue is a CSV export for time period. we have in the fleet dashboard one of the panels is allows you to export the usage information as a CSV report and then from there people usually take that and create internal dashboards or filter using whatever other tool that they're excel or something that. And now we want to allow them to choose the time period rather than just by default being previous month. be working on that in this coming milestone and that's more of just sharing for awareness. Yeah. If Tina. Oh good. Now I was talk about the the filter one the filter placement. I'm trying to find the information in my brain but I think when when we work on what's an environment dashboard was yes environment dashboard. I think . Wait, it's just too many features. There is I think it's better if I just write because I need to put an information in my brain but I do have some feedback about this and also just some solution validation that was done before. My question here is you have the filter that drop down component. Yeah. Do you think in the future you're have more elements there in UI that the user can interact with? If we do it would only be one more and it would be this time you could filter by some type of time period. Those would be the only two that would be able to impact every single data point on the dashboard. And then have you played around have you experimented with the that filter bar the search bar where you have the tokens of chips what we have in merger quest the issues view. And if why was the the drop down",
      "tokens": [
        50364,
        1033,
        13,
        2421,
        1518,
        13,
        639,
        307,
        264,
        14360,
        35,
        12,
        54,
        2797,
        12671,
        51,
        45237,
        7061,
        3282,
        13,
        961,
        311,
        536,
        13,
        492,
        603,
        722,
        490,
        264,
        51078
      ],
      "temperature": 0.0,
      "avg_logprob": -0.5178947448730469,
      "compression_ratio": 1.2108843537414966,
      "no_speech_prob": 0.1175217255949974
    },
    {
      "id": 29,
      "seek": 22252,
      "start": 242.84,
      "end": 536.5999999999999,
      "text": "the option that you sorry everybody it's dinner time I've been sitting for the computer for too many hours I'm I'm no idea of course I need to find out but why what this instead of the missh good the bar. Yeah we use the filter bar on the runner's list view the typical view that you come into if you go to the runner's page and we receive feedback that the experience filtering there isn't ideal because with tags specifically with tags every single time you go into that bar you have to add another tag. You have to say filter by tag add the tag and then say filter by tag add the tag and there's typically a lot of there's pretty common sets of tags by allowing them to see that in a drop down I don't know if I added a search bar in the this the menu. Yeah you could search for that tag and stay in one place and do it all at once. And then we just found we've also heard that it's not as discoverable when it's in the filter component because you don't know what filters are available to you I'm starting I haven't really edited what that page is look in the future but at some point we will improve the filtering for that list view. I don't know when it will be. Yeah got it thanks for the text or the insights. Yeah I agree makes sense you don't know what you can filter by . We'll read that filter the search bar. Yeah. How about you also show pills below this mentioning all the tags that are selected because it's not a crowded space you have space yeah because this is the only thing that's been filtered by and you just not being able to see all the tags which are selected I would say that is problematic to click on the drop down and then get an idea about what this filter is all about. True that's a great point. I initially wasn't planning on showing them all but I think I could play around with just showing the chips the actual labels underneath. Yeah I think that's a great addition as feedback to come and then I also have just really really minor feedback. I just I that you're starting to playing around with the drop down because I also could hear from you that the concern of using the current filtering bar patterns. It's drop get lab and then I know that we have a little bit of minor usability issue on that I could totally get it but I think my my problem when I saw the design was because I didn't think that the drop down is connected to the whole page maybe you could consider I don't know I'm just thinking out loud maybe adding a small borderline below the drop down make more visual hierarchy there would be helpful. Yeah that's a good idea I've also noticed a lot of other filter when you use the filter component there's a gray background. Yes I could try that out too. Yeah maybe that'll help but I need I need to see but you can definitely play around with it. yeah thanks for the feedback and then the one minor thing I wanted to say is I'd be curious if people would clue into that being a filter more if it was on the side over the left because I feel filter and sorting places and get lab always seem to be on the and I'm wondering if that would make it more clear or not. I'll try I'll try that too. I wasn't planning on putting this through solution validation but now that we're talking about all the feedback I'm wondering if maybe I should just do a quick on on lottery to test. I don't know yeah I don't really know if I want to do that. Yeah I think I just think if you have something coming up any research that you have coming up you can just plug this question in. Yeah because you implementing the very first version will not be problematic but later for making improvement plug this question into any research that is already scheduled you don't have to do something dedicated to this. Yeah that's a good idea .",
      "tokens": [
        51380,
        264,
        3614,
        300,
        291,
        2597,
        2201,
        309,
        311,
        411,
        6148,
        565,
        286,
        600,
        668,
        3798,
        337,
        264,
        3820,
        337,
        51672
      ],
      "temperature": 0.0,
      "avg_logprob": -0.253604461897665,
      "compression_ratio": 1.5543478260869565,
      "no_speech_prob": 0.0007814232958480716
    },
    {
      "id": 71,
      "seek": 53180,
      "start": 540.04,
      "end": 549.88,
      "text": ". thanks for all the feedback on the spot I appreciate it. I will give it to Emily now.",
      "tokens": [
        50776,
        1779,
        13,
        1033,
        731,
        3231,
        337,
        439,
        264,
        5824,
        322,
        264,
        4008,
        286,
        4449,
        309,
        13,
        286,
        486,
        976,
        309,
        281,
        15034,
        586,
        13,
        51268
      ],
      "temperature": 0.0,
      "avg_logprob": -0.24747868438265216,
      "compression_ratio": 1.46448087431694,
      "no_speech_prob": 0.0008736278396099806
    },
    {
      "id": 72,
      "seek": 53180,
      "start": 552.12,
      "end": 742.0400000000001,
      "text": "I only have one announcement since I spent last week watching all the unmotorated interviews what we've closed off the Kubernetes dashboard views with our improved preview that we were testing. We found out that users really liked it they were able to troubleshoot essentially the pod area a lot better than they were before using the single stats. it's a great addition to the cluster UI and the next steps are to work on moving this UI under the environment details page because we tested this on the environment list page but we know we're running out of space that page has a lot of problems with things loading and adding a big tree on that page is definitely not something we want to do we want to test out moving this over and then also crafting up a more complex version of the tree just to see how it scales but overall went really and I wanted to give a big thanks to Will who recommended this unmotorated test. We were able to complete the study over a holiday period which I know is usually a slow period for user testing and we weren't initially accepting to close this off in l68 but we did thanks again Will for the recommendation for this. Yeah thanks Emily and I did want to add here that I think this overall process was really valuable to go through because as I wrote the doc we were originally planning to develop a whole other page we were have to go through foundations a team to try to get approval I think Sengen is probably really familiar with with this process based on everything that happened last year but through Emily's design process and collaboration with the PM Victor we ended up deciding let's just keep it on the environment's page instead of having another page that we have to surface to users overall great work. If no one has any questions about this I can pass it over to Vittka. Thanks Emily I was looking for the link to your design that I got lost in the submission validation issue. post link to the Figma because there's a tiny Figma links lost in the issue but I think it'll probably be easier if I just link directly. without looking at the design I would just share why I was looking for it because you mentioned a good point overloading a page is definitely not a good idea but I was looking to understand if there is a possibility to provide a toggle between two views.",
      "tokens": [
        51380,
        407,
        286,
        787,
        362,
        472,
        12847,
        1670,
        286,
        4418,
        1036,
        1243,
        1976,
        439,
        264,
        19334,
        310,
        284,
        770,
        12318,
        51680
      ],
      "temperature": 0.0,
      "avg_logprob": -0.24747868438265216,
      "compression_ratio": 1.46448087431694,
      "no_speech_prob": 0.0008736278396099806
    },
    {
      "id": 99,
      "seek": 72284,
      "start": 744.6800000000001,
      "end": 765.48,
      "text": "Yeah that's what we're looking to do in the details page a between two views or two views you can access. The problem with the list page now is it has already much information that I think adding more information into it. Yeah me too. It's the tab will overlap the page.",
      "tokens": [
        51456,
        865,
        731,
        300,
        311,
        767,
        437,
        321,
        434,
        1237,
        281,
        360,
        294,
        264,
        4365,
        3028,
        411,
        257,
        51748
      ],
      "temperature": 0.0,
      "avg_logprob": -0.12752605766378422,
      "compression_ratio": 1.6624472573839661,
      "no_speech_prob": 0.0024368606973439455
    },
    {
      "id": 104,
      "seek": 75052,
      "start": 768.68,
      "end": 820.28,
      "text": ". I just saw the tree view design also and I think it looks really it reminds me a little bit of the pipeline view the I don't know what we call that tree. Yeah it looks a tree graph. Yeah the graph . I think it just looks very GitLab. GitLab I thought you did. That was my first reaction that this looks a graph from GitLab. Yeah. I used inspiration from that pipeline jobs graph because it's the only one in GitLab. I knew that related I was just use that as inspiration and see if I can work this tree into that design. there's still a few small UX issues I think we have to clarify the arrows a bit more but yeah overall starting from there I think was a really good starting point.",
      "tokens": [
        51272,
        1779,
        13,
        51312
      ],
      "temperature": 0.0,
      "avg_logprob": -0.3228529088637408,
      "compression_ratio": 1.5748792270531402,
      "no_speech_prob": 0.0005140550783835351
    },
    {
      "id": 118,
      "seek": 80236,
      "start": 824.04,
      "end": 1142.76,
      "text": "Thank you everyone. Yeah coming to my point Miria and I are able to make big changes to the variables management experience. I know that we are still calling it beautiful fine of our UI but we ended up also doing some back-end work that was long pending which was around adding descriptions for variables that it's easier for someone to find a variable that they're looking for because they might be one with similar a bunch of variables with similar names that sometimes users create and it's very difficult to understand it is through a glimpse that which one was meant for what and why they were created. I thought it's be easier but that's just one and we have made improvements with validations added a lot of them. We have improved almost a bunch of help texts and changed the nature the behavior of the input boxes made the draw more pajamas compatible and also contributed to the guidelines for our draws in pajamas as a part of this overall this was I think a very successful one and we enjoyed a lot expect a blog from both of us coming soon. The next one that I'm looking at now is most research I know that I've been talking about it since a very long time but it was really difficult to get people to speak with but I'm just very happy that finally we do have people and this is for the first time and I would say ever that we have many people who are willing to share that feedback about most trains. I'll be concluding this research this week and posting the analysis next week or mid of next week and I have a lot of insights that are valid for very different teams just stay tuned and that's all. I can take over and then just waste a bunnies note here she's not attending. I think most of you have seen that you shared the job token design in the CICD UX and oh sorry this is the configured job token at the group level yes that's exactly the one. if you haven't had a chance to provide her feedback please leave a comment I reviewed a design I was just dropping a couple of comments here I'm impressed that that she managed to use the design patterns and the whites it's really polished I think there are a couple of things that we can provide feedback on especially on there's already discussion on wording and then small interactions but overall it's really nice to see her first prototypes her first design issue out there in the wild good job funny and I also think we did that for supporting her that's her own body buddy. She made that up ahead though. the way she explored although different use cases for this feature and went into the real depth something that we missed the very first time when this this feature was being built on at Project Label and we built upon it over time but looking at how she made all those considerations before her very very very first draft it was really commendable yeah I appreciate our work on this yeah really cool leave a comment here in the document but also in Asia for her I think a good next step is to move that acceptance criteria and the comments that she's leaving in the designs area to the issue description because about the behavior about the rules just the overall functionality it's good to have that in the issue description but if you haven't had a chance yet to review it please hope support for me and as you also post some questions and scenarios about the CI job token work it's in I think this is the validation issue yes this is the solution validation issue I think you had a chance already we to work with her on this one yeah they know specifically what questions she still has open but now I think Marcel and I we answered most of the questions almost all in fact I invited Marcel because I did not want this to be heavy on my perspective I just wanted someone to challenge what I had written and yeah I think she has all the answers but still if somebody feels differently I would really welcome you to post your answers here awesome and buddy let us know because you'll probably watch this later on and then there's two more point two additional points here she's also mentioning the next steps for that CI job token is to create a validation plan and start from the clean the validation she can refer to Emily's work for dashboard on this one",
      "tokens": [
        51448,
        1044,
        291,
        1518,
        13,
        51488
      ],
      "temperature": 0.0,
      "avg_logprob": -0.18422147139762213,
      "compression_ratio": 1.6260162601626016,
      "no_speech_prob": 0.0019374461844563484
    },
    {
      "id": 167,
      "seek": 112652,
      "start": 1146.76,
      "end": 1163.7199999999998,
      "text": "Emily do you want me to voice a comment you want to comment I never know how to do yes it was just if funny needed any context or feedback around the solution validation that I just did feel free to reach out and I can chat about it a little bit more",
      "tokens": [
        51376,
        370,
        15034,
        360,
        291,
        528,
        385,
        281,
        3177,
        257,
        2871,
        291,
        528,
        281,
        2871,
        286,
        1128,
        458,
        577,
        281,
        360,
        2086,
        51656
      ],
      "temperature": 0.0,
      "avg_logprob": -0.3048376860441985,
      "compression_ratio": 1.6666666666666667,
      "no_speech_prob": 0.00535085704177618
    },
    {
      "id": 170,
      "seek": 115236,
      "start": 1170.28,
      "end": 1239.0,
      "text": "and I just have an if I know not really it's just a comment to tell her that she should create the recruitment issues soon because it's not easy and get in touch with Erica is it Erica or will supporting the biopin security team it's Erica it's Erica yeah yeah it's very fine oh yes and she also worked on the scorecard and she apparently everyone had a chance to see that and of course her has picked up one of the suggestions of her recommendation that she's that she documented and there's already a merger quest also good to see that momentum and the engagement also for customers for the community on the work that she's doing overall what it has been busy she hasn't had the chance to join this class but it's nice that she's also able to update us here about for work and then if you don't have any questions I'll pass it over to the subject",
      "tokens": [
        51260,
        293,
        286,
        445,
        362,
        364,
        498,
        286,
        458,
        406,
        534,
        309,
        311,
        445,
        257,
        2871,
        281,
        980,
        720,
        300,
        750,
        820,
        51588
      ],
      "temperature": 0.0,
      "avg_logprob": -0.1740367677476671,
      "compression_ratio": 1.6363636363636365,
      "no_speech_prob": 0.0065568722784519196
    },
    {
      "id": 180,
      "seek": 122948,
      "start": 1243.48,
      "end": 1518.1200000000001,
      "text": "thanks Hayana I have two items the first one is about the think fixation that we did last week it was really great we didn't chat about any design relevant elements because it was intended to just become a more of a technical discussion was full of discussion around how to use API should we change architecture but I think it was great that I could hear a lot of from back on engineering perspective as around this project it was really cool and we wanted to make sure that we were aligned on this in terms of the project planning perspective we're working on the proposal from the back end architecture planning Fabio is working on and then we're also discussing shortly after the call and then we're keep discussing around this the long story short what we're discussing at the moment is how do the CICD catalog would to become is it GitLab catalog that includes a lot of different elements inside one catalog or do we want to speak to become a GitLab CICD catalog that includes CICD components with CICD steps CICD template type of component it's more of a discussion for the future vision and I'm happy that we're discussing this that we can make a proper design and product planning that we can work on working towards the roadmap and make sure we are aligned on the same goal it went pretty in my opinion and based on this we it's only the empty issue far but dove and I started to think about we should validate if this vision really makes sense or not today I just really quickly created an issue that the research issue is self is empty for now but I would probably need some of your feedback because we wanted to take this opportunity to test things out that is not exist in the market as as it's not part of the product but we wanted to make sure if it is really aligning with the user's needs or not it's that and my second item is also more of an FYI that I also went through the solution validation it was during the holiday season and it was a moderated test it went fairly and the good thing is we wanted to test out the different visual by representing the component currently if you check the CIC decadal it shows one project in a row but we are asking ourselves is it better to show the component inside the project seems it was but I I plug in one unrelated question to this research that how would you filter and find the components that are created by your colleagues to test out the filtering experience and we got a lot of constructive feedback on this we need more immediate action item yeah it was a good test and thanks Eric Kai if you're listening to this call for helping out planning the research issue yeah if you're interested in know if you have better idea on how we are improve the filtering experience I think it would be a whole topic that I may want to share in the CIC decadal UX review meeting at some point any questions in fast if not all I don't have a question you mentioned that you would want some help some feedback but where do we go to provide that I don't have a really described issue but I had created one empty issue link it here where is the tab sorry too many meetings today",
      "tokens": [
        51064,
        3231,
        8721,
        2095,
        370,
        286,
        362,
        732,
        4754,
        370,
        264,
        700,
        472,
        307,
        466,
        264,
        519,
        3191,
        399,
        300,
        321,
        630,
        51488
      ],
      "temperature": 0.0,
      "avg_logprob": -0.2925684555717137,
      "compression_ratio": 1.3821138211382114,
      "no_speech_prob": 0.0032784866634756327
    },
    {
      "id": 215,
      "seek": 150724,
      "start": 1521.16,
      "end": 1568.36,
      "text": "thanks Phil this is the issue that work on in the next one or three milestone and I want to really revamp the whole filtering experience for example one question do we need a tab here and the second question how does this filtering tap with the search full working together and I'm pretty much concerned about using this pattern I'm happy to explore alternative UI for this thanks for asking moving over to Hianna",
      "tokens": [
        51060,
        3231,
        7777,
        1105,
        1392,
        370,
        341,
        307,
        264,
        2734,
        300,
        286,
        478,
        516,
        281,
        589,
        322,
        294,
        264,
        958,
        51672
      ],
      "temperature": 0.0,
      "avg_logprob": -0.21645889282226563,
      "compression_ratio": 1.456896551724138,
      "no_speech_prob": 0.0022377411369234324
    },
    {
      "id": 220,
      "seek": 155532,
      "start": 1570.6,
      "end": 2032.28,
      "text": "yes switchboard updates hi and the update I want to give to the team is that we may change this to the role requirements that you can find in the CIC off issue but also they'll review with you because most of you are part of the interview team the big change is that we are only interviewing and be hiring intermediate product designer when assessing when interviewing the candidates and also fill in the scorecard please keep in mind that we are moving them to the pipeline into the interview process considering them intermediate designers and also make some updates in the switch the priority of some of the skills both the soft skills and hard skills for this role as you can see here top three to five top three and five three to five top five sorry skills is foundational research I think for switchboard there's a lot of heavy lifting that needs to be done and a product designer we experience in research it's really important they need to be very strong collaborators with B.M. engineering auto designers mainly looking for some of the HES work with a design team before or at least had some pair designers we have interview designers that they were design team of one they were the only first designer in a startup etc I think that especially for if you think of where switchboard is now where we are getting started with a lot of the core functionality a core of the user experience someone that has a bit the more of experience in collaborating with other designers to get the understanding the insights all how to use design system that they are used to just figuring things out with the team I think that's essential if they are not already technical they are interested in HTML and CSS I'm sure if in your score cards your interviews you talk about that about those skills but I would them to at least be proficient in basic HTML and CSS that means that they are have a better understanding of design interactions that they will be able to communicate with the front-end engineers about the components that when we review merge quests they will just be able to jump in and do the work that they see done and I already mentioned reusability interactions as with the design system and experience working on complex products before I was really looking for someone that had a dev tools experience that's always tricky because get lab with such a specific work that you all do here complex products that can be working banking in compliance anything that really requires them to dig into this messy hairy problems and show that they can apply design inspiration to proposal solution that they can use research skills that they can collaborate with their teams involve engineering in their design process and I'm not sure that's what I'm looking for and the nice to have skills technical skills in general that could be anything outside the scope of HTML and CSS as I mentioned really nice if they have dev tool dev tooling experience maybe they're a user of get lab maybe they I don't know they're coming from one of our competitors and also onboarding platform workflows or admin platforms experience that's also nice to have I think before one of my mandatory skills was that they had experience in onboarding design but very tricky to find and combine all of that I think it's we made some tweaks there to make sure that we are not finding the candidates on paper but that we find the person for this job and that for the things that they they need to improve this because they need to improve that we create the opportunities for them to gain those skills what changes I think to you mainly is only intermediate if you think someone is at the intermediate level but they're I don't know early intermediate or I don't know a very strong intermediate I'll it to highlight that in your notes and also when I say intermediate it's a get lab intermediate because a lot of the candidates that we interviewed recently especially end of last year we showed two weeks ago they had a title senior but they were not get lab seniors it's difficult to not difficult but we have to set that expectation with the candidates I'll pause now see if you have any questions and if any of these made sense yeah they can align the expectations for the upcoming interviews I just have one question I really haven't been getting any interviews for this role I wasn't sure if that was something was missing there or I wasn't sure yeah that has been the challenge and it's also why we're making these changes to the the requirements I've interviewed only I don't know maybe a six eight candidates in the in the last four months that's not a lot because initially the the candidates that were being as green and they were qualified they were and that's answer to those questions too expensive or there were two senior they were they were good designers but switchboard is an area that if if we put someone that is two senior they're finish the work in a year and then what we cannot risk getting someone put someone there that's to be borrower it's a problem area where the designers design and they need to have room for growth they need to be able to learn also on the fly for example have experiencing research but have never worked with a research team they're collaborate with will you're learn something yes for this this role we haven't had many interviews we had candidates that were screened and were qualified and they moved to the team interviews I think VTK maybe Sanger interview a few then but then rejected after after a couple of interviews answer to a very short question but that's very much it",
      "tokens": [
        51128,
        2086,
        370,
        3679,
        3787,
        9205,
        291,
        536,
        4879,
        293,
        264,
        5623,
        286,
        528,
        281,
        976,
        281,
        264,
        1469,
        307,
        300,
        51480
      ],
      "temperature": 0.0,
      "avg_logprob": -0.29208360399518696,
      "compression_ratio": 1.5135135135135136,
      "no_speech_prob": 0.0003338326932862401
    },
    {
      "id": 283,
      "seek": 203620,
      "start": 2036.3600000000001,
      "end": 2422.68,
      "text": "yeah I think you you answered my first question I did add a another question since finally you've done you mentioned six to eight different interviews with some more senior candidates are there any concerns that intermediate candidates will still be able to match up with what you're looking for for those top three to five mandatory skills yeah I think and that's the assessment we've made after having these interviews and after also looking at the bulk of applications that we had I'm sure if I remember at some point I mentioned I'm reviewing a thousand applications because a lot of people are applying and as I mentioned they are seniors with they're not good lab senior you'll have the experience working complex products that we need or understanding research methodology et cetera et cetera I do think we'll find an intermediate candidate at this level because farm member correctly Gina both Gina and Lee and Sujong you the three of you join as that intermediate level but you all came with a very strong baggage very strong experience in very specific things and another thing we have to look at is that this team you're all seniors looking at the business when we hire yet another senior in this team there's only gonna be many staff and with and manager opportunities in the company we also need to think about that the career path and development and room for growth for a new person in the team that's related to the point I mentioned about composition expectations for people there to senior depending on location factors but also budgeting and career progression in the edis role that is a two question or a will yeah thanks for to go through that or me yeah of course and the question is should we have a question? yeah sorry this is a little bit out of scope and if it's something that we can't talk about in the recording also I'm fine with that but as you mentioned that there's a lot of seniors on our team and that there's not every the growth opportunities are only be there if there's a certain amount of openings and etc are there any is there any work going on to maybe change up our I don't know what the word is but the growth opportunities for product designers because now you're saying you're senior and then you're either staff or manager is there be other opportunities in between that? yes I think we have I'm not sure if the merger question was merged I don't think but I know that Valerie and and Peter they were working on the principal product designer which is staff plus similar to what engineering and also product has that's something that Christie was also working on because we need to make sure it's that let's say after after you get promoted for example to senior product product design manager you could become a director but then what's in between it's a limbo that that we need just this will clarify and I know that this is part of the discussions that leadership had at least last year I'm not sure yet when this will become a let's say something that is in the handbook of a a job because we also need to have the business need for that we didn't have staff designers in the past we also didn't have senior design managers as we grow we also have to make sure that we are not only adding people they are too senior because that also means we might lose them at some point that's all part of the changes for this particular role and also mainly because I think switchboard is complex but it's not as large as for example verifying where yeah you have a very -established set of functionality that yeah that will require expertise that requires a more senior designer yes answer your question but I don't know what thank you thank you thank you for your questions by the way and I know that we are at almost a time I'm just drop my question here I discuss this with some of you already but I want to see if you all can help me I have to this umbrella to switch board by the way but I have to complete a UX scorecard as part of a Q4 R that will require me to validate a job to be done to run a scorecard and a job to be done for a product area outside of CITD outside of switchboard I can pick anything but I want to pick something that relates to verify and release sorry verify environments it's and I remember that that changed and my question to you is do you have any suggestions do any recommendations on a cross stage job to be done that makes sense to be used for a scorecard that can help us experiment or at least assess the the that user experience",
      "tokens": [
        50372,
        1338,
        286,
        519,
        291,
        291,
        733,
        295,
        10103,
        452,
        700,
        1168,
        370,
        286,
        630,
        909,
        257,
        411,
        1071,
        1168,
        50900
      ],
      "temperature": 0.0,
      "avg_logprob": -0.1544835226876395,
      "compression_ratio": 1.6176470588235294,
      "no_speech_prob": 0.002386278472840786
    },
    {
      "id": 335,
      "seek": 240604,
      "start": 2425.0,
      "end": 2437.48,
      "text": "thinking that the recommendations will be beneficial to your product areas that makes sense it's late but what do you think?",
      "tokens": [
        51312,
        1953,
        300,
        264,
        10434,
        486,
        312,
        14072,
        281,
        428,
        1674,
        3179,
        51592
      ],
      "temperature": 0.0,
      "avg_logprob": -0.21837594774034289,
      "compression_ratio": 1.5866666666666667,
      "no_speech_prob": 0.0009767457377165556
    },
    {
      "id": 337,
      "seek": 243060,
      "start": 2445.72,
      "end": 2631.48,
      "text": "I have the same suggestion here that I shared with you and everyone on one you help me come up with this I discuss with the designer with the other team of the other team which is go to view and that's how I farm this for testing the usability of merging experience which is a very wide experience and I can totally give you the highlights the tags from the update that validated this I would just need some time maybe tomorrow thanks me appreciate it I was thinking I'm not sure yeah I didn't discuss this with you Sunjim we didn't have time today but I was thinking of a running a job to be done a drain scorecard also for one of the jobs to be done in create but related to the pipeline the editor experience either the code suggestions or using I don't know VS code whatever using extensions because I think that could be interesting to you but they don't have jobs to be done for that for the category yeah that that's the type of thing I'm I'm looking for I'm thinking secure could be cool I think that could overlap with verify just thinking about security widget vulnerabilities that all connects back to commits and pipelines yeah that also makes sense because I think one of the is that you will or is the Erica that it's Erica that was working on a study for I think C.I. I think I adoption and something that about that related relates to security compliance workflows yeah it's definitely Erica it's Erica yeah I forgot that we still have wheels part of the agenda I'll just for now unless will you want to yeah voice a comment here yeah I saw that you added the link to the jazz to be done yellow file I was just scrolling through it and I came across this one it looks it hasn't been validated but it touches it's technically under distribution that's involved with installing get it lab and then it touches on Kubernetes which is covered by the environments team it looks there's a couple different stages involved I don't know that might be another area to consider but unlike the one that Vita had shared I don't know if this is it's got the evidence behind it as much as hers does",
      "tokens": [
        51120,
        286,
        362,
        264,
        912,
        16541,
        510,
        300,
        286,
        5507,
        365,
        291,
        293,
        1518,
        322,
        472,
        2232,
        291,
        854,
        385,
        411,
        51420
      ],
      "temperature": 0.0,
      "avg_logprob": -0.2074938456217448,
      "compression_ratio": 1.610738255033557,
      "no_speech_prob": 0.0024990274105221033
    },
    {
      "id": 362,
      "seek": 262228,
      "start": 2635.2400000000002,
      "end": 2656.4399999999996,
      "text": "yeah thanks Will I link here the the this job to be done the file yeah I'll do some digging think there's there must be some additional information in the direction pages or these categories this area but appreciate the feedback and then over to you Will",
      "tokens": [
        51012,
        1338,
        3231,
        3099,
        286,
        2113,
        510,
        264,
        264,
        341,
        1691,
        281,
        312,
        1096,
        264,
        3991,
        1338,
        286,
        603,
        360,
        512,
        17343,
        51344
      ],
      "temperature": 0.0,
      "avg_logprob": -0.26232329658840015,
      "compression_ratio": 1.5649717514124293,
      "no_speech_prob": 0.001090919366106391
    },
    {
      "id": 365,
      "seek": 264772,
      "start": 2658.68,
      "end": 2715.4,
      "text": "yeah I don't really have a whole lot of updates I did want to just add to what Emily said earlier about her solution validation study that I think she did a great job collaborating with Victor and myself on this work and she was extremely efficient getting everything done especially around the holidays and she also did a great job running the study in user testing and then providing us with updates on each participant asking me for feedback on whether she needed to reject certain participants and get new ones in get higher quality feedback and then she also consolidated all of those individual sessions until I get overall summary which was really detailed and and also to see",
      "tokens": [
        50912,
        1338,
        286,
        500,
        380,
        534,
        362,
        257,
        1379,
        688,
        295,
        9205,
        286,
        630,
        528,
        281,
        445,
        909,
        281,
        437,
        15034,
        848,
        51216
      ],
      "temperature": 0.0,
      "avg_logprob": -0.1674277941385905,
      "compression_ratio": 1.4861878453038675,
      "no_speech_prob": 0.0005191743839532137
    },
    {
      "id": 373,
      "seek": 270060,
      "start": 2721.4,
      "end": 2741.3199999999997,
      "text": "but that's it for me thank you Will and Emily thanks for the shout out thanks everyone yeah I never worked we want the never when we wanted to or never we want to",
      "tokens": [
        51404,
        457,
        300,
        311,
        733,
        295,
        309,
        337,
        385,
        51492
      ],
      "temperature": 0.0,
      "avg_logprob": -0.2522764007250468,
      "compression_ratio": 1.4482758620689655,
      "no_speech_prob": 8.654953126097098e-05
    },
    {
      "id": 376,
      "seek": 272316,
      "start": 2743.7999999999997,
      "end": 2760.84,
      "text": "it's gonna be for ever on the internet thanks everyone for joining me and for seeing a little bit of time hope you enjoyed rest of the day and I'll see you later bye",
      "tokens": [
        51396,
        309,
        311,
        799,
        312,
        337,
        1562,
        322,
        264,
        4705,
        370,
        51500
      ],
      "temperature": 0.0,
      "avg_logprob": -0.3704359436035156,
      "compression_ratio": 1.5317460317460319,
      "no_speech_prob": 0.0025046479422599077
    }
  ],
  "full_text": ". Hi everyone. This is the ICD-WaxMeT 2O24 January l7. . We'll start from the top. I have to move my point to the bottom because that's a question for here. I think we start with the Sommigina. Thank you. Thank you. I have a few updates. One is that I'm almost done with the competitive evaluation for fleet visibility and I did link the issue which has the FIGJM file in it. It is very eye-opening to see what the other products are doing. I won't mention their names but if you're interested take a look or just wait for me to post the summary. It's probably be faster if you just wait. And then a couple of other things that are coming up I wanted to get some eyes on to see if anyone has worked on something similar. One of them is that for the fleet dashboard be adding a filter to filter by tags and it's be a global filter for the dashboard it will filter all panels in that dashboard. If anybody has worked on something similar I just I would appreciate your feedback on the placement of the filter there and if it's clear. And then the other issue is a CSV export for time period. we have in the fleet dashboard one of the panels is allows you to export the usage information as a CSV report and then from there people usually take that and create internal dashboards or filter using whatever other tool that they're excel or something that. And now we want to allow them to choose the time period rather than just by default being previous month. be working on that in this coming milestone and that's more of just sharing for awareness. Yeah. If Tina. Oh good. Now I was talk about the the filter one the filter placement. I'm trying to find the information in my brain but I think when when we work on what's an environment dashboard was yes environment dashboard. I think . Wait, it's just too many features. There is I think it's better if I just write because I need to put an information in my brain but I do have some feedback about this and also just some solution validation that was done before. My question here is you have the filter that drop down component. Yeah. Do you think in the future you're have more elements there in UI that the user can interact with? If we do it would only be one more and it would be this time you could filter by some type of time period. Those would be the only two that would be able to impact every single data point on the dashboard. And then have you played around have you experimented with the that filter bar the search bar where you have the tokens of chips what we have in merger quest the issues view. And if why was the the drop down the option that you sorry everybody it's dinner time I've been sitting for the computer for too many hours I'm I'm no idea of course I need to find out but why what this instead of the missh good the bar. Yeah we use the filter bar on the runner's list view the typical view that you come into if you go to the runner's page and we receive feedback that the experience filtering there isn't ideal because with tags specifically with tags every single time you go into that bar you have to add another tag. You have to say filter by tag add the tag and then say filter by tag add the tag and there's typically a lot of there's pretty common sets of tags by allowing them to see that in a drop down I don't know if I added a search bar in the this the menu. Yeah you could search for that tag and stay in one place and do it all at once. And then we just found we've also heard that it's not as discoverable when it's in the filter component because you don't know what filters are available to you I'm starting I haven't really edited what that page is look in the future but at some point we will improve the filtering for that list view. I don't know when it will be. Yeah got it thanks for the text or the insights. Yeah I agree makes sense you don't know what you can filter by . We'll read that filter the search bar. Yeah. How about you also show pills below this mentioning all the tags that are selected because it's not a crowded space you have space yeah because this is the only thing that's been filtered by and you just not being able to see all the tags which are selected I would say that is problematic to click on the drop down and then get an idea about what this filter is all about. True that's a great point. I initially wasn't planning on showing them all but I think I could play around with just showing the chips the actual labels underneath. Yeah I think that's a great addition as feedback to come and then I also have just really really minor feedback. I just I that you're starting to playing around with the drop down because I also could hear from you that the concern of using the current filtering bar patterns. It's drop get lab and then I know that we have a little bit of minor usability issue on that I could totally get it but I think my my problem when I saw the design was because I didn't think that the drop down is connected to the whole page maybe you could consider I don't know I'm just thinking out loud maybe adding a small borderline below the drop down make more visual hierarchy there would be helpful. Yeah that's a good idea I've also noticed a lot of other filter when you use the filter component there's a gray background. Yes I could try that out too. Yeah maybe that'll help but I need I need to see but you can definitely play around with it. yeah thanks for the feedback and then the one minor thing I wanted to say is I'd be curious if people would clue into that being a filter more if it was on the side over the left because I feel filter and sorting places and get lab always seem to be on the and I'm wondering if that would make it more clear or not. I'll try I'll try that too. I wasn't planning on putting this through solution validation but now that we're talking about all the feedback I'm wondering if maybe I should just do a quick on on lottery to test. I don't know yeah I don't really know if I want to do that. Yeah I think I just think if you have something coming up any research that you have coming up you can just plug this question in. Yeah because you implementing the very first version will not be problematic but later for making improvement plug this question into any research that is already scheduled you don't have to do something dedicated to this. Yeah that's a good idea . . thanks for all the feedback on the spot I appreciate it. I will give it to Emily now. I only have one announcement since I spent last week watching all the unmotorated interviews what we've closed off the Kubernetes dashboard views with our improved preview that we were testing. We found out that users really liked it they were able to troubleshoot essentially the pod area a lot better than they were before using the single stats. it's a great addition to the cluster UI and the next steps are to work on moving this UI under the environment details page because we tested this on the environment list page but we know we're running out of space that page has a lot of problems with things loading and adding a big tree on that page is definitely not something we want to do we want to test out moving this over and then also crafting up a more complex version of the tree just to see how it scales but overall went really and I wanted to give a big thanks to Will who recommended this unmotorated test. We were able to complete the study over a holiday period which I know is usually a slow period for user testing and we weren't initially accepting to close this off in l68 but we did thanks again Will for the recommendation for this. Yeah thanks Emily and I did want to add here that I think this overall process was really valuable to go through because as I wrote the doc we were originally planning to develop a whole other page we were have to go through foundations a team to try to get approval I think Sengen is probably really familiar with with this process based on everything that happened last year but through Emily's design process and collaboration with the PM Victor we ended up deciding let's just keep it on the environment's page instead of having another page that we have to surface to users overall great work. If no one has any questions about this I can pass it over to Vittka. Thanks Emily I was looking for the link to your design that I got lost in the submission validation issue. post link to the Figma because there's a tiny Figma links lost in the issue but I think it'll probably be easier if I just link directly. without looking at the design I would just share why I was looking for it because you mentioned a good point overloading a page is definitely not a good idea but I was looking to understand if there is a possibility to provide a toggle between two views. Yeah that's what we're looking to do in the details page a between two views or two views you can access. The problem with the list page now is it has already much information that I think adding more information into it. Yeah me too. It's the tab will overlap the page. . I just saw the tree view design also and I think it looks really it reminds me a little bit of the pipeline view the I don't know what we call that tree. Yeah it looks a tree graph. Yeah the graph . I think it just looks very GitLab. GitLab I thought you did. That was my first reaction that this looks a graph from GitLab. Yeah. I used inspiration from that pipeline jobs graph because it's the only one in GitLab. I knew that related I was just use that as inspiration and see if I can work this tree into that design. there's still a few small UX issues I think we have to clarify the arrows a bit more but yeah overall starting from there I think was a really good starting point. Thank you everyone. Yeah coming to my point Miria and I are able to make big changes to the variables management experience. I know that we are still calling it beautiful fine of our UI but we ended up also doing some back-end work that was long pending which was around adding descriptions for variables that it's easier for someone to find a variable that they're looking for because they might be one with similar a bunch of variables with similar names that sometimes users create and it's very difficult to understand it is through a glimpse that which one was meant for what and why they were created. I thought it's be easier but that's just one and we have made improvements with validations added a lot of them. We have improved almost a bunch of help texts and changed the nature the behavior of the input boxes made the draw more pajamas compatible and also contributed to the guidelines for our draws in pajamas as a part of this overall this was I think a very successful one and we enjoyed a lot expect a blog from both of us coming soon. The next one that I'm looking at now is most research I know that I've been talking about it since a very long time but it was really difficult to get people to speak with but I'm just very happy that finally we do have people and this is for the first time and I would say ever that we have many people who are willing to share that feedback about most trains. I'll be concluding this research this week and posting the analysis next week or mid of next week and I have a lot of insights that are valid for very different teams just stay tuned and that's all. I can take over and then just waste a bunnies note here she's not attending. I think most of you have seen that you shared the job token design in the CICD UX and oh sorry this is the configured job token at the group level yes that's exactly the one. if you haven't had a chance to provide her feedback please leave a comment I reviewed a design I was just dropping a couple of comments here I'm impressed that that she managed to use the design patterns and the whites it's really polished I think there are a couple of things that we can provide feedback on especially on there's already discussion on wording and then small interactions but overall it's really nice to see her first prototypes her first design issue out there in the wild good job funny and I also think we did that for supporting her that's her own body buddy. She made that up ahead though. the way she explored although different use cases for this feature and went into the real depth something that we missed the very first time when this this feature was being built on at Project Label and we built upon it over time but looking at how she made all those considerations before her very very very first draft it was really commendable yeah I appreciate our work on this yeah really cool leave a comment here in the document but also in Asia for her I think a good next step is to move that acceptance criteria and the comments that she's leaving in the designs area to the issue description because about the behavior about the rules just the overall functionality it's good to have that in the issue description but if you haven't had a chance yet to review it please hope support for me and as you also post some questions and scenarios about the CI job token work it's in I think this is the validation issue yes this is the solution validation issue I think you had a chance already we to work with her on this one yeah they know specifically what questions she still has open but now I think Marcel and I we answered most of the questions almost all in fact I invited Marcel because I did not want this to be heavy on my perspective I just wanted someone to challenge what I had written and yeah I think she has all the answers but still if somebody feels differently I would really welcome you to post your answers here awesome and buddy let us know because you'll probably watch this later on and then there's two more point two additional points here she's also mentioning the next steps for that CI job token is to create a validation plan and start from the clean the validation she can refer to Emily's work for dashboard on this one Emily do you want me to voice a comment you want to comment I never know how to do yes it was just if funny needed any context or feedback around the solution validation that I just did feel free to reach out and I can chat about it a little bit more and I just have an if I know not really it's just a comment to tell her that she should create the recruitment issues soon because it's not easy and get in touch with Erica is it Erica or will supporting the biopin security team it's Erica it's Erica yeah yeah it's very fine oh yes and she also worked on the scorecard and she apparently everyone had a chance to see that and of course her has picked up one of the suggestions of her recommendation that she's that she documented and there's already a merger quest also good to see that momentum and the engagement also for customers for the community on the work that she's doing overall what it has been busy she hasn't had the chance to join this class but it's nice that she's also able to update us here about for work and then if you don't have any questions I'll pass it over to the subject thanks Hayana I have two items the first one is about the think fixation that we did last week it was really great we didn't chat about any design relevant elements because it was intended to just become a more of a technical discussion was full of discussion around how to use API should we change architecture but I think it was great that I could hear a lot of from back on engineering perspective as around this project it was really cool and we wanted to make sure that we were aligned on this in terms of the project planning perspective we're working on the proposal from the back end architecture planning Fabio is working on and then we're also discussing shortly after the call and then we're keep discussing around this the long story short what we're discussing at the moment is how do the CICD catalog would to become is it GitLab catalog that includes a lot of different elements inside one catalog or do we want to speak to become a GitLab CICD catalog that includes CICD components with CICD steps CICD template type of component it's more of a discussion for the future vision and I'm happy that we're discussing this that we can make a proper design and product planning that we can work on working towards the roadmap and make sure we are aligned on the same goal it went pretty in my opinion and based on this we it's only the empty issue far but dove and I started to think about we should validate if this vision really makes sense or not today I just really quickly created an issue that the research issue is self is empty for now but I would probably need some of your feedback because we wanted to take this opportunity to test things out that is not exist in the market as as it's not part of the product but we wanted to make sure if it is really aligning with the user's needs or not it's that and my second item is also more of an FYI that I also went through the solution validation it was during the holiday season and it was a moderated test it went fairly and the good thing is we wanted to test out the different visual by representing the component currently if you check the CIC decadal it shows one project in a row but we are asking ourselves is it better to show the component inside the project seems it was but I I plug in one unrelated question to this research that how would you filter and find the components that are created by your colleagues to test out the filtering experience and we got a lot of constructive feedback on this we need more immediate action item yeah it was a good test and thanks Eric Kai if you're listening to this call for helping out planning the research issue yeah if you're interested in know if you have better idea on how we are improve the filtering experience I think it would be a whole topic that I may want to share in the CIC decadal UX review meeting at some point any questions in fast if not all I don't have a question you mentioned that you would want some help some feedback but where do we go to provide that I don't have a really described issue but I had created one empty issue link it here where is the tab sorry too many meetings today thanks Phil this is the issue that work on in the next one or three milestone and I want to really revamp the whole filtering experience for example one question do we need a tab here and the second question how does this filtering tap with the search full working together and I'm pretty much concerned about using this pattern I'm happy to explore alternative UI for this thanks for asking moving over to Hianna yes switchboard updates hi and the update I want to give to the team is that we may change this to the role requirements that you can find in the CIC off issue but also they'll review with you because most of you are part of the interview team the big change is that we are only interviewing and be hiring intermediate product designer when assessing when interviewing the candidates and also fill in the scorecard please keep in mind that we are moving them to the pipeline into the interview process considering them intermediate designers and also make some updates in the switch the priority of some of the skills both the soft skills and hard skills for this role as you can see here top three to five top three and five three to five top five sorry skills is foundational research I think for switchboard there's a lot of heavy lifting that needs to be done and a product designer we experience in research it's really important they need to be very strong collaborators with B.M. engineering auto designers mainly looking for some of the HES work with a design team before or at least had some pair designers we have interview designers that they were design team of one they were the only first designer in a startup etc I think that especially for if you think of where switchboard is now where we are getting started with a lot of the core functionality a core of the user experience someone that has a bit the more of experience in collaborating with other designers to get the understanding the insights all how to use design system that they are used to just figuring things out with the team I think that's essential if they are not already technical they are interested in HTML and CSS I'm sure if in your score cards your interviews you talk about that about those skills but I would them to at least be proficient in basic HTML and CSS that means that they are have a better understanding of design interactions that they will be able to communicate with the front-end engineers about the components that when we review merge quests they will just be able to jump in and do the work that they see done and I already mentioned reusability interactions as with the design system and experience working on complex products before I was really looking for someone that had a dev tools experience that's always tricky because get lab with such a specific work that you all do here complex products that can be working banking in compliance anything that really requires them to dig into this messy hairy problems and show that they can apply design inspiration to proposal solution that they can use research skills that they can collaborate with their teams involve engineering in their design process and I'm not sure that's what I'm looking for and the nice to have skills technical skills in general that could be anything outside the scope of HTML and CSS as I mentioned really nice if they have dev tool dev tooling experience maybe they're a user of get lab maybe they I don't know they're coming from one of our competitors and also onboarding platform workflows or admin platforms experience that's also nice to have I think before one of my mandatory skills was that they had experience in onboarding design but very tricky to find and combine all of that I think it's we made some tweaks there to make sure that we are not finding the candidates on paper but that we find the person for this job and that for the things that they they need to improve this because they need to improve that we create the opportunities for them to gain those skills what changes I think to you mainly is only intermediate if you think someone is at the intermediate level but they're I don't know early intermediate or I don't know a very strong intermediate I'll it to highlight that in your notes and also when I say intermediate it's a get lab intermediate because a lot of the candidates that we interviewed recently especially end of last year we showed two weeks ago they had a title senior but they were not get lab seniors it's difficult to not difficult but we have to set that expectation with the candidates I'll pause now see if you have any questions and if any of these made sense yeah they can align the expectations for the upcoming interviews I just have one question I really haven't been getting any interviews for this role I wasn't sure if that was something was missing there or I wasn't sure yeah that has been the challenge and it's also why we're making these changes to the the requirements I've interviewed only I don't know maybe a six eight candidates in the in the last four months that's not a lot because initially the the candidates that were being as green and they were qualified they were and that's answer to those questions too expensive or there were two senior they were they were good designers but switchboard is an area that if if we put someone that is two senior they're finish the work in a year and then what we cannot risk getting someone put someone there that's to be borrower it's a problem area where the designers design and they need to have room for growth they need to be able to learn also on the fly for example have experiencing research but have never worked with a research team they're collaborate with will you're learn something yes for this this role we haven't had many interviews we had candidates that were screened and were qualified and they moved to the team interviews I think VTK maybe Sanger interview a few then but then rejected after after a couple of interviews answer to a very short question but that's very much it yeah I think you you answered my first question I did add a another question since finally you've done you mentioned six to eight different interviews with some more senior candidates are there any concerns that intermediate candidates will still be able to match up with what you're looking for for those top three to five mandatory skills yeah I think and that's the assessment we've made after having these interviews and after also looking at the bulk of applications that we had I'm sure if I remember at some point I mentioned I'm reviewing a thousand applications because a lot of people are applying and as I mentioned they are seniors with they're not good lab senior you'll have the experience working complex products that we need or understanding research methodology et cetera et cetera I do think we'll find an intermediate candidate at this level because farm member correctly Gina both Gina and Lee and Sujong you the three of you join as that intermediate level but you all came with a very strong baggage very strong experience in very specific things and another thing we have to look at is that this team you're all seniors looking at the business when we hire yet another senior in this team there's only gonna be many staff and with and manager opportunities in the company we also need to think about that the career path and development and room for growth for a new person in the team that's related to the point I mentioned about composition expectations for people there to senior depending on location factors but also budgeting and career progression in the edis role that is a two question or a will yeah thanks for to go through that or me yeah of course and the question is should we have a question? yeah sorry this is a little bit out of scope and if it's something that we can't talk about in the recording also I'm fine with that but as you mentioned that there's a lot of seniors on our team and that there's not every the growth opportunities are only be there if there's a certain amount of openings and etc are there any is there any work going on to maybe change up our I don't know what the word is but the growth opportunities for product designers because now you're saying you're senior and then you're either staff or manager is there be other opportunities in between that? yes I think we have I'm not sure if the merger question was merged I don't think but I know that Valerie and and Peter they were working on the principal product designer which is staff plus similar to what engineering and also product has that's something that Christie was also working on because we need to make sure it's that let's say after after you get promoted for example to senior product product design manager you could become a director but then what's in between it's a limbo that that we need just this will clarify and I know that this is part of the discussions that leadership had at least last year I'm not sure yet when this will become a let's say something that is in the handbook of a a job because we also need to have the business need for that we didn't have staff designers in the past we also didn't have senior design managers as we grow we also have to make sure that we are not only adding people they are too senior because that also means we might lose them at some point that's all part of the changes for this particular role and also mainly because I think switchboard is complex but it's not as large as for example verifying where yeah you have a very -established set of functionality that yeah that will require expertise that requires a more senior designer yes answer your question but I don't know what thank you thank you thank you for your questions by the way and I know that we are at almost a time I'm just drop my question here I discuss this with some of you already but I want to see if you all can help me I have to this umbrella to switch board by the way but I have to complete a UX scorecard as part of a Q4 R that will require me to validate a job to be done to run a scorecard and a job to be done for a product area outside of CITD outside of switchboard I can pick anything but I want to pick something that relates to verify and release sorry verify environments it's and I remember that that changed and my question to you is do you have any suggestions do any recommendations on a cross stage job to be done that makes sense to be used for a scorecard that can help us experiment or at least assess the the that user experience thinking that the recommendations will be beneficial to your product areas that makes sense it's late but what do you think? I have the same suggestion here that I shared with you and everyone on one you help me come up with this I discuss with the designer with the other team of the other team which is go to view and that's how I farm this for testing the usability of merging experience which is a very wide experience and I can totally give you the highlights the tags from the update that validated this I would just need some time maybe tomorrow thanks me appreciate it I was thinking I'm not sure yeah I didn't discuss this with you Sunjim we didn't have time today but I was thinking of a running a job to be done a drain scorecard also for one of the jobs to be done in create but related to the pipeline the editor experience either the code suggestions or using I don't know VS code whatever using extensions because I think that could be interesting to you but they don't have jobs to be done for that for the category yeah that that's the type of thing I'm I'm looking for I'm thinking secure could be cool I think that could overlap with verify just thinking about security widget vulnerabilities that all connects back to commits and pipelines yeah that also makes sense because I think one of the is that you will or is the Erica that it's Erica that was working on a study for I think C.I. I think I adoption and something that about that related relates to security compliance workflows yeah it's definitely Erica it's Erica yeah I forgot that we still have wheels part of the agenda I'll just for now unless will you want to yeah voice a comment here yeah I saw that you added the link to the jazz to be done yellow file I was just scrolling through it and I came across this one it looks it hasn't been validated but it touches it's technically under distribution that's involved with installing get it lab and then it touches on Kubernetes which is covered by the environments team it looks there's a couple different stages involved I don't know that might be another area to consider but unlike the one that Vita had shared I don't know if this is it's got the evidence behind it as much as hers does yeah thanks Will I link here the the this job to be done the file yeah I'll do some digging think there's there must be some additional information in the direction pages or these categories this area but appreciate the feedback and then over to you Will yeah I don't really have a whole lot of updates I did want to just add to what Emily said earlier about her solution validation study that I think she did a great job collaborating with Victor and myself on this work and she was extremely efficient getting everything done especially around the holidays and she also did a great job running the study in user testing and then providing us with updates on each participant asking me for feedback on whether she needed to reject certain participants and get new ones in get higher quality feedback and then she also consolidated all of those individual sessions until I get overall summary which was really detailed and and also to see but that's it for me thank you Will and Emily thanks for the shout out thanks everyone yeah I never worked we want the never when we wanted to or never we want to it's gonna be for ever on the internet thanks everyone for joining me and for seeing a little bit of time hope you enjoyed rest of the day and I'll see you later bye",
  "word_count": 6066,
  "segment_count": 19,
  "cleaned_at": "2025-10-27T16:24:47.923872"
}