{
  "content": "User Journey Map Working Group\nThis working group has been established to develop a strategic framework and supportive infrastructure for scalable, consistent development of user journey maps across the GitLab platform.\nThese maps will enable Product, UX, and Dev teams to understand the complete journey of customers and GitLab users as they discover, evaluate, adopt, and integrate our DevSecOps platform. By identifying friction points, opportunities for education, and moments that matter most to users, we will create seamless pathways that increase first orders, accelerate successful onboarding, and strengthen long-term retention across our customer base.\nWhile this working group focuses on creating a structured foundation for journey maps, there are various initiatives ongoing related to the creation of maps that can be found in the\nUX Backlog User Journey Mapping issue\n.\nAttributes\nProperty\nValue\nDate Created\nApril 23, 2025\nTarget Date\nJuly 15, 2025\nActual End Date\nJuly 22, 2025\nSlack\n#ujm-working-group\n(internal only)\nGoogle Doc\nUser Journey Map Working Group Agenda\n(internal only)\nBusiness goals\nThis working group aims to:\nEstablish how journey mapping contributes to GitLabs business value, growth, monetization, and the company plan\nEstablish a strategic framework for user journey mapping across GitLab\nBuild an organizational infrastructure for journey mapping\nOperationalize teams around user journeys\nEnable cross-functional collaboration across user journeys\nBusiness outcomes and exit criteria\nDefine key terminology including: User journey, golden journey, journey map, and journey elevation/fidelity\n= 100%\nStatus:\nComplete\nDevelop guidelines for various levels of journey elevation (macro, mid, micro)\n= 100%\nStatus:\nComplete\nEstablish templates, methodologies, and best practices for journey documentation\n= 100%\nStatus: Complete;\nTemplates\n,\nDocumentation\n,\nBest practices\nCreate a centralized system for storing, accessing, and connecting journey maps\n= 100%\nStatus: Templates have been created in Figjam and we will utilize a Figma team to hold all user journeys. Templates include a way to link to nested and parent templates. Guidance has been added to the\nuser journey issue template\n.\nEstablish communication channels for journey insights and discoveries\n= 100%\nStatus: We have created the #gitlab-user-journeys slack channel and included its use in our best practices. This has been tied into the\nuser journey issue template\n, as well as\nbest practices\n.\nCreate a structure for translating journey insights into strategic opportunities based on business impact and user value\n= 100%\nStatus: We\nupdated existing actionable insights issues\nto include the business problem and relevant user journey metadata.\nRoles and Responsibilities\nWorking Group Role\nPerson\nTitle\nFacilitator\nTaurie Davis\nSenior Manager of Product Design\nExecutive Stakeholder\nValerie Karnes\nDirector of Product Design\nMember\nEmily Sybrant\nProduct Design Manager, Monetization\nMember\nPaige Cordero\nSenior Product Manager, Growth\nMember\nJessica Kane\nSenior Manager of UX Research.\nMember\nBen Leduc-Mills\nStaff UX Researcher\nMember\nJohn Hope\nSenior Manager of Engineering, Core Development\nMember\nSuzanne Selhorn\nStaff Technical Writer\nLast modified July 22, 2025:\nClose user journey map working group as complete (\n38e6f6fe\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/company/working-groups/user-journey-map/",
    "title": "User Journey Map Working Group | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:50:05.591088",
    "content_length": 3397,
    "section": "handbook"
  },
  "processing": {
    "original_length": 3397,
    "cleaned_length": 3390,
    "cleaned_at": "2025-10-27T16:13:42.361037",
    "processor": "text_cleaner_v1",
    "word_count": 497
  }
}