{
  "content": "Core Platform Career Framework: Intermediate Distribution Engineer\nCore Platform Intermediate Distribution Engineer\nCore Platform Framework\n\nDevelopment Framework\n\nEngineering Framework\nIntermediate Distribution\n\nSenior Distribution\nCore Platform Intermediate Distribution Engineers at GitLab are expected to exhibit the following competencies:\nLeadership Competencies\nTechnical Competencies\nValues Alignment\nLeadership Competencies\nEngineering\nAssumes goodwill, and is able to disagree and commit.\nCapable of delivering work despite periodical distractions.\nConstructively raises concerns.\nCommunicates in a clear, timely, and effective manner.\nCapable of adapting their messaging to technical audience.\nUnderstands organization structure and processes.\nDevelopment\nStill largely concentrates on growing themselves.\nSeeks out opportunities to expand their technical and non technical skills through continuous learning practices.\nOften works with other team members to grow their own understanding of the teams domain through code reviews, pair programming or mentoring sessions.\nParticipates in\ncode reviews\nand uses\nbest practices\nwhen giving and receiving\nfeedback\n.\nProvides additional feedback whenever possible (i.e.\n360s\n, Pulse, etc).\nCommunicates clearly and effectively, especially in writing, when working with peers, stable counterparts or their manager on technical tasks or issues.\nAdheres to the\nGitLab communication guidelines\n.\nSeeks assistance in clearly managing expectations around the delivery of their work.\nDelivers work given clear requirements within the context of their team.\nMakes responsible decisions in alignment with GitLabs\nCREDIT values\nby ideating options, identifying the consequences of each option, evaluating trade-offs and seeking advice from others when necessary.\nThinks critically by understanding why something needs to be done, determining the root cause of the problem, identifying objectives and examining previous efforts.\nRemains calm under pressure.\nDemonstrates knowledge about how their work aligns with their\nProduct section, stages, groups and categories\n.\nWorks effectively within established processes, and keeps themselves current as processes change.\nSeeks to understand how their work integrates with processes across the company.\nDistribution\nParticipates in team trainings, issue triage, and process review.\nPerforms Code Reviews within their domain on a regular cadence.\nIntentionally develops the skills necessary to become an expert on a specific subject.\nShares knowledge with team members after becoming a domain expert.\nSeeks and reviews customer issues and feedback through joining customer support calls, and reading customer feedback.\nTechnical Competencies\nEngineering\nConsiders quality, security, and performance of assigned tasks.\nIndependently plans, estimates and, delivers small and moderate solutions.\nSeeks guidance when blocked and iterates to a solution.\nPerforms thorough reviews within their domain and provides helpful feedback to team members.\nEncourages participation and engages with contributions from those in the community.\nDevelopment\nWrites\ntests\nwith every MR and works to uplift the quality of the code.\nWhen working in an existing area of the code base, is able to recognise and propose an improvement.\nAble to give an estimate and execute on proposals that do not affect deliverables.\nIs aware of company established development processes that are aimed at reducing security related issues.\nAdopts a security minded software development approach by following\nSecure Coding Guidelines\nearly in the development process.\nAble to take on security related issues, come up with an effective approach and deliver a working solution.\nAble to tackle all but large issues independently. Large issues with provided clear requirements and design implementation require little effort, issues that are not clearly defined require team assistance.\nAsks for help when an issue is taking longer to implement, works with the team to split the issue into smaller issues.\nProactively looks for opportunities to eliminate technical debt by creating technical debt issues, resolving technical debt issues and writing quality code that reduces additional technical debt.\nPerforms thorough reviews within their domain and submits helpful comments.\nKnows which tools are available to them to debug performance problems and understands how to use them.\nUnderstands how their code would be used in a production instance and how they can access\nmonitoring\ninformation (if available for their group).\nEncourages participation from those in the community.\nWhen working in an existing code area, leaves it in a better state than before.\nDistribution\nCapable of presenting training or demos, within their team domain.\nProficient or fluent with one or more languages to build, deploy and manage GitLab installations.\nWorking knowledge of Distributions build and installation frameworks.\nAble to debug issues that occur in production during installation and upgrading.\nDevelops documentation and instructions explaining how to configure, install and manage GitLab service components.\nAble to install and review GitLab installations in multiple deployment configurations.\nValues Alignment\nGitLab\nAdhere to the\nCollaboration Competencies\nfor this job grade.\nAdhere to the\nResults Competencies\nfor this job grade.\nAdhere to the\nEfficiency Competencies\nfor this job grade.\nAdhere to the\nDiversity, Inclusion & Belonging Competencies\nfor this job grade.\nAdhere to the\nIteration Competencies\nfor this job grade.\nAdhere to the\nTransparency Competencies\nfor this job grade.\nDevelopment\nIndependently brings in expertise from other contributors to raise the standard of their work.\nGives positive feedback in public and negative feedback privately with care.\nExecutes tasks in team projects, demonstrating ownership of them from conception to completion.\nRequires supervision to deliver projects in time, growing bias for action.\nRecognises complexity of the teams product or the teams process, and proposes solutions accordingly.\nCapable of implementing solutions based on the complexity, and asks for guidance when the complexity increases unexpectedly.\nAnalyzes team processes and proposes areas where efficiency improvements can be made.\nRequests expert help from others recognizing that diverse opinions/experience improve the quality of their solution.\nCollaborates and consults with stable counterparts including understanding their roles and responsibilities and focusing on fostering productive working relationships.\nShows that they are aware of differing priorities between groups.\nPrioritizes work by following\nGitLab Priority and Severity label\nguidelines, focusing on high-value activities, completing tasks with the earliest deadlines, and when in doubt, seek clarification regarding the priorities.\nBalances short term gains and long term benefit with teams help. For example, advocating for technical debt resolution and understanding the opportunity cost in comparison to a quick customer win.\nCreates proposals for their team that clearly defines the problem, offers alternatives, and proposes a solution. These proposals are small in scope, looking to address problems with a small surface area.\nIncorporates\nIteration\nin every aspect of your job (examples: development, issue creation, planning, process improvements)\nProvides context and background on projects and issues so that those with no prior knowledge are able to contribute to the discussion.\nLast modified June 27, 2024:\nRemove heading levels exception and fix errors (\n4e6ac4e3\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/engineering/careers/matrix/infrastructure/core-platform/distribution/intermediate/",
    "title": "Core Platform Career Framework: Intermediate Distribution Engineer | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:50:52.568654",
    "content_length": 7680,
    "section": "handbook"
  },
  "processing": {
    "original_length": 7680,
    "cleaned_length": 7671,
    "cleaned_at": "2025-10-27T16:13:42.424013",
    "processor": "text_cleaner_v1",
    "word_count": 1079
  }
}