{
  "title": "UX: RBAC permissions mapping exercise - CI/CD",
  "video_id": "mg3ZFGB8jTg",
  "url": "https://www.youtube.com/watch?v=mg3ZFGB8jTg",
  "transcript": " Cool, so thanks everyone for joining. I wanted to get in touch with all of y'all because I am working on a project with the permissions. Some of you may have already seen the work that I've been doing. A couple of y'all have already provided feedback, so that's great. Let's start with this real quick. So just a brief overview in case you're not familiar. I've been working with Amelia and Andy on redoing the entire permissions architecture of the platform based off of the idea that we're going to make. Customizable permissions. And so had Amelia had gone through and the first round of organizing the permissions based off of what they have here in our documentation. So we're going to be working on this table here. So, you know, analytics would be grouped as one. And then we would try and find out where does clusters be gone to what is a container registry, et cetera. So that was the first pass at it after we had started looking at some of this. As an example, where if I were to look at a individual permission called view project code, and I was to disable this permission. If we were not looking at what it links to, which is look at this table was like, well, individually doesn't do anything, but logically in the platform, it would turn off all of these other permissions without noticing. So what I've done is I've gone through and mapped all of the permissions to try and see if I can find these sorts of mappings and tied to this issue specifically. The devs are looking at consolidating this permission to view pipeline and view pipeline details. But instead of it being two permissions is just one. Kind of like consolidating line items here in this table or the same thing here. The idea is that if we're going to move forward with having a prototype where an admin can go and toggle individual features. And then we're going to try and minimize this complexity that can help on the back end with the problem that they describe here that they would have. There wouldn't be a need for overlapping or redundant permission. So in the case of here they have the same access level. We wouldn't be less confusion here and then it would make things easier to undo or to make changes within the code based without being so catastrophic towards like if you allow something that they shouldn't have access to they wouldn't necessarily cause any sort of negative impact in the in that sort of permission if you were to enable that permission right. So the reason I need y'all to sync with me today is to kind of go over this. Vitiga and Gina have already kind of looked at this a bit. And I think it's more or less okay. But I just wanted to kind of go through as part of this work that I'm doing here where I go through the entire. Permissions architecture and meet with every team that kind of has insider impact with this to make sure that I'm thinking of everything in this model and then also see if there's opportunities to merge or group things that don't necessarily need to exist individually. And so with that I will open the discussion for anyone who wants to kind of jump in and provide feedback. The first question from me Daniel is like what is the basis of consolidating I you thinking of in terms of page access or is it associated the primary permission is dissociated from the page access and something and entity of its own. So the idea would be specifically in this case where view pipeline page and view pipeline details page the question presents itself why are these separate what is the use case or the job to be done to have them independent independent permissions. So if there isn't a real realistic or definitive purpose for them being separate, then can we merge those the benefit is that it reduces the code. The amount of code that we have and reduces things that are it's touching. So kind of improves the security and that instead of having to watch or monitor to code code points you actually just looking at one. Then that sort of logic would apply to the whole project that I'm working on right. So minimizing the code base or reducing it in terms of complexity, as well as what sort of improvement that'll present on the front end where an admin doesn't necessarily have to talk to these features and you just toggle one. Instead of and receiving instead of two and then make it simpler for them reducing the UI. So one thing that I just noticed in the link that I just shared is just a list of permissions which are specific to pipelines on the docs. And while looking at this table, if you see the we have separated out view pipeline details page view pipeline page and view pipeline tab in MR. And when I kind of cross checked that with the documentation that I have in my personal excel sheet, the only difference that I see between accessing the pipeline list view versus the pipeline tab in merge request is that guests cannot access the pipelines in a merge request. So that's something that I think we should also cross check with the team if there is a possibility to consolidate that with these two permissions that you just talked about. Unless there's a very compelling case of not allowing guests to visit that particular tab in a merge request, but at the same time be able to look at the pipeline list view. Well, so one thing I guess I should probably clarify is that this change doesn't necessarily have any reflection on guest reporter developer maintainer owner. The idea being is that as an admin, I can then customize all of these to offer those individual permissions. So if a guest only had access to one particular permission, I could then enable that they would no longer be a guest. So any sort of restriction that you're seeing by a nonmember or a guest not having access to that doesn't necessarily play into this particular problem, I don't think. Apart from what do they have currently and can I enable or disable that the idea being that an admin would then give custom feature or custom access to something. The impetus for the project is our permissions are either too permissive or too restrictive. So if somebody can come in here and say I want to guest role, but I'm going to also give them permission to run a pipeline. And disable all the other things that could be possible. But we're looking more so is that any sort of problems that might arise by making those changes by if I do allow that does any sort of security concern arise or again going back to the idea of merging stuff. If I merge a particular permission does that have impact elsewhere. In that case, I think it definitely makes a lot of sense to kind of treat the pipeline tab and merge request in the same way as we treat list view. The only thing that I don't think I have the I've complete knowledge to comment on is how that plays with the access to merge request page. Because eventually like the same pipelines are also going to appear on the pipeline list view. So if somebody is able to view that then this should also be able to view this is just presenting the pipeline list view in a context in the context of a particular merge request. Yeah, I guess that's also something where I was looking for your knowledge is that so as it's grouped so far, we're just looking at the CICD screen, but it doesn't necessarily just stop there, right. So it touches merge requests and you know parts of the repo right. So are there connections there that I'm not linking correctly because they're in these little boxes right should this be a more. I'm connected prototype or not prototype but I'm connected mapping here. Right. So I mean, I'm just thinking of this hypothetical scenario that. So I'm going to add a possibility that I might as a user be given access to view pipelines but not take part in merge requests. That's possible that's the the whole idea of that if an admin wanted to create that custom role or custom policy, then we would offer that ability. And how would that play out if I still have access to like if I if I can still view all the pipelines. Just that not through that particular location. Right, and that's exactly where I'm like thinking, okay, what sort of problems does that create like like the one I used here view project code is like well, I turn that off but then everything else below that should turn off as well. Yeah. So if you don't have access to merger quest, you shouldn't have. No, but you should. Yeah, you shouldn't have view pipelines tab in MRs right that would just automatically be shut off because. Okay, so that's kind of what I'm wondering is that if you would be able to see merger quests or if you don't have merger quests, you wouldn't be able to see pipelines. No, I don't think so. I think the whole magic if if I'm not allowed to look at merge requests, then of course I cannot access that page and the tab is. And even not going to be available to me. But I don't think that impacts pipelines page by itself right that would be a separate permission. Yeah, it's separate that's what. So I don't understand. If you if you can't access pipelines though, can you access jobs because I was wondering what the difference between the pipelines list page and the details pages and I'm wondering if it's because the details shows the jobs within a pipeline and sometimes. And specific users can't see the jobs because they contain whatever sensitive data. That's a question that we should ask back an engineer that if if there's a let's say if there's. And then we can ask us asked like compliance related jobs that are running as a part of pipeline are they inheriting the same access as the parent pipeline or can that be controlled. So my assumption was like you look here. At the pipelines and then look at the pipeline detail. And then we can see that no, this is the comic page commit. Of course. That's the thing is that where is the detail shown. Would that be in the MR. This is the detail here. Okay. So this would be. Yeah. And the list you can see like there's a list of jobs down there too. And it's on tab that. And then you could like view jobs but technically I guess you could do that from the pipeline mini the little mini graphs. As well. Yes. I mean here. I'm sorry. For. Yeah. Like the list view pipeline. Yeah. Here's. Yeah. So it's kind of tied if you're able to view pipelines and view the pipeline details and just view pipelines you can also view the jobs and job details. Okay. So this sort of all these screens then need to be looked at as a linked. Linking from all of this right it's not just independent. Time back to here. Okay. Right. And that's kind of what I'm also curious is if you were to disable that what does it look like. And then you can see that the list of the items that you can see from the UI is basically just disappear these can these navigation items against. That's how we are handling thing right now. I mean we've just basic permissions right if you just don't have access. Nothing will appear right. This tab would go away. And this theoretically would go away. I don't think that goes away. That ever goes away. And then the one who has access to the merge request has access to the pipeline widget. There is one restriction that they cannot run a pipeline. If the pipeline fails, but I think recently we made a change that if a pipeline fails. Developers should have access to the run pipeline button which is inside the pipeline step. And then we can see that the pipeline is in. Let's see where it's a pipeline here. Yeah. So this one. Yeah. Oh, that's oddly placed. Okay. That was not available. I think to non maintainers if I'm not wrong, I'll check. I don't think that's possible. I think you're right. Okay. Well, I mean, so right now, I am not a maintainer on the Git Lab project, I don't think so. Yeah. Yeah. I could probably push it but I don't want to. It's okay. Yeah. I don't know. If that. You're saying that should not be that way. issue. Anyway, what I'm thinking is like, let's say if I don't have access to this merge request, would these pipelines not be visible to me on the pipeline list view as well? Because they are there as well. That doesn't happen today, I think. Right. So that's where I'm curious is that what amount of data would be visual. So like you wouldn't see the MR. But for some reason, you could see you could see the pipelines, if for some reason they were turned on, but you just couldn't see this content and maybe the changes and the commits. What would that information help? What would someone use that just the commits pipelines and changes for an MR? I'm just wondering if it even makes sense to just show those without the actual MR description and everything. So I'm thinking, let me jump in real quick because I want to make sure I'm understanding. I think this might just be a bad example where an admin would disable that or enable that to allow that sort of flexibility or to to prevent seeing something here. I would look at it more holistically across the platform as like saying, is there something that would negatively impact it? The example we're using I think is a fair example, but it might be like an outlier case. Right. I think the more relevant example might be, I don't want an external contributor to see code, but they can look at the merger quest and where's the merger quest real quick. It's a thing of a matter of security perspective, whereas I want a contributor, but I don't want them looking at something potentially problematic. And so, disabling pipeline might not be an example. Valid, but it is the one that they're working on. Where was that issue? I lost the issue. Here it is. Where they want to merge these two. Yeah. Okay. I think for me that the problem is I'm more afraid of what happens when they go to something that is actually more likely to be played with and disabled. I think that might be why they're going after this one in particular, because it probably nobody's an immeasurable with that. Like there's no reason to disable this. Right. But this would be these two are available for every level. Right. Guest has access to this. Yes. Okay. Yeah. So I think that might have been why they chose is because it's super low impact. Right. But jobs, like permission for jobs are definitely tied to these. So if somebody has access to view pipeline, they can definitely look at the job details and job list. Mm-hmm. Okay. So I think what I want to do next is talk with my engineers and ask them, what do they see impact wise from that outlying example. If somebody did for some reason, disable that permission, what does that look like in this case? Because I'm not exactly certain how that works because as you described, it won't just be contained to this pipeline's page. It actually goes all the way back to the merge request and this whole screen. Am I understanding correct? That's correct. So like out of the 12 trigger sources for that initiative pipeline, commit is I think one of them and commit is again related to the changes and like for security purpose, if the changes have to be hidden from someone, what happens to the pipeline permission? Mm-hmm. Okay. One other thing to throw in there, it's not fully live yet. It's only enabled for this project, for GitLab projects, but if you go to CI-CD, we also have artifacts now. And that depends on jobs and pipelines. So it's like the way that I was just saying, if you don't have access to a pipeline, you don't have access to the jobs, then you also won't have access to the artifacts. Gotcha. There's like a whole tree. Yeah. So I guess that's something that I need help with over here is can you help and fix this tree with me to make sure that the links look correct from your perspective? So I think that's my ask for the team is that just double check what I have so far and make new links or break links as you see relevant to your group. And then also just feel free to note or call out anything that might be weird or problematic and we can talk about it async. And like I said, I'm also going to pass us through with the devs so they can see what we're talking about in our concerns. Okay. Okay. We can do that. For runners. Now that I'm just looking at this, is I never even know add add runners to namespace is an existing permission? Sorry. Come again, Gina. I think so. Let me find it. No, only six links. It says add specific run into product. It's listed. Yeah. Okay. Oh, yeah. Product will be in namespace. It's limited to owners and maintainers. Yeah. Okay. I'm just trying to think about all the things. I'm going to think about it a little bit more runners are like the permissions are so complicated. So I'm going to take a closer look into into that. Cool. So yeah, this is hopefully been helpful. And I hope I have explained what I'm trying to do correctly. I guess if you'll have any other feedback for the meeting today, I don't want to I don't want to keep you longer than our schedule. Okay. Cool. So then yeah, like I said, when you have opportunity, please add some changes here or links that I'm missing that you think should belong here, especially like across these sorts of features. I think that's mostly where I'm lacking is where they touch across the platform. There's definitely an overlap with security and compliance and the create features. I mean that and also package, I guess. Yeah, my assumption was there should be a lot more links, but that's kind of what I was hoping to have these chats with everyone to see which ones I'm missing. Yeah. Awesome. Well, thanks everyone. I appreciate your time and it was super helpful for me and I'm glad I could catch everyone in the same time slot. I hope I could keep anyone up too late or wake anybody up too early. Cool. Thanks again. Good to see y'all. Have a good day.",
  "segments": [
    {
      "id": 0,
      "seek": 0,
      "start": 0.0,
      "end": 1060.6,
      "text": "Cool, thanks everyone for joining. I wanted to get in touch with all of y'all because I am working on a project with the permissions. Some of you may have already seen the work that I've been doing. A couple of y'all have already provided feedback, that's great. Let's start with this real quick. just a brief overview in case you're not familiar. I've been working with Amelia and Andy on redoing the entire permissions architecture of the platform based off of the idea that make. Customizable permissions. And had Amelia had gone through and the first round of organizing the permissions based off of what they have here in our documentation. be working on this table here. , , analytics would be grouped as one. And then we would try and find out where does clusters be gone to what is a container registry, et cetera. that was the first pass at it after we had started looking at some of this. As an example, where if I were to look at a individual permission called view project code, and I was to disable this permission. If we were not looking at what it links to, which is look at this table was , , individually doesn't do anything, but logically in the platform, it would turn off all of these other permissions without noticing. what I've done is I've gone through and mapped all of the permissions to try and see if I can find these sorts of mappings and tied to this issue specifically. The devs are looking at consolidating this permission to view pipeline and view pipeline details. But instead of it being two permissions is just one. consolidating line items here in this table or the same thing here. The idea is that if move forward with having a prototype where an admin can go and toggle individual features. And then try and minimize this complexity that can help on the back end with the problem that they describe here that they would have. There wouldn't be a need for overlapping or redundant permission. in the case of here they have the same access level. We wouldn't be less confusion here and then it would make things easier to undo or to make changes within the code based without being catastrophic towards if you allow something that they shouldn't have access to they wouldn't necessarily cause any negative impact in the in that permission if you were to enable that permission . the reason I need y'all to sync with me today is to go over this. Vitiga and Gina have already looked at this a bit. And I think it's more or less . But I just wanted to go through as part of this work that I'm doing here where I go through the entire. Permissions architecture and meet with every team that has insider impact with this to make sure that I'm thinking of everything in this model and then also see if there's opportunities to merge or group things that don't necessarily need to exist individually. And with that I will open the discussion for anyone who wants to jump in and provide feedback. The first question from me Daniel is what is the basis of consolidating I you thinking of in terms of page access or is it associated the primary permission is dissociated from the page access and something and entity of its own. the idea would be specifically in this case where view pipeline page and view pipeline details page the question presents itself why are these separate what is the use case or the job to be done to have them independent independent permissions. if there isn't a real realistic or definitive purpose for them being separate, then can we merge those the benefit is that it reduces the code. The amount of code that we have and reduces things that are it's touching. improves the security and that instead of having to watch or monitor to code code points you just looking at one. Then that logic would apply to the whole project that I'm working on . minimizing the code base or reducing it in terms of complexity, as as what improvement that'll present on the front end where an admin doesn't necessarily have to talk to these features and you just toggle one. Instead of and receiving instead of two and then make it simpler for them reducing the UI. one thing that I just noticed in the link that I just shared is just a list of permissions which are specific to pipelines on the docs. And while looking at this table, if the we have separated out view pipeline details page view pipeline page and view pipeline tab in MR. And when I cross checked that with the documentation that I have in my personal excel sheet, the only difference that I see between accessing the pipeline list view versus the pipeline tab in merge request is that guests cannot access the pipelines in a merge request. that's something that I think we should also cross check with the team if there is a possibility to consolidate that with these two permissions that you just talked about. Unless there's a very compelling case of not allowing guests to visit that particular tab in a merge request, but at the same time be able to look at the pipeline list view. , one thing I should probably clarify is that this change doesn't necessarily have any reflection on guest reporter developer maintainer owner. The idea being is that as an admin, I can then customize all of these to offer those individual permissions. if a guest only had access to one particular permission, I could then enable that they would no longer be a guest. any restriction that you're seeing by a nonmember or a guest not having access to that doesn't necessarily play into this particular problem, I don't think. Apart from what do they have currently and can I enable or disable that the idea being that an admin would then give custom feature or custom access to something. The impetus for the project is our permissions are either too permissive or too restrictive. if somebody can come in here and say I want to guest role, but also give them permission to run a pipeline. And disable all the other things that could be possible. But we're looking more is that any problems that might arise by making those changes by if I do allow that does any security concern arise or again going back to the idea of merging stuff. If I merge a particular permission does that have impact elsewhere. In that case, I think it definitely makes a lot of sense to treat the pipeline tab and merge request in the same way as we treat list view. The only thing that I don't think I have the I've complete knowledge to comment on is how that plays with the access to merge request page. Because eventually the same pipelines are also appear on the pipeline list view. if somebody is able to view that then this should also be able to view this is just presenting the pipeline list view in a context in the context of a particular merge request. Yeah, that's also something where I was looking for your knowledge is that as it's grouped far, we're just looking at the CICD screen, but it doesn't necessarily just stop there, . it touches merge requests and parts of the repo . are there connections there that I'm not linking correctly because they're in these little boxes should this be a more. I'm connected prototype or not prototype but I'm connected mapping here. . , I'm just thinking of this hypothetical scenario that. add a possibility that I might as a user be given access to view pipelines but not take part in merge requests. That's possible that's the the whole idea of that if an admin wanted to create that custom role or custom policy, then we would offer that ability. And how would that play out if I still have access to if I if I can still view all the pipelines. Just that not through that particular location. , and that's exactly where I'm thinking, , what problems does that create the one I used here view project code is , I turn that off but then everything else below that should turn off as . Yeah. if you don't have access to merger quest, you shouldn't have. No, but you should. Yeah, you shouldn't have view pipelines tab in MRs that would just automatically be shut off because. , that's what I'm wondering is that if you would be able to see merger quests or if you don't have merger quests, you wouldn't be able to see pipelines. No, I don't think . I think the whole magic if if I'm not allowed to look at merge requests, then of course I cannot access that page and the tab is. And even not be available to me. But I don't think that impacts pipelines page by itself that would be a separate permission. Yeah, it's separate that's what. I don't understand. If you if you can't access pipelines though, can you access jobs because I was wondering what the difference between the pipelines list page and the details pages and I'm wondering if it's because the details shows the jobs within a pipeline and sometimes. And specific users can't see the jobs because they contain whatever sensitive data. That's a question that we should ask back an engineer that if if there's a let's say if there's. And then we can ask us asked compliance related jobs that are running as a part of pipeline are they inheriting the same access as the parent pipeline or can that be controlled. my assumption was you look here. At the pipelines and then look at the pipeline detail. And then we can see that no, this is the comic page commit. Of course. That's the thing is that where is the detail shown. Would that be in the MR. This is the detail here. . this would be. Yeah. And the list you can see there's a list of jobs down there too. And it's on tab that. And then you could view jobs but technically you could do that from the pipeline mini the little mini graphs. As . Yes. here. I'm sorry. For. Yeah. the list view pipeline. Yeah. Here's. Yeah. it's tied if you're able to view pipelines and view the pipeline details and just view pipelines you can also view the jobs and job details. . this all these screens then need to be looked at as a linked. Linking from all of this it's not just independent. Time back to here. . . And that's what I'm also curious is if you were to disable that what does it look . And then you can see that the list of the items that you can see from the UI is just disappear these can these navigation items against. That's how we are handling thing now. we've just basic permissions if you just don't have access. Nothing will appear . This tab would go away. And this theoretically would go away. I don't think that goes away. That ever goes away. And then the one who has access to the merge request has access to the pipeline widget. There is one restriction that they cannot run a pipeline. If the pipeline fails, but I think recently we made a change that if a pipeline fails. Developers should have access to the run pipeline button which is inside the pipeline step. And then we can see that the pipeline is in. where it's a pipeline here. Yeah. this one. Yeah. Oh, that's oddly placed. . That was not available. I think to non maintainers if I'm not wrong, I'll check. I don't think that's possible. I think you're . . , , now, I am not a maintainer on the Git Lab project, I don't think . Yeah. Yeah. I could probably push it but I don't want to. It's . Yeah. I don't know. If that. You're saying that should not be that way. issue. , what I'm thinking is , let's say if I don't have access to this merge request, would these pipelines not be visible to me on the pipeline list view as ? Because they are there as . That doesn't happen today, I think. . that's where I'm curious is that what amount of data would be visual. you wouldn't see the MR. But for some reason, you could see you could see the pipelines, if for some reason they were turned on, but you just couldn't see this content and maybe the changes and the commits. What would that information help? What would someone use that just the commits pipelines and changes for an MR? I'm just wondering if it even makes sense to just show those without the actual MR description and everything. I'm thinking, jump in real quick because I want to make sure I'm understanding. I think this might just be a bad example where an admin would disable that or enable that to allow that flexibility or to to prevent seeing something here. I would look at it more holistically across the platform as saying, is there something that would negatively impact it?",
      "tokens": [
        50364,
        8561,
        11,
        370,
        3231,
        1518,
        337,
        5549,
        13,
        50614
      ],
      "temperature": 0.0,
      "avg_logprob": -0.1476733626388922,
      "compression_ratio": 1.5252525252525253,
      "no_speech_prob": 0.06651215255260468
    },
    {
      "id": 154,
      "seek": 105532,
      "start": 1063.24,
      "end": 1120.04,
      "text": "The example we're using I think is a fair example, but it might be an outlier case. . I think the more relevant example might be, I don't want an external contributor to see code, but they can look at the merger quest and where's the merger quest real quick. It's a thing of a matter of security perspective, whereas I want a contributor, but I don't want them looking at something potentially problematic. And , disabling pipeline might not be an example. Valid, but it is the one that they're working on. Where was that issue? I lost the issue. Here it is. Where they want to merge these two. Yeah. .",
      "tokens": [
        50760,
        440,
        1365,
        321,
        434,
        1228,
        286,
        519,
        307,
        257,
        3143,
        1365,
        11,
        457,
        309,
        1062,
        312,
        411,
        364,
        484,
        2753,
        1389,
        13,
        51084
      ],
      "temperature": 0.0,
      "avg_logprob": -0.17900398198296041,
      "compression_ratio": 1.547486033519553,
      "no_speech_prob": 0.0006920761079527438
    },
    {
      "id": 162,
      "seek": 110476,
      "start": 1127.96,
      "end": 1145.16,
      "text": "I think for me that the problem is I'm more afraid of what happens when they go to something that is more likely to be played with and disabled. I think that might be why they're going after this one in particular, because it probably nobody's an immeasurable with that.",
      "tokens": [
        51524,
        286,
        519,
        337,
        385,
        300,
        264,
        1154,
        307,
        286,
        478,
        544,
        4638,
        295,
        437,
        2314,
        562,
        436,
        352,
        281,
        746,
        300,
        307,
        51748
      ],
      "temperature": 0.0,
      "avg_logprob": -0.24173416031731498,
      "compression_ratio": 1.5151515151515151,
      "no_speech_prob": 0.010498441755771637
    },
    {
      "id": 165,
      "seek": 113244,
      "start": 1147.4,
      "end": 1150.44,
      "text": "there's no reason to disable this. .",
      "tokens": [
        51112,
        1743,
        456,
        311,
        572,
        1778,
        281,
        28362,
        341,
        13,
        1779,
        13,
        51264
      ],
      "temperature": 0.0,
      "avg_logprob": -0.26065817111875955,
      "compression_ratio": 1.5240384615384615,
      "no_speech_prob": 0.0010357253486290574
    },
    {
      "id": 166,
      "seek": 113244,
      "start": 1154.68,
      "end": 1169.08,
      "text": "But this would be these two are available for every level. . Guest has access to this. Yes. . Yeah. I think that might have been why they chose is because it's super low impact. .",
      "tokens": [
        51476,
        583,
        341,
        576,
        312,
        613,
        732,
        366,
        2435,
        337,
        633,
        1496,
        13,
        51672
      ],
      "temperature": 0.0,
      "avg_logprob": -0.26065817111875955,
      "compression_ratio": 1.5240384615384615,
      "no_speech_prob": 0.0010357253486290574
    },
    {
      "id": 171,
      "seek": 116004,
      "start": 1172.2,
      "end": 1187.0,
      "text": "But jobs, permission for jobs are definitely tied to these. if somebody has access to view pipeline, they can definitely look at the job details and job list. Mm-hmm. .",
      "tokens": [
        50972,
        583,
        4782,
        11,
        411,
        11226,
        337,
        4782,
        366,
        2138,
        9601,
        281,
        613,
        13,
        407,
        498,
        2618,
        575,
        2105,
        281,
        51352
      ],
      "temperature": 0.0,
      "avg_logprob": -0.31541744867960614,
      "compression_ratio": 1.4491978609625669,
      "no_speech_prob": 0.004739570897072554
    },
    {
      "id": 174,
      "seek": 118364,
      "start": 1191.4,
      "end": 1218.3600000000001,
      "text": "I think what I want to do next is talk with my engineers and ask them, what do they see impact wise from that outlying example. If somebody did for some reason, disable that permission, what does that look in this case? Because I'm not exactly certain how that works because as you described, it won't just be contained to this pipeline's page. It goes all the way back to the merge request",
      "tokens": [
        50752,
        407,
        286,
        519,
        437,
        286,
        528,
        281,
        360,
        958,
        307,
        751,
        365,
        452,
        11955,
        293,
        1029,
        552,
        11,
        437,
        360,
        436,
        536,
        51048
      ],
      "temperature": 0.0,
      "avg_logprob": -0.208135101530287,
      "compression_ratio": 1.4444444444444444,
      "no_speech_prob": 0.005379508249461651
    },
    {
      "id": 179,
      "seek": 121068,
      "start": 1220.68,
      "end": 1251.3999999999999,
      "text": "and this whole screen. Am I understanding correct? That's correct. out of the l2 trigger sources for that initiative pipeline, commit is I think one of them and commit is again related to the changes and for security purpose, if the changes have to be hidden from someone, what happens to the pipeline permission? Mm-hmm. .",
      "tokens": [
        50864,
        293,
        341,
        1379,
        2568,
        13,
        2012,
        286,
        3701,
        3006,
        30,
        51128
      ],
      "temperature": 0.0,
      "avg_logprob": -0.17024634866153493,
      "compression_ratio": 1.4461538461538461,
      "no_speech_prob": 0.0015830055344849825
    },
    {
      "id": 184,
      "seek": 123612,
      "start": 1256.4399999999998,
      "end": 1302.1200000000001,
      "text": "One other thing to throw in there, it's not fully live yet. It's only enabled for this project, for GitLab projects, but if you go to CI-CD, we also have artifacts now. And that depends on jobs and pipelines. it's the way that I was just saying, if you don't have access to a pipeline, you don't have access to the jobs, then you also won't have access to the artifacts. Gotcha. There's a whole tree. Yeah. that's something that I need help with over here is can you help and fix this tree with me to make sure that the links look correct from your perspective?",
      "tokens": [
        51380,
        1485,
        661,
        551,
        281,
        3507,
        294,
        456,
        11,
        309,
        311,
        406,
        4498,
        1621,
        1939,
        13,
        467,
        311,
        787,
        15172,
        337,
        341,
        1716,
        11,
        51744
      ],
      "temperature": 0.0,
      "avg_logprob": -0.16975333473899148,
      "compression_ratio": 1.5125628140703518,
      "no_speech_prob": 0.0016016836743801832
    },
    {
      "id": 191,
      "seek": 129372,
      "start": 1304.68,
      "end": 1347.6399999999999,
      "text": "I think that's my ask for the team is that just double check what I have far and make new links or break links as relevant to your group. And then also just feel free to note or call out anything that might be weird or problematic and we can talk about it async. And I said, I'm also pass us through with the devs they can see what we're talking about in our concerns. . . We can do that. For runners. Now that I'm just looking at this, is I never even know add add runners to namespace is an existing permission?",
      "tokens": [
        50912,
        407,
        286,
        519,
        300,
        311,
        452,
        1029,
        337,
        264,
        1469,
        307,
        300,
        445,
        3834,
        1520,
        437,
        286,
        362,
        370,
        1400,
        51188
      ],
      "temperature": 0.0,
      "avg_logprob": -0.14038988947868347,
      "compression_ratio": 1.4853801169590644,
      "no_speech_prob": 0.001898663816973567
    },
    {
      "id": 198,
      "seek": 134252,
      "start": 1356.44,
      "end": 1359.96,
      "text": "Sorry. Come again, Gina. I think .",
      "tokens": [
        51060,
        4919,
        13,
        2492,
        797,
        11,
        34711,
        13,
        286,
        519,
        370,
        13,
        961,
        385,
        51236
      ],
      "temperature": 0.0,
      "avg_logprob": -0.33684964801954187,
      "compression_ratio": 1.2113821138211383,
      "no_speech_prob": 0.001041259034536779
    },
    {
      "id": 199,
      "seek": 134252,
      "start": 1364.04,
      "end": 1377.96,
      "text": "find it. No, only six links. It says add specific run into product. It's listed. Yeah. . Oh, yeah. Product will be in namespace.",
      "tokens": [
        51440,
        915,
        309,
        13,
        883,
        11,
        787,
        2309,
        6123,
        13,
        51560
      ],
      "temperature": 0.0,
      "avg_logprob": -0.33684964801954187,
      "compression_ratio": 1.2113821138211383,
      "no_speech_prob": 0.001041259034536779
    },
    {
      "id": 201,
      "seek": 136644,
      "start": 1380.04,
      "end": 1444.92,
      "text": "It's limited to owners and maintainers. Yeah. . I'm just trying to think about all the things. think about it a little bit more runners are the permissions are complicated. take a closer look into into that. Cool. yeah, this is hopefully been helpful. And I hope I have explained what I'm trying to do correctly. if you'll have any other feedback for the meeting today, I don't want to I don't want to keep you longer than our schedule. . Cool. then yeah, I said, when you have opportunity, please add some changes here or links that I'm missing that you think should belong here, especially across these sorts of features. I think that's mostly where I'm lacking is where they touch across the platform.",
      "tokens": [
        51044,
        467,
        311,
        5567,
        281,
        7710,
        293,
        6909,
        433,
        13,
        865,
        13,
        1033,
        13,
        286,
        478,
        445,
        1382,
        281,
        519,
        466,
        439,
        264,
        721,
        13,
        51492
      ],
      "temperature": 0.0,
      "avg_logprob": -0.235327539564688,
      "compression_ratio": 1.6096256684491979,
      "no_speech_prob": 0.008516624569892883
    },
    {
      "id": 209,
      "seek": 144628,
      "start": 1447.24,
      "end": 1457.16,
      "text": "There's definitely an overlap with security and compliance and the create features. that and also package, .",
      "tokens": [
        50412,
        821,
        311,
        2138,
        364,
        19959,
        365,
        3825,
        293,
        15882,
        293,
        264,
        1884,
        4122,
        13,
        286,
        914,
        300,
        293,
        611,
        7372,
        11,
        286,
        2041,
        13,
        50908
      ],
      "temperature": 0.0,
      "avg_logprob": -0.21212456566946847,
      "compression_ratio": 1.5078534031413613,
      "no_speech_prob": 0.0017963731661438942
    },
    {
      "id": 210,
      "seek": 144628,
      "start": 1460.04,
      "end": 1483.4,
      "text": "Yeah, my assumption was there should be a lot more links, but that's what I was hoping to have these chats with everyone to see which ones I'm missing. Yeah. Awesome. , thanks everyone. I appreciate your time and it was super helpful for me and I'm glad I could catch everyone in the same time slot. I hope I could keep anyone up too late or wake anybody up too early.",
      "tokens": [
        51052,
        865,
        11,
        452,
        15302,
        390,
        456,
        820,
        312,
        257,
        688,
        544,
        6123,
        11,
        457,
        300,
        311,
        733,
        295,
        437,
        286,
        390,
        7159,
        281,
        362,
        613,
        38057,
        365,
        1518,
        281,
        536,
        597,
        2306,
        286,
        478,
        5361,
        13,
        51460
      ],
      "temperature": 0.0,
      "avg_logprob": -0.21212456566946847,
      "compression_ratio": 1.5078534031413613,
      "no_speech_prob": 0.0017963731661438942
    },
    {
      "id": 213,
      "seek": 146996,
      "start": 1486.52,
      "end": 1489.0,
      "text": "Cool. Thanks again. Good to see y'all. Have a good day.",
      "tokens": [
        51192,
        8561,
        13,
        2561,
        797,
        13,
        2205,
        281,
        536,
        288,
        6,
        336,
        13,
        3560,
        257,
        665,
        786,
        13,
        51316
      ],
      "temperature": 0.0,
      "avg_logprob": -0.21348327909197126,
      "compression_ratio": 1.4917127071823204,
      "no_speech_prob": 0.007307824213057756
    }
  ],
  "full_text": "Cool, thanks everyone for joining. I wanted to get in touch with all of y'all because I am working on a project with the permissions. Some of you may have already seen the work that I've been doing. A couple of y'all have already provided feedback, that's great. Let's start with this real quick. just a brief overview in case you're not familiar. I've been working with Amelia and Andy on redoing the entire permissions architecture of the platform based off of the idea that make. Customizable permissions. And had Amelia had gone through and the first round of organizing the permissions based off of what they have here in our documentation. be working on this table here. , , analytics would be grouped as one. And then we would try and find out where does clusters be gone to what is a container registry, et cetera. that was the first pass at it after we had started looking at some of this. As an example, where if I were to look at a individual permission called view project code, and I was to disable this permission. If we were not looking at what it links to, which is look at this table was , , individually doesn't do anything, but logically in the platform, it would turn off all of these other permissions without noticing. what I've done is I've gone through and mapped all of the permissions to try and see if I can find these sorts of mappings and tied to this issue specifically. The devs are looking at consolidating this permission to view pipeline and view pipeline details. But instead of it being two permissions is just one. consolidating line items here in this table or the same thing here. The idea is that if move forward with having a prototype where an admin can go and toggle individual features. And then try and minimize this complexity that can help on the back end with the problem that they describe here that they would have. There wouldn't be a need for overlapping or redundant permission. in the case of here they have the same access level. We wouldn't be less confusion here and then it would make things easier to undo or to make changes within the code based without being catastrophic towards if you allow something that they shouldn't have access to they wouldn't necessarily cause any negative impact in the in that permission if you were to enable that permission . the reason I need y'all to sync with me today is to go over this. Vitiga and Gina have already looked at this a bit. And I think it's more or less . But I just wanted to go through as part of this work that I'm doing here where I go through the entire. Permissions architecture and meet with every team that has insider impact with this to make sure that I'm thinking of everything in this model and then also see if there's opportunities to merge or group things that don't necessarily need to exist individually. And with that I will open the discussion for anyone who wants to jump in and provide feedback. The first question from me Daniel is what is the basis of consolidating I you thinking of in terms of page access or is it associated the primary permission is dissociated from the page access and something and entity of its own. the idea would be specifically in this case where view pipeline page and view pipeline details page the question presents itself why are these separate what is the use case or the job to be done to have them independent independent permissions. if there isn't a real realistic or definitive purpose for them being separate, then can we merge those the benefit is that it reduces the code. The amount of code that we have and reduces things that are it's touching. improves the security and that instead of having to watch or monitor to code code points you just looking at one. Then that logic would apply to the whole project that I'm working on . minimizing the code base or reducing it in terms of complexity, as as what improvement that'll present on the front end where an admin doesn't necessarily have to talk to these features and you just toggle one. Instead of and receiving instead of two and then make it simpler for them reducing the UI. one thing that I just noticed in the link that I just shared is just a list of permissions which are specific to pipelines on the docs. And while looking at this table, if the we have separated out view pipeline details page view pipeline page and view pipeline tab in MR. And when I cross checked that with the documentation that I have in my personal excel sheet, the only difference that I see between accessing the pipeline list view versus the pipeline tab in merge request is that guests cannot access the pipelines in a merge request. that's something that I think we should also cross check with the team if there is a possibility to consolidate that with these two permissions that you just talked about. Unless there's a very compelling case of not allowing guests to visit that particular tab in a merge request, but at the same time be able to look at the pipeline list view. , one thing I should probably clarify is that this change doesn't necessarily have any reflection on guest reporter developer maintainer owner. The idea being is that as an admin, I can then customize all of these to offer those individual permissions. if a guest only had access to one particular permission, I could then enable that they would no longer be a guest. any restriction that you're seeing by a nonmember or a guest not having access to that doesn't necessarily play into this particular problem, I don't think. Apart from what do they have currently and can I enable or disable that the idea being that an admin would then give custom feature or custom access to something. The impetus for the project is our permissions are either too permissive or too restrictive. if somebody can come in here and say I want to guest role, but also give them permission to run a pipeline. And disable all the other things that could be possible. But we're looking more is that any problems that might arise by making those changes by if I do allow that does any security concern arise or again going back to the idea of merging stuff. If I merge a particular permission does that have impact elsewhere. In that case, I think it definitely makes a lot of sense to treat the pipeline tab and merge request in the same way as we treat list view. The only thing that I don't think I have the I've complete knowledge to comment on is how that plays with the access to merge request page. Because eventually the same pipelines are also appear on the pipeline list view. if somebody is able to view that then this should also be able to view this is just presenting the pipeline list view in a context in the context of a particular merge request. Yeah, that's also something where I was looking for your knowledge is that as it's grouped far, we're just looking at the CICD screen, but it doesn't necessarily just stop there, . it touches merge requests and parts of the repo . are there connections there that I'm not linking correctly because they're in these little boxes should this be a more. I'm connected prototype or not prototype but I'm connected mapping here. . , I'm just thinking of this hypothetical scenario that. add a possibility that I might as a user be given access to view pipelines but not take part in merge requests. That's possible that's the the whole idea of that if an admin wanted to create that custom role or custom policy, then we would offer that ability. And how would that play out if I still have access to if I if I can still view all the pipelines. Just that not through that particular location. , and that's exactly where I'm thinking, , what problems does that create the one I used here view project code is , I turn that off but then everything else below that should turn off as . Yeah. if you don't have access to merger quest, you shouldn't have. No, but you should. Yeah, you shouldn't have view pipelines tab in MRs that would just automatically be shut off because. , that's what I'm wondering is that if you would be able to see merger quests or if you don't have merger quests, you wouldn't be able to see pipelines. No, I don't think . I think the whole magic if if I'm not allowed to look at merge requests, then of course I cannot access that page and the tab is. And even not be available to me. But I don't think that impacts pipelines page by itself that would be a separate permission. Yeah, it's separate that's what. I don't understand. If you if you can't access pipelines though, can you access jobs because I was wondering what the difference between the pipelines list page and the details pages and I'm wondering if it's because the details shows the jobs within a pipeline and sometimes. And specific users can't see the jobs because they contain whatever sensitive data. That's a question that we should ask back an engineer that if if there's a let's say if there's. And then we can ask us asked compliance related jobs that are running as a part of pipeline are they inheriting the same access as the parent pipeline or can that be controlled. my assumption was you look here. At the pipelines and then look at the pipeline detail. And then we can see that no, this is the comic page commit. Of course. That's the thing is that where is the detail shown. Would that be in the MR. This is the detail here. . this would be. Yeah. And the list you can see there's a list of jobs down there too. And it's on tab that. And then you could view jobs but technically you could do that from the pipeline mini the little mini graphs. As . Yes. here. I'm sorry. For. Yeah. the list view pipeline. Yeah. Here's. Yeah. it's tied if you're able to view pipelines and view the pipeline details and just view pipelines you can also view the jobs and job details. . this all these screens then need to be looked at as a linked. Linking from all of this it's not just independent. Time back to here. . . And that's what I'm also curious is if you were to disable that what does it look . And then you can see that the list of the items that you can see from the UI is just disappear these can these navigation items against. That's how we are handling thing now. we've just basic permissions if you just don't have access. Nothing will appear . This tab would go away. And this theoretically would go away. I don't think that goes away. That ever goes away. And then the one who has access to the merge request has access to the pipeline widget. There is one restriction that they cannot run a pipeline. If the pipeline fails, but I think recently we made a change that if a pipeline fails. Developers should have access to the run pipeline button which is inside the pipeline step. And then we can see that the pipeline is in. where it's a pipeline here. Yeah. this one. Yeah. Oh, that's oddly placed. . That was not available. I think to non maintainers if I'm not wrong, I'll check. I don't think that's possible. I think you're . . , , now, I am not a maintainer on the Git Lab project, I don't think . Yeah. Yeah. I could probably push it but I don't want to. It's . Yeah. I don't know. If that. You're saying that should not be that way. issue. , what I'm thinking is , let's say if I don't have access to this merge request, would these pipelines not be visible to me on the pipeline list view as ? Because they are there as . That doesn't happen today, I think. . that's where I'm curious is that what amount of data would be visual. you wouldn't see the MR. But for some reason, you could see you could see the pipelines, if for some reason they were turned on, but you just couldn't see this content and maybe the changes and the commits. What would that information help? What would someone use that just the commits pipelines and changes for an MR? I'm just wondering if it even makes sense to just show those without the actual MR description and everything. I'm thinking, jump in real quick because I want to make sure I'm understanding. I think this might just be a bad example where an admin would disable that or enable that to allow that flexibility or to to prevent seeing something here. I would look at it more holistically across the platform as saying, is there something that would negatively impact it? The example we're using I think is a fair example, but it might be an outlier case. . I think the more relevant example might be, I don't want an external contributor to see code, but they can look at the merger quest and where's the merger quest real quick. It's a thing of a matter of security perspective, whereas I want a contributor, but I don't want them looking at something potentially problematic. And , disabling pipeline might not be an example. Valid, but it is the one that they're working on. Where was that issue? I lost the issue. Here it is. Where they want to merge these two. Yeah. . I think for me that the problem is I'm more afraid of what happens when they go to something that is more likely to be played with and disabled. I think that might be why they're going after this one in particular, because it probably nobody's an immeasurable with that. there's no reason to disable this. . But this would be these two are available for every level. . Guest has access to this. Yes. . Yeah. I think that might have been why they chose is because it's super low impact. . But jobs, permission for jobs are definitely tied to these. if somebody has access to view pipeline, they can definitely look at the job details and job list. Mm-hmm. . I think what I want to do next is talk with my engineers and ask them, what do they see impact wise from that outlying example. If somebody did for some reason, disable that permission, what does that look in this case? Because I'm not exactly certain how that works because as you described, it won't just be contained to this pipeline's page. It goes all the way back to the merge request and this whole screen. Am I understanding correct? That's correct. out of the l2 trigger sources for that initiative pipeline, commit is I think one of them and commit is again related to the changes and for security purpose, if the changes have to be hidden from someone, what happens to the pipeline permission? Mm-hmm. . One other thing to throw in there, it's not fully live yet. It's only enabled for this project, for GitLab projects, but if you go to CI-CD, we also have artifacts now. And that depends on jobs and pipelines. it's the way that I was just saying, if you don't have access to a pipeline, you don't have access to the jobs, then you also won't have access to the artifacts. Gotcha. There's a whole tree. Yeah. that's something that I need help with over here is can you help and fix this tree with me to make sure that the links look correct from your perspective? I think that's my ask for the team is that just double check what I have far and make new links or break links as relevant to your group. And then also just feel free to note or call out anything that might be weird or problematic and we can talk about it async. And I said, I'm also pass us through with the devs they can see what we're talking about in our concerns. . . We can do that. For runners. Now that I'm just looking at this, is I never even know add add runners to namespace is an existing permission? Sorry. Come again, Gina. I think . find it. No, only six links. It says add specific run into product. It's listed. Yeah. . Oh, yeah. Product will be in namespace. It's limited to owners and maintainers. Yeah. . I'm just trying to think about all the things. think about it a little bit more runners are the permissions are complicated. take a closer look into into that. Cool. yeah, this is hopefully been helpful. And I hope I have explained what I'm trying to do correctly. if you'll have any other feedback for the meeting today, I don't want to I don't want to keep you longer than our schedule. . Cool. then yeah, I said, when you have opportunity, please add some changes here or links that I'm missing that you think should belong here, especially across these sorts of features. I think that's mostly where I'm lacking is where they touch across the platform. There's definitely an overlap with security and compliance and the create features. that and also package, . Yeah, my assumption was there should be a lot more links, but that's what I was hoping to have these chats with everyone to see which ones I'm missing. Yeah. Awesome. , thanks everyone. I appreciate your time and it was super helpful for me and I'm glad I could catch everyone in the same time slot. I hope I could keep anyone up too late or wake anybody up too early. Cool. Thanks again. Good to see y'all. Have a good day.",
  "word_count": 3097,
  "segment_count": 16,
  "cleaned_at": "2025-10-27T16:24:47.793805"
}