{
  "content": "About GitLab\nAMAs\nWhat you need to know about Ask Me Anything (AMA)\nBeing a public company\nGitLab as a Public Company In 2017, GitLab established aspirational milestones for a public...\nCadence\nEverything in a company happens in a certain cadence. The period of each cadence differs. Learn about the cadences we have at GitLab.\nE-Group offsite\nThe E-Group offsite happens every quarter for four days after the Board of Directors meeting\nE-Group Weekly\nFor executives to connect on a weekly basis in order to get timely input from E-Group, align on key initiatives, inform about key business happenings and celebrate company successes.\nFamily and Friends Day\nAt GitLab, Family & Friends days are shared days away from work to prioritize time with family and friends, volunteering, self-care, or anything else.\nGeneral guidance to OKRs\nAn overview of how OKRs may be done.\nGitLab All-Company Meetings\nAn overview of GitLab Assembly and Quarterly Kickoff Meetings\nGitLab Culture\nHere's a look at what you can expect from our culture and all-remote environment.\nGitLab Environmental, Social, and Governance (ESG)\nAn overview of corporate sustainability at GitLab.\nGitLab licensing technology to independent Chinese company FAQ\nOn this page you can view frequently asked questions about GitLab licensing its technology to a new, independent Chinese company.\nGitLab Mission\nWe at GitLab believe that all digital products should be open to contributions; from legal documents to movie scripts, and from websites to chip designs.\nGitLab Purpose\nGitLab empowers everyone through knowledge sharing, job access, and our software platform.\nGitLab Vision\nBehind the scenes of The DevSecOps Platform\nHistory of GitLab\nReview a summarised history of GitLab and the adventure so far from 2011 up until the present day. Learn more here!\nInfrastructure Standards\nThis handbook section defines the latest iteration of infrastructure standards for AWS and GCP across all departments and groups at GitLab.\nKPIs\nWhat are KPIs Every part of GitLab has Key Performance Indicators (KPIs). Avoid the term metric...\nMeet Our Team\nMore than 3,000 people have contributed to GitLab. The GitLab Inc. team consists of the following...\nOnly Healthy Constraints\nCompanies often slow down as they mature. GitLab strives for healthy constraints.\nOrganizational Structure\nGitLab has at most eight layers in the company structure (Associate/Intermediate/Senior, Manager/Staff, Senior Manager/Principal, Director/Distinguished, Senior Director, VP/Fellow, Executives, Board). View more here!\nOur stewardship of GitLab\nGitLab has an open core business model and generate almost all our revenue with subscriptions to paid tiers. Learn more!\nPricing model\nMost GitLab functionality is and will be available for free in our Free tier. Paid tiers include features targeted for managers, directors, and executives.\nQuote to Cash\nGitLab's Quote to Cash systems and processes\nStill a Startup\nGitLab elevates others through knowledge sharing, job access, and our software platform.\nWorking Groups\nLike all groups at GitLab, a working group is an arrangement of people from different functions. Learn more!\nLast modified September 1, 2023:\nAdd comment to vision doc to signpost to buyer exp. (\n25772a09\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/company/",
    "title": "About GitLab | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:49:42.364787",
    "content_length": 3309,
    "section": "handbook"
  },
  "processing": {
    "original_length": 3309,
    "cleaned_length": 3312,
    "cleaned_at": "2025-10-27T16:13:42.353999",
    "processor": "text_cleaner_v1",
    "word_count": 509
  }
}