{
  "title": "ci/cd ux meeting APAC 2022-06-15",
  "video_id": "exTwAR4PeFY",
  "url": "https://www.youtube.com/watch?v=exTwAR4PeFY",
  "transcript": " Hi everyone and welcome to the CICD UX Sync for June 14th or 15th depending on where you are in the world. To start with I'll go through the general slash manager announcements. Hi, I'm put here to review the the OKR's progress and asks if anything is blocked or at risk and no one has written anything so that's good. There's a reminder that there's a family and friends day on June 24th and also a reminder that we're going to be doing mid year check ins and hyenas created a tracking issue. So this is team member lead check ins to assess how things are going from both the team member and managers point of view to share feedback and help improve performance and development plans. So make sure to dedicate an upcoming one on one with hyena and do this before July 22nd. And another announcement is welcome to Emily who is going to be the product designer on the release team. So get welcome Emily or really happy that you're here. And I just added a small notes I will be in Europe for two months starting next week. I'll be taking a couple days off to deal with the jet lag some of those fall on public holidays and family and friends days, but I might ask the channel to cover for me. But I'm not expecting anything major. Cool, I'll just quickly go over Gina's items. So Gina says that the artifacts page research is complete and that they're going to move forward with the page but have gotten a lot of great feedback that will be incorporated into the NBC. So she's working on updating the list now. And Gina is also working on a survey to validate artifacts jobs we've done and has collected about 80 responses and going to be analyzing the data in 15 to air cuts. Did you want to voice your comment? Yeah, I just wanted to ask you know the question of there was some difference that Jackie was talking about between self manage and SAS users. And I was just very curious. So if she could respond there that would be awesome. Next from Gina is the new runner list for your research, which is in progress. So she's done unmoderated research and it was purely on quantitative data on the usability of the new view versus the old view and she's holding sessions with customers to get qualitative feedback in a couple of weeks as well. And last thing from Gina is John's update if you're working with upgrades at all upgrading get lab runner, for example, we now have an icon to represent them. So that's cool. Sweet, I'll move on to my stuff. So I recently completed the analysis for solution validation for the container registry cleanup policies. This feature allows you to set policies to automatically remove items from the registry to save storage space. And this is very similar to previous solution validation I've done for the packet registry. They're not super surprising, but one thing that I didn't anticipate is that users want to make a template of their policies and apply them to other projects. Erica, you had a comment. I think that's so awesome. And I want us to be able to elevate that in a report brief way. That's just what I would have done in a previous role would be to make a really quick summary. You have that actionable insight. And maybe we should just think through like how we bring together all the work around the library. Like we could link it to that foundational research issue I had or whatever you... Yeah, but we should elevate it. Yeah, yeah, hi Nadia. We've already started going through the agenda just so you know. Sure. When you say, Erica, when you say pull that out into a separate report brief, what exactly does that mean? It would be like instead of the lead, instead of you leading with like we did this study on that, it would be like here's the highlight of a learning related to templates that might be helpful for us to keep in mind as we think about a shared resource library. Yeah, that makes sense. I'm just wondering would that be in Dovetail or would that be on an issue? I don't think we would put it in Dovetail because I think we want to get engineers engaging with it more. And maybe you could take the lead in thinking through the things that we would want. As each of us discovered that the things that we would want to report out, but I looked at it briefly and it was like, I noticed you asked about which level, like project team or group, if they had feedback like that or just sort of this general idea that they love infrastructure as code. Yeah, I'm wondering how, because this kind of fits in with the resource library stuff as you were mentioning before. And I'm just wondering like, yeah, how do I socialize that? What's the best way? Maybe we make an epic and then everyone can link to that. I don't know, a meta issue so that it doesn't get swamped. We can think about it. Yeah, we don't have to solve it on this call, but that is maybe an action item. So I'll mark that after this. My next item is in 152, we're going to be implementing a feature that we're going to release with a small subset of users and monitor with snowplow tracking. And the reason is we've done two rounds of validation, but we're still not certain if this is disruptive to people's workflows. So we're taking a pretty cautious approach. I've done this at other companies, but I've never done it at GitLab. So and my front-end engineer is also new to GitLab. So we're going to figure out this together. But yeah, I'll let you all know how that goes. My next point, I've been doing the touchpoints interviews for a package and I consistently am hearing from customers that the integration with package and release could be better. So I had a one hour call yesterday and I captured the feedback on an internal note. So I'm not sure if you all are going to be able to see it. But basically, I would really like to work with Emily when she's maybe a little bit more on boarded to improve this. Nadia, do you want to voice your question? Yeah, I'm curious to hear if you're already seeing some opportunities there. Do you have any ideas for how we could better integrate those two areas? Yeah, totally. Basically, it's quite a lot of manual process and a lot of boilerplate code that people need in the pipeline and what people are actually expecting is that they couldn't create a package in the pipeline and just mark the package as a release and they don't need to do extra steps. And for the more people want to be able to see that a release like the actual artifact of the release comes from the package registry and a link to that because the package registry has a lot more in-depth information for auditing and stuff. And at the moment, when you're going on the release page, you download the artifact and that's it. You don't even know necessarily that it came from the package registry and there's this whole wealth of information. So it seems like ignoring the technical side, the opportunity is quite clear, but I'm sure there's probably some technical reasons why it is the way it is. Yeah, thanks, Anne. Thank you. My next item, I'm starting to plan for 15-2 and I think there's some opportunities to start getting some of these research projects that we had in the validation backlog moving again. Specifically, we want to improve the package detail page because there's a lot more features we want to add to it. But we kind of want to do like some problem validation to understand what workflows people are. Why are the reasons that they're coming there? What are they trying to achieve? What's missing? What's painful? Just kind of some foundational problem validation research before we start thinking about features. And my last point is continuing on my journey with data. I'm going to try to implement the missing front end events tracking, so that's click tracking for package. We are only tracking like 20% of the things that people click on at the moment. So we have all these beautiful size and stashboards, but they're not painting a really good picture because we're missing a lot of the tracking. So I'm going to attempt that. I think it's going to be easy because I can just copy it from the code, but famous last words, I guess. And that's it for me. I see. Are you guys writing something or do you want to keep the tree don't we? OK. All right. So in 15.3 and this milestone as well, like the remaining week, I'll be focusing on the pipeline components and the solution validation. Currently, I'm finishing up the interviews with internal users. And I've been talking to a lot of the members of our productivity engineering team. And so far, the feedback that we've been getting has been very positive on our proposal. We are getting lots of ideas for improving the further iteration of the future. But it seems like our direction, a lot of the choices that we've made so far are on track and seem like the desired behavior. And also, there's a lot of interest from the engineering productivity team to dog food or product. We already have an issue where we will be tracking that. So we expect that we'll start the implementation in 15.4. If everything goes well, depends on how quickly we can go through the planning breakdown. Of course, there can be an first-seen challenges. But let's hope. And then, yeah, and then we'll be able to dog food it with our productivity engineering team. So they want to kind of move to our new system for creating pipeline components and use our feature to standardize their components or CI templates. So yeah, all of this is very exciting because we can really see how we'll be getting this into the actual product and dog fooding it with our own team. I can't not have been there. So I wonder if you could think about setting up a quick and just real quick lightweight diary study for them or like a Slack bot where you ask them, like, what did you use it for today? Or like, what went well? What could have gone better? Just to stream my in that feedback and make less work for you? I really like the idea of a Slack bot. It hasn't occurred to me to do something like that. My initial idea was to just have an issue, but I see how having something Slack like that would be much easier for the engineers to kind of just type their feedback in. So maybe there's a way to somehow connect it. Maybe have a Slack bot and then somehow pull all of that into the issue because I want to make sure I can actually like grab all of that information that is coming in and have a document is somewhere. But yeah, I think it's a really good idea. Yeah, just like yeah, what went well? What didn't go well? What was your goal? Awesome. Thanks, Erica. Always with your nuggets of wisdom. I love it. Okay. Another thing I wanted to share is around the recently edited guidelines for in product reference information using drawers. So with edits and really basic guidelines, I was lining what kind of content you should put into the drawers, what kind of content you shouldn't put into the drawers and how all of that can be implemented either by pulling in the documentation directly to the drawer or you can also have your own custom content that you write, but it still has to adhere to the content guidelines for our documentation. And we want to actually store it in a markdown file in the docs repository. That is being done to ensure that we can actually test the changes to help content using the documentation pipeline because it does all kinds of helpful waiting and whatnot. So following up on that, I'm revisiting the pipeline editor drawer to make it more helpful to our users. So there's been a lot of hype around the pipeline editor drawer. I feel like like so many people were interested in it like, oh, it's so nice. It's this help info and then we start tracking it. It's youthish. And honestly, it's very low compared to the oral pipeline editor usage. And I think there could be like many different ways to interpret it. Like maybe our users just those toggle when they're going through the flow, which I don't think is the case. Or also maybe it's not very discoverable. It's not tied to a piece of the cat. I mean, maybe it's not tied to a specific task that they're working on. So there's, yeah, we're kind of like not helping them with something specific. It's very generic. And if you look at the guidelines that we put in place, we're saying that we shouldn't create generic health drawers. Like here's help on all kinds of topics that you might think of. Instead, it should be tied to helping the user perform a very specific task. So, yeah, basically I want to like take a deeper dive on the metrics that we've got. Because we also start getting metrics and all of the links inside the drawer. So we can see when the user clicks into the drawer itself, what are they reading about? And so far, it looks like the leading links are CI example. And also the YAML reference, which is something that we would expect. Let's start it. I have to repair off. It's my first step on you, Cat. I can't discipline her. She's just climbing a lottery. Yeah, so I want to take all of this data. And I don't know, maybe we could do some additional solution validation as well together some qualitative data around this. But my next step I think would be to do some experimentation there with the content and try different ways of surfacing different information. Yeah, so basically we learned that it seems like it's not. It's probably not helping our users as much as we thought it were. So I will be looking into it and be able to do that. Hopefully we can improve it from there. Cool. Do we want to move on to the research section? Yeah, so just a general update. There have been no shows. People are not showing to sessions. And it's actually just a larger trend. We think related to the changing of seasons. It's not you or our recruitment, it's just a general trend across all studies. So I thought that would be helpful. And then I have just a couple of check ins. There are, oh, Nadia, do you want to talk? No, I'm just making a joke. Maybe it's not a career retrograde or something. Exactly. Okay. And then, and then if you guys could go into and link the research, the studies that you've been doing, yeah, the research studies you've been doing that I should include in the registry and synthesis. I'm still really wanting to do that to kind of go through. So if you have them and you link them in that issue, that's where I go back through and do like a, like a crosswalk of all the findings for the studies in terms of our big research questions. We like put those together when I first started. And then because we validated our product direction with the, the KUMKON survey, we're like good with those questions. So it's just, if you have other studies that you've completed or when you do, just a reminder, because I was kind of thinking about it. And then if you can go back through and just take out the studies or either delete them from those tables or just say finished, that'd be good. Not, not. I won't beg you, but that'd be awesome, but it's not that great. I mean, you know, I can try to figure it out. And then just also that our team looked just really great. So good job, everyone with the OptiProduction Survey. If you look in that async issue, you can see that we're getting like all this cross-functional feedback. And people are just saying like, great job. You're, you're team did a great job on this. So, okay. Nice. Anyone have anything else they want to chat about? No? Okay, great. Well, thank you both. And yeah, speak to you soon. All right. Bye.",
  "segments": [
    {
      "id": 0,
      "seek": 0,
      "start": 0.0,
      "end": 309.32000000000005,
      "text": "Hi everyone and welcome to the CICD UX Sync for June l4th or l5th depending on where you are in the world. To start with I'll go through the general slash manager announcements. Hi, I'm put here to review the the OKR's progress and asks if anything is blocked or at risk and no one has written anything that's good. There's a reminder that there's a family and friends day on June 24th and also a reminder that be doing mid year check ins and hyenas created a tracking issue. this is team member lead check ins to assess how things are going from both the team member and managers point of view to share feedback and help improve performance and development plans. make sure to dedicate an upcoming one on one with hyena and do this before July 22nd. And another announcement is welcome to Emily who is be the product designer on the release team. get welcome Emily or really happy that you're here. And I just added a small notes I will be in Europe for two months starting next week. I'll be taking a couple days off to deal with the jet lag some of those fall on public holidays and family and friends days, but I might ask the channel to cover for me. But I'm not expecting anything major. Cool, I'll just quickly go over Gina's items. Gina says that the artifacts page research is complete and that they're move forward with the page but have gotten a lot of great feedback that will be incorporated into the NBC. she's working on updating the list now. And Gina is also working on a survey to validate artifacts jobs we've done and has collected about 8O responses and be analyzing the data in l5 to air cuts. Did you want to voice your comment? Yeah, I just wanted to ask the question of there was some difference that Jackie was talking about between self manage and SAS users. And I was just very curious. if she could respond there that would be awesome. Next from Gina is the new runner list for your research, which is in progress. she's done unmoderated research and it was purely on quantitative data on the usability of the new view versus the old view and she's holding sessions with customers to get qualitative feedback in a couple of weeks as . And last thing from Gina is John's update if you're working with upgrades at all upgrading get lab runner, for example, we now have an icon to represent them. that's cool. Sweet, I'll move on to my stuff. I recently completed the analysis for solution validation for the container registry cleanup policies. This feature allows you to set policies to automatically remove items from the registry to save storage space. And this is very similar to previous solution validation I've done for the packet registry. They're not super surprising, but one thing that I didn't anticipate is that users want to make a template of their policies and apply them to other projects. Erica, you had a comment. I think that's awesome. And I want us to be able to elevate that in a report brief way. That's just what I would have done in a previous role would be to make a really quick summary. You have that actionable insight. And maybe we should just think through how we bring together all the work around the library. we could link it to that foundational research issue I had or whatever you... Yeah, but we should elevate it. Yeah, yeah, hi Nadia. We've already started going through the agenda just . Sure. When you say, Erica, when you say pull that out into a separate report brief, what exactly does that mean? It would be instead of the lead, instead of you leading with we did this study on that, it would be here's the highlight of a learning related to templates that might be helpful for us to keep in mind as we think about a shared resource library. Yeah, that makes sense. I'm just wondering would that be in Dovetail or would that be on an issue? I don't think we would put it in Dovetail because I think we want to get engineers engaging with it more. And maybe you could take the lead in thinking through the things that we would want. As each of us discovered that the things that we would want to report out, but I looked at it briefly and it was , I noticed you asked about which level, project team or group, if they had feedback that or just this general idea that they love infrastructure as code.",
      "tokens": [
        50364,
        2421,
        1518,
        293,
        2928,
        281,
        264,
        383,
        2532,
        35,
        40176,
        26155,
        66,
        337,
        6928,
        3499,
        392,
        420,
        2119,
        392,
        5413,
        322,
        689,
        291,
        366,
        294,
        264,
        1002,
        13,
        50864
      ],
      "temperature": 0.0,
      "avg_logprob": -0.25030108532273626,
      "compression_ratio": 1.4324324324324325,
      "no_speech_prob": 0.04055153951048851
    },
    {
      "id": 58,
      "seek": 28604,
      "start": 312.68,
      "end": 344.04,
      "text": "Yeah, I'm wondering how, because this fits in with the resource library stuff as you were mentioning before. And I'm just wondering , yeah, how do I socialize that? What's the best way? Maybe we make an epic and then everyone can link to that. I don't know, a meta issue that it doesn't get swamped. We can think about it. Yeah, we don't have to solve it on this call, but that is maybe an action item. I'll mark that after this.",
      "tokens": [
        51696,
        865,
        11,
        286,
        478,
        6359,
        577,
        11,
        51814
      ],
      "temperature": 0.0,
      "avg_logprob": -0.25088516707272873,
      "compression_ratio": 1.6121495327102804,
      "no_speech_prob": 0.0012303065741434693
    },
    {
      "id": 70,
      "seek": 34232,
      "start": 347.76,
      "end": 376.2,
      "text": "My next item is in l52, be implementing a feature that release with a small subset of users and monitor with snowplow tracking. And the reason is we've done two rounds of validation, but we're still not certain if this is disruptive to people's workflows. we're taking a pretty cautious approach. I've done this at other companies, but I've never done it at GitLab. and my front-end engineer is also new to GitLab. figure out this together. But yeah, I'll let you all know how that goes.",
      "tokens": [
        50636,
        1222,
        958,
        3174,
        307,
        294,
        2119,
        17,
        11,
        50728
      ],
      "temperature": 0.0,
      "avg_logprob": -0.16144630874412647,
      "compression_ratio": 1.6326530612244898,
      "no_speech_prob": 0.0005327537073753774
    },
    {
      "id": 83,
      "seek": 37028,
      "start": 379.23999999999995,
      "end": 479.68,
      "text": "My next point, I've been doing the touchpoints interviews for a package and I consistently am hearing from customers that the integration with package and release could be better. I had a one hour call yesterday and I captured the feedback on an internal note. I'm not sure if you all are be able to see it. But , I would really to work with Emily when she's maybe a little bit more on boarded to improve this. Nadia, do you want to voice your question? Yeah, I'm curious to hear if you're already seeing some opportunities there. Do you have any ideas for how we could better integrate those two areas? Yeah, totally. , it's quite a lot of manual process and a lot of boilerplate code that people need in the pipeline and what people are expecting is that they couldn't create a package in the pipeline and just mark the package as a release and they don't need to do extra steps. And for the more people want to be able to see that a release the actual artifact of the release comes from the package registry and a link to that because the package registry has a lot more in-depth information for auditing and stuff. And at the moment, when you're going on the release page, you download the artifact and that's it. You don't even know necessarily that it came from the package registry and there's this whole wealth of information. it seems ignoring the technical side, the opportunity is quite clear, but I'm sure there's probably some technical reasons why it is the way it is. Yeah, thanks, Anne. Thank you.",
      "tokens": [
        50812,
        1222,
        958,
        935,
        11,
        286,
        600,
        668,
        884,
        264,
        2557,
        20552,
        12318,
        50998
      ],
      "temperature": 0.0,
      "avg_logprob": -0.15614640175759256,
      "compression_ratio": 1.6454183266932272,
      "no_speech_prob": 0.0005100707639940083
    },
    {
      "id": 119,
      "seek": 45680,
      "start": 482.52,
      "end": 520.12,
      "text": "My next item, I'm starting to plan for l5-2 and I think there's some opportunities to start getting some of these research projects that we had in the validation backlog moving again. Specifically, we want to improve the package detail page because there's a lot more features we want to add to it. But we want to do some problem validation to understand what workflows people are. Why are the reasons that they're coming there? What are they trying to achieve? What's missing? What's painful? Just some foundational problem validation research before we start thinking about features.",
      "tokens": [
        51650,
        1222,
        958,
        3174,
        11,
        286,
        478,
        2891,
        281,
        1393,
        337,
        2119,
        12,
        17,
        51838
      ],
      "temperature": 0.0,
      "avg_logprob": -0.17255221643755514,
      "compression_ratio": 1.5928571428571427,
      "no_speech_prob": 0.00017218828725162894
    },
    {
      "id": 133,
      "seek": 51492,
      "start": 522.88,
      "end": 555.5200000000001,
      "text": "And my last point is continuing on my journey with data. try to implement the missing front end events tracking, that's click tracking for package. We are only tracking 2O% of the things that people click on at the moment. we have all these beautiful size and stashboards, but they're not painting a really good picture because we're missing a lot of the tracking. attempt that. I think it's be easy because I can just copy it from the code, but famous last words, .",
      "tokens": [
        50762,
        400,
        452,
        1036,
        935,
        307,
        9289,
        322,
        452,
        4671,
        365,
        1412,
        13,
        50988
      ],
      "temperature": 0.0,
      "avg_logprob": -0.17972808414035374,
      "compression_ratio": 1.5935251798561152,
      "no_speech_prob": 0.0008304227376356721
    },
    {
      "id": 144,
      "seek": 54444,
      "start": 558.12,
      "end": 559.0,
      "text": "And that's it for me.",
      "tokens": [
        51048,
        400,
        300,
        311,
        309,
        337,
        385,
        13,
        51092
      ],
      "temperature": 0.0,
      "avg_logprob": -0.347256266552469,
      "compression_ratio": 1.4947368421052631,
      "no_speech_prob": 0.00031533840228803456
    },
    {
      "id": 145,
      "seek": 54444,
      "start": 566.9200000000001,
      "end": 570.24,
      "text": "I see. Are you guys writing something or do you want to keep the tree don't we?",
      "tokens": [
        51488,
        286,
        536,
        13,
        51504
      ],
      "temperature": 0.0,
      "avg_logprob": -0.347256266552469,
      "compression_ratio": 1.4947368421052631,
      "no_speech_prob": 0.00031533840228803456
    },
    {
      "id": 148,
      "seek": 54444,
      "start": 572.2800000000001,
      "end": 572.6400000000001,
      "text": "OK.",
      "tokens": [
        51756,
        2264,
        13,
        51774
      ],
      "temperature": 0.0,
      "avg_logprob": -0.347256266552469,
      "compression_ratio": 1.4947368421052631,
      "no_speech_prob": 0.00031533840228803456
    },
    {
      "id": 149,
      "seek": 57444,
      "start": 574.8800000000001,
      "end": 671.16,
      "text": "All . in l5.3 and this milestone as , the remaining week, I'll be focusing on the pipeline components and the solution validation. Currently, I'm finishing up the interviews with internal users. And I've been talking to a lot of the members of our productivity engineering team. And far, the feedback that we've been getting has been very positive on our proposal. We are getting lots of ideas for improving the further iteration of the future. But it seems our direction, a lot of the choices that we've made far are on track and seem the desired behavior. And also, there's a lot of interest from the engineering productivity team to dog food or product. We already have an issue where we will be tracking that. we expect that we'll start the implementation in l5.4. If everything goes , depends on how quickly we can go through the planning breakdown. Of course, there can be an first-seen challenges. But let's hope. And then, yeah, and then we'll be able to dog food it with our productivity engineering team. they want to move to our new system for creating pipeline components and use our feature to standardize their components or CI templates. yeah, all of this is very exciting because we can really see how we'll be getting this into the actual product and dog fooding it with our own team.",
      "tokens": [
        50386,
        1057,
        558,
        13,
        50426
      ],
      "temperature": 0.0,
      "avg_logprob": -0.19213379130643957,
      "compression_ratio": 1.5609756097560976,
      "no_speech_prob": 0.004961566999554634
    },
    {
      "id": 181,
      "seek": 65368,
      "start": 674.7199999999999,
      "end": 739.28,
      "text": "I can't not have been there. I wonder if you could think about setting up a quick and just real quick lightweight diary study for them or a Slack bot where you ask them, , what did you use it for today? Or , what went ? What could have gone better? Just to stream my in that feedback and make less work for you? I really the idea of a Slack bot. It hasn't occurred to me to do something that. My initial idea was to just have an issue, but I see how having something Slack that would be much easier for the engineers to just type their feedback in. maybe there's a way to somehow connect it. Maybe have a Slack bot and then somehow pull all of that into the issue because I want to make sure I can grab all of that information that is coming in and have a document is somewhere. But yeah, I think it's a really good idea. Yeah, just yeah, what went ? What didn't go ? What was your goal?",
      "tokens": [
        51416,
        286,
        393,
        380,
        406,
        362,
        668,
        456,
        13,
        51498
      ],
      "temperature": 0.0,
      "avg_logprob": -0.19353466723338666,
      "compression_ratio": 1.4805825242718447,
      "no_speech_prob": 0.0008390908478759229
    },
    {
      "id": 205,
      "seek": 73740,
      "start": 742.12,
      "end": 748.16,
      "text": "Awesome. Thanks, Erica. Always with your nuggets of wisdom. I love it. .",
      "tokens": [
        50600,
        10391,
        13,
        50638
      ],
      "temperature": 0.0,
      "avg_logprob": -0.33514763758732724,
      "compression_ratio": 1.5805084745762712,
      "no_speech_prob": 0.0005015358910895884
    },
    {
      "id": 210,
      "seek": 73740,
      "start": 751.4,
      "end": 942.4799999999999,
      "text": "Another thing I wanted to share is around the recently edited guidelines for in product reference information using drawers. with edits and really basic guidelines, I was lining what content you should put into the drawers, what content you shouldn't put into the drawers and how all of that can be implemented either by pulling in the documentation directly to the drawer or you can also have your own custom content that you write, but it still has to adhere to the content guidelines for our documentation. And we want to store it in a markdown file in the docs repository. That is being done to ensure that we can test the changes to help content using the documentation pipeline because it does all kinds of helpful waiting and whatnot. following up on that, I'm revisiting the pipeline editor drawer to make it more helpful to our users. there's been a lot of hype around the pipeline editor drawer. I feel many people were interested in it , oh, it's nice. It's this help info and then we start tracking it. It's youthish. And honestly, it's very low compared to the oral pipeline editor usage. And I think there could be many different ways to interpret it. maybe our users just those toggle when they're going through the flow, which I don't think is the case. Or also maybe it's not very discoverable. It's not tied to a piece of the cat. , maybe it's not tied to a specific task that they're working on. there's, yeah, we're not helping them with something specific. It's very generic. And if you look at the guidelines that we put in place, we're saying that we shouldn't create generic health drawers. here's help on all kinds of topics that you might think of. Instead, it should be tied to helping the user perform a very specific task. , yeah, I want to take a deeper dive on the metrics that we've got. Because we also start getting metrics and all of the links inside the drawer. we can see when the user clicks into the drawer itself, what are they reading about? And far, it looks the leading links are CI example. And also the YAML reference, which is something that we would expect. Let's start it. I have to repair off. It's my first step on you, Cat. I can't discipline her. She's just climbing a lottery. Yeah, I want to take all of this data. And I don't know, maybe we could do some additional solution validation as together some qualitative data around this. But my next step I think would be to do some experimentation there with the content and try different ways of surfacing different information.",
      "tokens": [
        51064,
        3996,
        551,
        286,
        1415,
        281,
        2073,
        307,
        926,
        51204
      ],
      "temperature": 0.0,
      "avg_logprob": -0.33514763758732724,
      "compression_ratio": 1.5805084745762712,
      "no_speech_prob": 0.0005015358910895884
    },
    {
      "id": 264,
      "seek": 92856,
      "start": 944.64,
      "end": 960.04,
      "text": "Yeah, we learned that it seems it's not. It's probably not helping our users as much as we thought it were. I will be looking into it and be able to do that. Hopefully we can improve it from there.",
      "tokens": [
        51168,
        865,
        11,
        370,
        1936,
        321,
        3264,
        300,
        309,
        2544,
        411,
        309,
        311,
        406,
        13,
        51352
      ],
      "temperature": 0.0,
      "avg_logprob": -0.23774706033559945,
      "compression_ratio": 1.46448087431694,
      "no_speech_prob": 0.000183525204192847
    },
    {
      "id": 268,
      "seek": 95492,
      "start": 969.76,
      "end": 974.56,
      "text": "Cool. Do we want to move on to the research section?",
      "tokens": [
        51106,
        8561,
        13,
        51156
      ],
      "temperature": 0.0,
      "avg_logprob": -0.3885995168534536,
      "compression_ratio": 1.3443708609271523,
      "no_speech_prob": 0.0008574872626923025
    },
    {
      "id": 270,
      "seek": 95492,
      "start": 978.8,
      "end": 1010.3199999999999,
      "text": "Yeah, just a general update. There have been no shows. People are not showing to sessions. And it's just a larger trend. We think related to the changing of seasons. It's not you or our recruitment, it's just a general trend across all studies. I thought that would be helpful. And then I have just a couple of check ins. There are, oh, Nadia, do you want to talk?",
      "tokens": [
        51558,
        865,
        11,
        370,
        445,
        257,
        2674,
        5623,
        13,
        51692
      ],
      "temperature": 0.0,
      "avg_logprob": -0.3885995168534536,
      "compression_ratio": 1.3443708609271523,
      "no_speech_prob": 0.0008574872626923025
    },
    {
      "id": 279,
      "seek": 101264,
      "start": 1013.64,
      "end": 1020.4399999999999,
      "text": "No, I'm just making a joke. Maybe it's not a career retrograde or something. Exactly.",
      "tokens": [
        50414,
        883,
        11,
        286,
        478,
        445,
        1455,
        257,
        7647,
        13,
        50514
      ],
      "temperature": 0.0,
      "avg_logprob": -0.45698841508612575,
      "compression_ratio": 1.5585106382978724,
      "no_speech_prob": 0.001466273213736713
    },
    {
      "id": 282,
      "seek": 101264,
      "start": 1024.44,
      "end": 1123.84,
      "text": ". And then, and then if you guys could go into and link the research, the studies that you've been doing, yeah, the research studies you've been doing that I should include in the registry and synthesis. I'm still really wanting to do that to go through. if you have them and you link them in that issue, that's where I go back through and do a, a crosswalk of all the findings for the studies in terms of our big research questions. We put those together when I first started. And then because we validated our product direction with the, the KUMKON survey, we're good with those questions. it's just, if you have other studies that you've completed or when you do, just a reminder, because I was thinking about it. And then if you can go back through and just take out the studies or either delete them from those tables or just say finished, that'd be good. Not, not. I won't beg you, but that'd be awesome, but it's not that great. , , I can try to figure it out. And then just also that our team looked just really great. good job, everyone with the OptiProduction Survey. If you look in that async issue, you can see that we're getting all this cross-functional feedback. And people are just saying , great job. You're, you're team did a great job on this. , .",
      "tokens": [
        50954,
        1033,
        13,
        51004
      ],
      "temperature": 0.0,
      "avg_logprob": -0.45698841508612575,
      "compression_ratio": 1.5585106382978724,
      "no_speech_prob": 0.001466273213736713
    },
    {
      "id": 304,
      "seek": 111904,
      "start": 1129.84,
      "end": 1134.56,
      "text": "Nice. Anyone have anything else they want to chat about?",
      "tokens": [
        50904,
        5490,
        13,
        50968
      ],
      "temperature": 0.0,
      "avg_logprob": -0.3207676161581011,
      "compression_ratio": 1.308724832214765,
      "no_speech_prob": 0.0029604288283735514
    },
    {
      "id": 306,
      "seek": 111904,
      "start": 1138.6399999999999,
      "end": 1147.2,
      "text": "No? , great. , thank you both. And yeah, speak to you soon. All . Bye.",
      "tokens": [
        51344,
        883,
        30,
        1033,
        11,
        869,
        13,
        1042,
        11,
        1309,
        291,
        1293,
        13,
        51532
      ],
      "temperature": 0.0,
      "avg_logprob": -0.3207676161581011,
      "compression_ratio": 1.308724832214765,
      "no_speech_prob": 0.0029604288283735514
    }
  ],
  "full_text": "Hi everyone and welcome to the CICD UX Sync for June l4th or l5th depending on where you are in the world. To start with I'll go through the general slash manager announcements. Hi, I'm put here to review the the OKR's progress and asks if anything is blocked or at risk and no one has written anything that's good. There's a reminder that there's a family and friends day on June 24th and also a reminder that be doing mid year check ins and hyenas created a tracking issue. this is team member lead check ins to assess how things are going from both the team member and managers point of view to share feedback and help improve performance and development plans. make sure to dedicate an upcoming one on one with hyena and do this before July 22nd. And another announcement is welcome to Emily who is be the product designer on the release team. get welcome Emily or really happy that you're here. And I just added a small notes I will be in Europe for two months starting next week. I'll be taking a couple days off to deal with the jet lag some of those fall on public holidays and family and friends days, but I might ask the channel to cover for me. But I'm not expecting anything major. Cool, I'll just quickly go over Gina's items. Gina says that the artifacts page research is complete and that they're move forward with the page but have gotten a lot of great feedback that will be incorporated into the NBC. she's working on updating the list now. And Gina is also working on a survey to validate artifacts jobs we've done and has collected about 8O responses and be analyzing the data in l5 to air cuts. Did you want to voice your comment? Yeah, I just wanted to ask the question of there was some difference that Jackie was talking about between self manage and SAS users. And I was just very curious. if she could respond there that would be awesome. Next from Gina is the new runner list for your research, which is in progress. she's done unmoderated research and it was purely on quantitative data on the usability of the new view versus the old view and she's holding sessions with customers to get qualitative feedback in a couple of weeks as . And last thing from Gina is John's update if you're working with upgrades at all upgrading get lab runner, for example, we now have an icon to represent them. that's cool. Sweet, I'll move on to my stuff. I recently completed the analysis for solution validation for the container registry cleanup policies. This feature allows you to set policies to automatically remove items from the registry to save storage space. And this is very similar to previous solution validation I've done for the packet registry. They're not super surprising, but one thing that I didn't anticipate is that users want to make a template of their policies and apply them to other projects. Erica, you had a comment. I think that's awesome. And I want us to be able to elevate that in a report brief way. That's just what I would have done in a previous role would be to make a really quick summary. You have that actionable insight. And maybe we should just think through how we bring together all the work around the library. we could link it to that foundational research issue I had or whatever you... Yeah, but we should elevate it. Yeah, yeah, hi Nadia. We've already started going through the agenda just . Sure. When you say, Erica, when you say pull that out into a separate report brief, what exactly does that mean? It would be instead of the lead, instead of you leading with we did this study on that, it would be here's the highlight of a learning related to templates that might be helpful for us to keep in mind as we think about a shared resource library. Yeah, that makes sense. I'm just wondering would that be in Dovetail or would that be on an issue? I don't think we would put it in Dovetail because I think we want to get engineers engaging with it more. And maybe you could take the lead in thinking through the things that we would want. As each of us discovered that the things that we would want to report out, but I looked at it briefly and it was , I noticed you asked about which level, project team or group, if they had feedback that or just this general idea that they love infrastructure as code. Yeah, I'm wondering how, because this fits in with the resource library stuff as you were mentioning before. And I'm just wondering , yeah, how do I socialize that? What's the best way? Maybe we make an epic and then everyone can link to that. I don't know, a meta issue that it doesn't get swamped. We can think about it. Yeah, we don't have to solve it on this call, but that is maybe an action item. I'll mark that after this. My next item is in l52, be implementing a feature that release with a small subset of users and monitor with snowplow tracking. And the reason is we've done two rounds of validation, but we're still not certain if this is disruptive to people's workflows. we're taking a pretty cautious approach. I've done this at other companies, but I've never done it at GitLab. and my front-end engineer is also new to GitLab. figure out this together. But yeah, I'll let you all know how that goes. My next point, I've been doing the touchpoints interviews for a package and I consistently am hearing from customers that the integration with package and release could be better. I had a one hour call yesterday and I captured the feedback on an internal note. I'm not sure if you all are be able to see it. But , I would really to work with Emily when she's maybe a little bit more on boarded to improve this. Nadia, do you want to voice your question? Yeah, I'm curious to hear if you're already seeing some opportunities there. Do you have any ideas for how we could better integrate those two areas? Yeah, totally. , it's quite a lot of manual process and a lot of boilerplate code that people need in the pipeline and what people are expecting is that they couldn't create a package in the pipeline and just mark the package as a release and they don't need to do extra steps. And for the more people want to be able to see that a release the actual artifact of the release comes from the package registry and a link to that because the package registry has a lot more in-depth information for auditing and stuff. And at the moment, when you're going on the release page, you download the artifact and that's it. You don't even know necessarily that it came from the package registry and there's this whole wealth of information. it seems ignoring the technical side, the opportunity is quite clear, but I'm sure there's probably some technical reasons why it is the way it is. Yeah, thanks, Anne. Thank you. My next item, I'm starting to plan for l5-2 and I think there's some opportunities to start getting some of these research projects that we had in the validation backlog moving again. Specifically, we want to improve the package detail page because there's a lot more features we want to add to it. But we want to do some problem validation to understand what workflows people are. Why are the reasons that they're coming there? What are they trying to achieve? What's missing? What's painful? Just some foundational problem validation research before we start thinking about features. And my last point is continuing on my journey with data. try to implement the missing front end events tracking, that's click tracking for package. We are only tracking 2O% of the things that people click on at the moment. we have all these beautiful size and stashboards, but they're not painting a really good picture because we're missing a lot of the tracking. attempt that. I think it's be easy because I can just copy it from the code, but famous last words, . And that's it for me. I see. Are you guys writing something or do you want to keep the tree don't we? OK. All . in l5.3 and this milestone as , the remaining week, I'll be focusing on the pipeline components and the solution validation. Currently, I'm finishing up the interviews with internal users. And I've been talking to a lot of the members of our productivity engineering team. And far, the feedback that we've been getting has been very positive on our proposal. We are getting lots of ideas for improving the further iteration of the future. But it seems our direction, a lot of the choices that we've made far are on track and seem the desired behavior. And also, there's a lot of interest from the engineering productivity team to dog food or product. We already have an issue where we will be tracking that. we expect that we'll start the implementation in l5.4. If everything goes , depends on how quickly we can go through the planning breakdown. Of course, there can be an first-seen challenges. But let's hope. And then, yeah, and then we'll be able to dog food it with our productivity engineering team. they want to move to our new system for creating pipeline components and use our feature to standardize their components or CI templates. yeah, all of this is very exciting because we can really see how we'll be getting this into the actual product and dog fooding it with our own team. I can't not have been there. I wonder if you could think about setting up a quick and just real quick lightweight diary study for them or a Slack bot where you ask them, , what did you use it for today? Or , what went ? What could have gone better? Just to stream my in that feedback and make less work for you? I really the idea of a Slack bot. It hasn't occurred to me to do something that. My initial idea was to just have an issue, but I see how having something Slack that would be much easier for the engineers to just type their feedback in. maybe there's a way to somehow connect it. Maybe have a Slack bot and then somehow pull all of that into the issue because I want to make sure I can grab all of that information that is coming in and have a document is somewhere. But yeah, I think it's a really good idea. Yeah, just yeah, what went ? What didn't go ? What was your goal? Awesome. Thanks, Erica. Always with your nuggets of wisdom. I love it. . Another thing I wanted to share is around the recently edited guidelines for in product reference information using drawers. with edits and really basic guidelines, I was lining what content you should put into the drawers, what content you shouldn't put into the drawers and how all of that can be implemented either by pulling in the documentation directly to the drawer or you can also have your own custom content that you write, but it still has to adhere to the content guidelines for our documentation. And we want to store it in a markdown file in the docs repository. That is being done to ensure that we can test the changes to help content using the documentation pipeline because it does all kinds of helpful waiting and whatnot. following up on that, I'm revisiting the pipeline editor drawer to make it more helpful to our users. there's been a lot of hype around the pipeline editor drawer. I feel many people were interested in it , oh, it's nice. It's this help info and then we start tracking it. It's youthish. And honestly, it's very low compared to the oral pipeline editor usage. And I think there could be many different ways to interpret it. maybe our users just those toggle when they're going through the flow, which I don't think is the case. Or also maybe it's not very discoverable. It's not tied to a piece of the cat. , maybe it's not tied to a specific task that they're working on. there's, yeah, we're not helping them with something specific. It's very generic. And if you look at the guidelines that we put in place, we're saying that we shouldn't create generic health drawers. here's help on all kinds of topics that you might think of. Instead, it should be tied to helping the user perform a very specific task. , yeah, I want to take a deeper dive on the metrics that we've got. Because we also start getting metrics and all of the links inside the drawer. we can see when the user clicks into the drawer itself, what are they reading about? And far, it looks the leading links are CI example. And also the YAML reference, which is something that we would expect. Let's start it. I have to repair off. It's my first step on you, Cat. I can't discipline her. She's just climbing a lottery. Yeah, I want to take all of this data. And I don't know, maybe we could do some additional solution validation as together some qualitative data around this. But my next step I think would be to do some experimentation there with the content and try different ways of surfacing different information. Yeah, we learned that it seems it's not. It's probably not helping our users as much as we thought it were. I will be looking into it and be able to do that. Hopefully we can improve it from there. Cool. Do we want to move on to the research section? Yeah, just a general update. There have been no shows. People are not showing to sessions. And it's just a larger trend. We think related to the changing of seasons. It's not you or our recruitment, it's just a general trend across all studies. I thought that would be helpful. And then I have just a couple of check ins. There are, oh, Nadia, do you want to talk? No, I'm just making a joke. Maybe it's not a career retrograde or something. Exactly. . And then, and then if you guys could go into and link the research, the studies that you've been doing, yeah, the research studies you've been doing that I should include in the registry and synthesis. I'm still really wanting to do that to go through. if you have them and you link them in that issue, that's where I go back through and do a, a crosswalk of all the findings for the studies in terms of our big research questions. We put those together when I first started. And then because we validated our product direction with the, the KUMKON survey, we're good with those questions. it's just, if you have other studies that you've completed or when you do, just a reminder, because I was thinking about it. And then if you can go back through and just take out the studies or either delete them from those tables or just say finished, that'd be good. Not, not. I won't beg you, but that'd be awesome, but it's not that great. , , I can try to figure it out. And then just also that our team looked just really great. good job, everyone with the OptiProduction Survey. If you look in that async issue, you can see that we're getting all this cross-functional feedback. And people are just saying , great job. You're, you're team did a great job on this. , . Nice. Anyone have anything else they want to chat about? No? , great. , thank you both. And yeah, speak to you soon. All . Bye.",
  "word_count": 2722,
  "segment_count": 20,
  "cleaned_at": "2025-10-27T16:24:47.892665"
}