{
  "content": "Figma provisioning and deprovisioning\nGuidance on how to provision/deprovision Figma\nFigma provisioners/deprovisioners are found in the\nTech Stack YAML file\n.\nWhile multiple departments have team members with\nEditor\nroles as paid seats, the UX department is the business owner.\nFigma seats\nSeat types\nFigma has four different seat types depending on your needs:\nView:\nDefault seat type. Access is requested via Lumos but auto-approved.\nFull:\nFull access to all Figma products, including Figma Design, Figma Make, Dev Mode, Figma Draw, Figma Slides, and FigJam.\nDev:\nAccess to Dev Mode, Figma Slides, and FigJam. View and comment access in Figma Design files.\nCollab:\nAccess to FigJam and Figma Slides. View and comment access in Figma Design files.\nProvisioning\nAccess request issues\nEvery approved paid Figma seat must have a corresponding\nLumos access request\nwith budget approval. Seat upgrades can only happen with Okta access through Lumos and not by using the Figma admin or Figmas sharing tools.\nProvisioners are automatically pinged when a Lumos access request is opened. As a provisioner, ensure:\nThe team members manager has approved access.\nThe team member understands what seat option they need.\nA\nView\nseat is often enough when a team member only needs to view and comment on files to collaborate. All team members start with a\nView\nrole, so no action may be needed.\nThe difference between a\nFull\nand\nCollab\nseat can be confusing at first. Ensure the team member knows which seat they need in order to perform their role.\nThere is budget approval. Billing group admins should work with their Finance partners to ensure seat counts are not going over the maximum spend allocated for the fiscal year.\nQuarterly audits\nOur billing cycle includes quarterly true-ups. Each quarter, admins receive an email informing them of the upcoming invoice. This gives them an opportunity to review added seats before approving the new invoice.\nTo audit seats:\nReview all new seats and ensure each team member (or\nguest\n) has an approved access request.\nCreate a list of anyone who needs to be downgraded and reach out to IT for support (see steps under\ndeprovisioning\n).\nOnce downgraded users are complete, mark your billing group as\nReviewed\n.\nOnce confirmed, the Figma business owner will:\nLock in the final invoice amount.\nReach out to our Figma rep to share total seat counts for R&D, Marketing, and Sales. These will be added to line items on the invoice.\nEnsure the invoice is uploaded to Coupa and goes through our full Procurement process.\nDeprovisioning\nA user will automatically be fully deprovisioned when they are no longer with GitLab. Additionally, a paid seat can be downgraded to an unpaid\nViewd\nseat by reaching out to IT.\nWhen a member is fully removed:\nAnyone with can edit access to the members files will be able to continue editing and can move the files.\nTheir draft files stay within the organization and Figma admins can view and manage the files.\nFor more information, refer to Figmas\nRemove people from an organization\ndocumentation.\nLast modified October 10, 2025:\nUpdate file figma-provisioning.md (\n412946b7\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/product/ux/how-we-work/figma-provisioning/",
    "title": "Figma provisioning and deprovisioning | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:50:27.809183",
    "content_length": 3198,
    "section": "handbook"
  },
  "processing": {
    "original_length": 3198,
    "cleaned_length": 3192,
    "cleaned_at": "2025-10-27T16:13:42.417390",
    "processor": "text_cleaner_v1",
    "word_count": 528
  }
}