{
  "content": "CMOC Practice Events\nProvides overview of Support Engineering CMOC quarterly practice events and how to run them\nCMOC Practice Events\nSupport Engineering aims to conduct practice CMOC incident events globally every quarter. The exact date & time of each event (1 per region) will not be known to the CMOC ahead of time. This is to simulate the nature of live events being unexpected.\nPurpose\nThe practice events provide an opportunity to practice the activities and processes related to the CMOC responsibility. They are not a test that can be passed or failed, but rather a team exercise to gain experience, and an opportunity to iterate on the process and documentation.\nOutcomes\nFamiliarity with tools like Status.io so that in a real emergency theyre not a blocker to communication\nIncreased familiarity with the CMOC process and confidence in a live event\nFamiliarity with the incident room, Slack #incidents-dotcom channel and how communication is formalized between Incident Manager, EOC and CMOC during the course of an incident\nAn opportunity to retrospect and get live feedback from a friendly audience\nParticipants\na manager or senior support engineer will fulfill the role of the\nIncident Manager\n(and EOC if appropriate) and facilitate the practice event and scenario\na\nnote taker\n(another manager or senior engineer) will take notes of any learnings, improvements or gaps in documentation or process identified during the event\nthe rostered\nCMOC\nwill participate as though it were a live incident (but without the pressure of an actual incident or busy incident room!)\nPractice event tools, artefacts, references\nPractice event\nIssue template\nPractice Environment for status.io -\nstatus.io test\nEvent feedback template\n- coordinator of quarterly event creates a new version for the quarter\nScript library\n- confidential to Support Managers (and SEs who may carry out the Incident Manager role for practice events)\nCMOC workflow\nhandbook page\nIncident roles and responsibilities\nhandbook page\nHow to: Create and coordinate a quarterly practice event\nAssumption\n: a DRI has been assigned to act as the coordinator for the quarter. The following needs to be completed (or delegated for completion) by the coordinator:\nStart by creating a new practice event issue from the\ntemplate\nThe template includes instructions of other artefacts to create and how to schedule the events.\nLast modified June 2, 2025:\nrefactor incident management roles into roles vs teams (\n006d42ab\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/support/workflows/cmoc_practice_events/",
    "title": "CMOC Practice Events | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:50:43.281279",
    "content_length": 2541,
    "section": "handbook"
  },
  "processing": {
    "original_length": 2541,
    "cleaned_length": 2539,
    "cleaned_at": "2025-10-27T16:13:42.627235",
    "processor": "text_cleaner_v1",
    "word_count": 404
  }
}