{
  "content": "Marketing\nGitLab Marketing Handbook: Brand and Product Marketing, Integrated Marketing, Sales Development, Marketing Strategy and Platforms, Enterprise Data, Developer Relations, and Corporate Communications\nWelcome to the GitLab Marketing Handbook\nThe GitLab Marketing team operates as one team and is organized by the following departments:\nIntegrated Marketing\n,\nBrand and Product Marketing\n,\nMarketing Operations and Analytics\n,\nSales Development\n,\nEnterprise Data\n,\nCorporate Communications\n, and\nDeveloper Relations\n. This page documents our shared team philosophy and processes, while the individual department handbooks contain more detailed information.\nMarketing Purpose\nGitLab is the leading DevSecOps Platform that empowers organizations to deliver quality software faster and more efficiently while strengthening security and compliance. The marketing teams purpose is to amplify the value of the GitLab platform, authentically and transparently, by putting customers and the community at the center of everything we do.\nMarketing Alignment\nAs the GitLab Marketing team puts customers at the center of everything we do, the marketing strategy aligns with the customer journey. The journeys purpose is to provide a clear and cohesive experience to a prospect/customer from the minute they become\nAware\nof GitLab, to\nConsidering\nthe platform and\nConverting\ninto a happy customer, and then of course\nExpanding\nover time and becoming an\nEvangelist\n.\nEach stage has a purpose which is the guiding indicator for the marketing team to measure our success. Everything the team plans and executes in the short and long term will revolve around the customer journey, and we will also measure our success along each step to hold ourselves accountable.\nMarketing Strategy\nOur FY25 Marketing Strategy and Plan can be found in\nthe internal handbook\n.\nMarketing OKRs\nEach quarter, the Marketing team creates\nOKRs (Objectives and Key Results)\n.\nEach department within the Marketing team manages their own cascading OKRs. Team members can access the\nfiltered OKR search\n.\nHow we work\nValue-driven Marketing Team\nHow we work as one team aligns with the\nGitLab Values\n.\nResults\n- The team measures success together along the customer journey. Each quarter, we align CMO OKRs based on company goals set in the company OKRs. This helps us stay aligned with company-level goals while also understanding if what we are doing quarter over quarter is moving the needle on our marquee metrics along the customer journey. Being data-driven as a team is essential for team success.\nIteration\n- Like the rest of the company, we aspire to be agile and experimental where possible. In every area possible, we roll out campaigns, brand updates, messaging, etc. in small iterations, measure the success, and take next steps accordingly.\nTransparency\n- We strive to be as transparent as possible in all areas of marketing. We welcome thoughts and feedback from each other, other GitLab team members, and the community at all times.\nCollaboration\n- A major key to success is operating as one team. Leveraging the different backgrounds, cultures and, skill sets of an entire company and community, the marketing team operates in a way where everyone can contribute. Collaboration is key to taking Marketing to the next level.\nDiversity, Inclusion and Belonging (DIB)\n- With GitLab team members being located across the world, we strive to always keep DIB at the core of everything we do. Like the rest of GitLab, we follow asynchronous meeting principles, welcome diverse perspectives, and as marketers, foster an environment where quirkiness is welcomed.\nEfficiency\n- We keep efficiency at the forefront of everything we do. Whether it is bringing in marketing technology to automate menial tasks and foster collaboration, finding ways to save cost, or simply doing the right things to be respectful of others time, efficiency drives faster results for marketing.\nTeam Meeting Cadence\nMonthly Marketing All Hands (All Marketing team members)\nGoal\n: Align all Marketing team members on activities in progress to achieve our goals, and update the team on cross-functional items.\nThe meeting is 50 minutes and runs as follows:\nAlways begin by welcoming our newest GitLab Marketing Team Members\nCelebrate well-deserved promotions\nCMO Top of Mind (5 items per month)\n20 minutes of CMO Leadership sharing updates\n20 of either marketing team member updates (to be added during the call for items announcement prior) or special guest from another GitLab org\nThe remaining time for Q&A and most importantly...recognition!\nAll team members are encouraged to bring forward discussion topics that they want to share with the team or to have covered during the call.\nQuarterly CMO Q&A (one session for each department)\nGoal\n: Provide the team a smaller forum to ask any questions they may have, offer feedback, and brainstorm ideas directly with the CMO\nWeekly CMO Leadership Direct Reports Team Meetings (Each manager with their direct team)\nGoal\n: Foster an environment to empower managers overseeing different functions to collaborate and share ideas and feedback.\nWeekly Direct Reports Meetings (Each manager with their direct reports)\nGoal\n: For managers to work with direct reports on removing roadblocks, brainstorming, coaching, and providing/receiving feedback.\nContacting Marketing\nGetting Help by Common Topics\nTopic\nWhere to reach out\nSub-Team\nBlog posts, webcasts, the newsletter or other marketing content\n#content\nContent\nSwag\n#swag\nBrand\nDesign requests, logo usage questions\n#marketing-design\nBrand\nExternal PR (public relations) agency, discuss GitLab media mentions, and evaluate speaking/podcasting/commentary opportunities\n#external-comms\nCorporate Communications\nAnything regarding the marketing website and website development\n#digital-experience-team\nDigital experience\nQuestions about tools in the\nmarketing tech stack\n, evaluating new marketing tools, marketing system process improvement\n#mktgops\nMarketing Operations\nRules on\nlegally compliant language\nfor marketing communications (\ninternal only\n)\n#mktgops\nMarketing Ops\nSalesforce\n#sfdc-users\nSales Operations (not marketing)\nA complete list of marketing slack channels can be found\nhere\n.\nGeneral Questions and Feedback\nGitLab Marketing public issue tracker\n; please use confidential issues for topics that should only be visible to team members at GitLab\nSlack channel\n; please use the\n#marketing\nSlack channel for questions that dont seem appropriate to use the issue tracker\nCMO Requests\nPlease follow the\nCMO handbook\nfor review request workflows, and communication guidelines.\nSocial Requests\nAll teams are responsible for requesting social posts themselves. If you are not the DRI on a specific category or campaign and want to request a social post, please reach out to the teams point person identified below as a first step. Team Members in these roles reserve the right to say no to your request. If they say yes, coordinate with them to\ncreate a new social request issue\nso that the social team can process the request and schedule the post(s). The point person on the team or a member of the marketing or social teams may adjust copy to ensure consistency in brand voice.\nEvents: Jr. Content Editor\nRelease & technical posts/product updates:\nTechnical writing\nUser questions/comments on Twitter/X:\nSocial Marketing\nor\nDeveloper Relations\nteam\nLeadgen campaigns:\nContent\nteam\nUX Design: UX Lead\nPress/media coverage: Post in\n#external-comms\nfor assistance from the\nCorporate Communications\nteam\nSocial media, reshares of mentions, CEO Statements/posts: Post in\n#social_media_action\nfor assistance\nCompany Spokesperson\nSpeaking on behalf of GitLab at a conference, to media or on a podcast as a GitLab team member is a significant responsibility. Please see the\nCorporate Communications Handbook Page\nfor guidelines and trainings.\nBlog post editing\nProduct release posts:\nProduct team\nTechnical community posts/tutorials:\nDeveloper Advocacy\nand\nBlog editorial\nteam\nCEO statements/updates:\nCMO\nAll other blog posts:\nBlog editorial team\nGuidelines for how to pitch and submit a blog, including templates and formatting, can be found in the\nBlog Handbook\n.\nNewsletter\nMarketing Newsletter\nMarketing and the Editorial team send out a monthly developer newsletter, called DevSecOps Download, to our\nnewsletter subscribers\n. The newsletter always includes information about the latest release post, links to our latest blogs, plus additional content for DevSecOps teams. The goal for this newsletter is thought leadership and awareness.\nTo add a content suggestion, please create an issue with DevSecOps Download Content: [subject] in the title (no template necessary) and tag @sgittlen (Sandra Gittlen, Blog Managing Editor). Anyone in the company can add suggestions, but the Blog Managing Editor will determine the final content.\nOther Newsletter\nTo request a newsletter to be sent to an audience outside the\nnewsletter subscribers\n, please create an issue in the\nCampaigns project\n, using the\nrequest_email_newsletter\nissue template.\nNewsletter requests should be submitted no less than 5 business days before the intended send date to ensure there is enough time for Content and Marketing Programs Managers (MPM) review and set up workflow.\nCommunity Newsletter\nThe community newsletter is managed by the\nDeveloper Relations\nteam, dedicated to sharing relevant developer content, highlighting contribution opportunities, and updating community members on upcoming events. We aim to keep our contributors involved and connected with the wider community. This newsletter will not be used to drive or generate leads.\nTo submit to the newsletter, please follow the\nhandbook instructions\n.\nSponsorship\nWe are happy to sponsor events and meet-ups where a marketing benefit exists, subject to approval by\nRegional Marketing\nManagers. These sponsorships may be in cash or in kind, depending on individual circumstances.\nOrganizational or project sponsorships may also be considered where a marketing benefit exists. Typically, these sponsorships will be in kind - e.g., developer time commitments, or\nsubsidized / free GitLab licenses\n.\nCash sponsorship of projects or organizations may be considered only in exceptional cases - for example, if a project or organization that GitLab depends on is struggling to survive financially.\nMarketing Slack Channels\nWe use Slack internally as a communication tool. The Marketing channels are as follows:\n#marketing\n: General marketing channel. Dont know where to ask a question? Start here.\nmarketing-team-internal\n: (Private) Read-Only channel for marketing team members, with the ability to post comments. CMO staff has the ability to post. Should a team member want to make a post, please reach out to our Marketing EBA with your written statement and as much as possible, provide an issue or MR with more details.\n#brand\n: Connect with Brand Strategy, Brand Marketing, and Brand Design here.\n#brand_video\n: Video production and marketing support.\n#cfp\n: All event call for papers will be posted here. Learn more in the\nspeaking resources\nhandbook.\n#cmo\n:\nCMO review requests\nand content shares.\ncmo-staff\n: (Private) CMOs private staff discussion room\n#content\n: Questions about blog posts, webcasts, the newsletter or other\nmarketing content\n? This is the place to ask.\n#developer-relations\n: A channel for the\ndeveloper relations\nteam to collaborate.\n#dev-advocacy-team\n: Discuss the latest tech in DevSecOps and Cloud-Native with the\nDeveloper Advocacy\nteam. You can request speakers, customer consultancy and technical content collaboration and guidance.\n#digital-experience-team\n: Channel for connecting with the\nwebsite development and design teams\n#digital-marketing\n: Channel for all advertising, website analytic and general digital programs.\n#external-comms\n: To collaborate with our external PR (public relations) agency, discuss GitLab media mentions, and evaluate speaking/podcasting/commentary opportunities.\n#marketing-design\n: Discuss, feedback, and share ideas on\nMarketing Design\nhere.\n#marketing-campaigns\n: Discuss, ask questions, stay up-to-date on\ncampaigns\nand events that are being organized by the Marketing Program Managers\n#mktgops\n:\nMarketing Ops\ncommunication channel for questions and project updates\nmktg-budget-holders\n: (Private) Discussion among all Marketing team members with budget responsibility\n#product-marketing\n: Discuss, feedback related to product news, features and vision\n#regional-partner-marketing\n: Discuss, ask questions, stay up-to-date on events that are being organized by Regional Marketing, and Channel Marketing\n#remote\n: Discuss and share impressions on remote work experience, playbook and strategy.\n#sales_dev_global\n: Place for the sales development team to brainstorm amd share ideas. Please refer to the\nregional Slack channel list\nto reach SDR/BDR teams in AMER, EMEA, APAC.\n#sfdc-users\n: Having issues with SFDC? Ask here first.\n#social_media_action\n: Use this channel to communicate and coordinate with the\nSocial Marketing\nteam. You can ask for amplification help and share cool tweets, posts, etc.\n#swag\n: Request or question regarding swag.\n#website\n: Discuss topics related to website redesign project\nAutomated channels with feeds from different sources:\n#developer-advocacy-updates\n:\nZapier workflows\nautomatically post GitLab blog posts, Developer Relations social shares, competitive insights, Common Room updates, etc.\nhn-mentions\n: Hacker News post feed, automated with\nZapier\nand maintained by the Developer Relations team.\nsocial_media_posts\n: Automated social media post feed.\nMarketing email alias list\nAnalysts@ company domain: external email address for contacting Analyst Relations at GitLab. Replies are forwarded to Analyst Relations manager and VP Product and Product Marketing\nCommunity@ company domain: external email address for sending confirmation emails related to GitLab products. Replies are forwarded to Zen Desk support\nContent@ company domain: external email address associated with management of our SlideShare account. Replies are forwarded to Content Marketing team and Marketing OPS Manager\nEvents@ company domain: external email address for sending live, VIP & in-person training related emails. Replies go to Regional Marketing Managers and Marketing OPS Manager\nRregionalmarketing@ company domain: external email address for requests to the worldwide Regional Marketing team\nGiveaways@ company domain: external email address for receiving content & social media related promotional giveaways. Replies go to Content Marketing Team and Marketing OPS Manager\nLeads@ company domain: external email address for internal Lead alerts. Replies go to Marketing OPS Manager\nNews@ company domain: external email address used to send newsletter. Replies go to Marketing OPS Manager and Manager, Content Marketing\nMPM@ company domain: external email address used to send direct generic requests to the Marketing Program Managers\nMarketingOPS@ company domain: external email address used to direct generic operational requests to Marketing OPS Manager\nMarketingSFDC@ company domain: external email address associated with management of Salesforce. Replies forward to Manager, Digital Marketing Programs; Regonal Marketing Manager; Product Marketing Manager; and Manager, Content Marketing\nSecurityAlerts@ company domain: external email address used to send security alerts. Replies go to Marketing OPS Manager\nSponsorships@ company domain: external email address used to manage sponsor requests from community. Replies forward to Developer Relations Team\nSupport@ company domain: external email address for sending Breaking Change and/or support related customer communications. Replies go to Zen Desk support\nSurveys@ company domain: external email address for sending the Developer Survey and/or related surveys. Replies go to Content Team and Product Marketing Manager\nWebcasts@ company domain: external email address for sending webcast related emails. Replies go to Marketing OPS Manager and Marketing Program Managers\non24questions@ company domain: external email address used for collecting privately asked questions in On24 webinars\nGet to Know the Marketing Team\nMarketing Team READMEs\nGet to know the people who work in GitLabs marketing team by visiting our\nREADMEs\n.\nLearn about the Marketing Departments\nMarketing Functional Conversations are modeled after Group conversations. While Group Conversations offer high-level insights, Marketing Functional Conversations are meant to drill deeper into the various functions within the Marketing Department. The goal of Marketing Functional Conversations is to create increased awareness and mutual understanding of the functions within Marketing. Awareness and understanding is an essential building block for effective collaboration.\nRecordings of the Marketing Functional Conversations can be found on the\nGitLab Unfilitered YouTube Channel\nBrand and Product Marketing\nProduct and Brand Marketing represents the GitLab story at the brand, solution, product, and technical levels. We accelerate GitLabs path to market by developing market insights, leadership positioning, messaging, and narratives that elevate our brand, show value in our solution, and fuel demand for our platform. We activate brand ambassadors and customer advocates to show momentum and trust in the market. The team includes Solutions & Product Marketing, Brand Marketing, Design, and Content.\nHandbook\nHandbook Links\nBrand\nMerchandise Handling (Swag)\nProduct and Solution Marketing\nCore Product Marketing\nCompetitive Intelligence\nAnalyst Relations\nCustomer Advocacy\nDesign\nContent\nIntegrated Marketing\nThe Integrated Marketing team is focused on creating awareness, generating demand and collaborating with the broader ecosystem globally, through a co-ordinated and unified approach. We connect the dots and bring content and messaging to life by leveraging various channels as our levers to communicate across segments, regions and personas.\nThe team includes\nRegional Marketing\n,\nGlobal Channel Marketing\n,\nCorporate Events\n,\nAccount Based Marketing\n,\nIntegrated Campaigns\n,\nLifecycle Marketing\n,\nDigital Strategy\nand\nDigital Experience\n.\nHandbook\nHandbook Links\nRegional Marketing\nChannel Marketing\nCorporate Events\nAccount Based Marketing\nIntegrated Campaigns\nLifecycle Marketing\nDigital Strategy\nDigital Experience\nMarketing Website\nSales Development\nThe\nSales Development\norganization is focused on serving the needs of prospective customers during the beginning of their buying process.\nThe Sales Development department is composed of 2 groups: the SDR team who handles all the inbound interest and the BDR team who specializes in outreach of prospective customers.\nWhen prospective customers have questions about GitLab, the SDRs assist them or connect them to a technical team member as needed. During the initial exploration, if the prospective customer is interested in continuing their exploration of GitLab, SDRs will connect them to an Account Executive (AE) or Strategic Account Executive (SAE).\nBDRs contact people who work at large organizations to uncover or create early-stage sales opportunities for GitLab SAEs. The BDR team will plan with their paired Sales counterpart to approach interesting accounts and develop a plan for prospecting including contact discovery, understanding enterprise-wide initiatives that GitLab could assist with, and ensuring accurate data quality of accounts and contact in salesforce.com.\nHandbook\nMarketing Operations and Analytics\nMarketing Operations and Analytics\nincludes Marketing Operations, Marketing Analytics, and Globalization and Localization. The team focuses on enabling efficient operations and actionable analytics insights, working across all Marketing teams. The team also owns the MarTech stack used by Marketing.\nHandbook\nHandbook Links\nMarketing Operations\nMarketing Strategy & Analytics\nGlobalization & Localization\nEnterprise Data\nThe GitLab Enterprise Data Team is responsible for empowering every GitLab team member to contribute to the data program and generate business value from our data assets.\nHandbook\nDeveloper Relations\nDeveloper Relations drives platform awareness and adoption by reaching deep into wider communities and engaging developers where they are. GitLab currently engages with more than 3000 developers every month on GitLab.com alone, and receives more than 250 contributions every month, giving us a unique level of influence in the DevSecOps space and helping accelerate our innovation. Our ultimate goal is to raise awareness of GitLab and drive customer success by winning the hearts & minds of developers through best-in-class technical enablement and an active community of contributors.\nHandbook\nHandbook Links\nContributor Success\nDeveloper Advocacy\nStrategy Programs\nEducation Program\nOpen Source Program\nCorporate Communications\nThe mission of GitLabs Corporate Communications team is to amplify GitLabs product, people and partnerships in the media, via social media channels and through award wins. This team is responsible for global public relations (PR), social media, and executive communications (speaking).\nHandbook\nHandbook Links\nSocial Marketing\nSpeaking Resources\nIncident Communications Plan\nMarketing Calendar\nFY25 All-Marketing SSoT Calendar\nThe marketing team utilizes a\nsingle all-marketing calendar\nwhere everyone can contribute, and we can answer key questions (using pre-set filter views) related to upcoming marketing plans. Note: this calendar links to our internal handbook page.\nPlease do not filter the entire doc. Instead, you may use pre-set filter views (click down arrow selector next to the filter icon on the bookmark bar) to see activities grouped by GTM Motion, segment, region, team, language, and more.\nIf there are other views you would find helpful, please feel free to duplicate an existing filter view, and include some sort of categorization (i.e. team, segment, etc.). You can do this by going to a similar filter view, and clicking on the top right gear icon, then selecting\nDuplicate\n.\nFor more information about adding events to All-Marketing SSoT Calendar, please\nclick here\n.\nMarketing Team Processes\nThis front page of the Marketing Handbook is intended to serve as the external face of the marketing team. Weve created a dedicated\nTeam Processes page\nthat is intended to house our internal processes, workflows, and guidances relevant internally to the marketing team.\nVisit the Page\nAccount Based Marketing\nAccount Based Marketing Handbook\nBlog Handbook\nEverything you need to know about suggesting and publishing a post on the GitLab Blog.\nBrand and Product Marketing\nGitLab Brand and Product Marketing Handbook\nChief Marketing Officer\nGitLab CMO Handbook: Review requests and communication guidelines\nCI/CD GTM Sales Plays\ndescription to add\nCMO Shadow Program\nGitLab Marketing Handbook: CMO Shadow\nCore DevOps Solutions\nCore DevOps Solution Definition A DevOps solution is:\nA customer problem or initiative that needs a...\nCorporate Communications Handbook\nMission Statement, What We do, Team Norms, Contact Info and Resources for Corporate Communications at GitLab\nDemand Generation\nDemand Generation at GitLab, including Marketing Campaigns, Digital Marketing, and Partner & Channel Marketing.\nDeveloper Relations\nThe Developer Relations team supports GitLab's mission by working with our community to ensure they receive support and recognition for contributing to GitLab.\nDigital Experience Handbook\nLearn more about the Digital Experience purpose, vision, mission, objective and more in this handbook.\nFY22 Marketing Plan\nFY22 Marketing Plan\nFY23 Marketing Plan\nFY23 Marketing Plan\nGitLab Event Information\nEvents at GitLab This page outlines details for in-person events. For virtual event information,...\nGitLab Marketing Team READMEs\nLearn more about working with various members of the marketing team\nGitLab Positioning FAQs\nWhat is GitLab? GitLab is an open-source, complete DevOps platform, delivered as a single...\nGlobal Channel Marketing\nGlobal Channel supports global channel sales objectives and provides support to the GitLab channel partner community and customers.\nGrowth Direction\nGrowth Section Overview The GitLab Growth section is dedicated to making it easier for teams to find...\nInbound Marketing Handbook\nInbound Marketing Handbook\nIntegrated Campaigns\nGitLab Marketing Handbook: Integrated Campaigns\nIntegrated Marketing\nIntegrated Marketing at GitLab\nIntra-Department Learning: Marketing Functional Conversations\nThe goal of Intra-Department Learning is to create, conduct, and host cross-department learning sessions to drive collaboration and understanding of marketing functional team priorities.\nJourneys\nIntroduction As a company we have to be great at providing multiple journeys. The contributor, user,...\nLifecycle Marketing\nLifecycle Marketing Handbook\nLocalization\nLearn more about the Localization team's vision and processes.\nMarketing - Emergency Response\nGitLab's email response process for marketing emergencies\nMarketing Analytics\nMarketing Analytics partners with Leadership and GTM teams to develop and execute the Global Marketing Strategy while owning the overall measurement framework.\nMarketing Career Development - Overview\nThis page details the marketing career development program.\nMarketing Department Efficiency Working Group - FY24\nThe Efficiency Working Group aims to identify and solution 3-5 key areas for efficiency improvement within the Marketing Department.\nMarketing Operations\nMarketing Operations (MktgOps) supports the entire Marketing team to streamline processes and manage related tools. Due to those tools, we often support other teams at GitLab as well.\nMarketing Project Management Guidelines\nSub Pages Organization - Groups and Projects Labels Epics Milestones Managing Commitment Issues...\nMarketing Strategy & Platforms\nLearn more about the Marketing Strategy & Platforms.\nMarketing Team Processes - How We Work\nThis page is meant to house resources and processes for the marketing team.\nPrescriptive Buyer Journeys\nPrescriptive Buyer Journeys\nRegional Marketing\nThe role of Regional Marketing at GitLab is to work closely with sales to support marketing messages & pipeline building at a regional level through in-person and virtual interactions.\nSales Development\nThe purpose of this page is to act as the homepage of the sales development org's handbook presence.\nSales Plays\nSales plays are designed to improve the quantity of opportunities and closed business with defined Land and Expand sales motions\nSMB Marketing\nWho we are SMB Marketing addresses the SMB Segment in support of SMB Sales, Sales Development (SDR)...\nTeam Member Social Media Policy\nThis is the GitLab employee social media policy\nThe Source Handbook\nEverything you need to know about The Source, GitLabs thought leadership portal.\nUser Engagement\nUser Engagement is one of GitLab's top 12 cross-functional initiatives. The goal is to strengthen our developer brand and increase contributors per month to GitLab.\nUTM Strategy\nEverything you need to know about our UTM strategy, which enables insights through the connected/resulting Tableau dashboards.\nVirtual Events\nAn overview of virtual events at GitLab including webcasts, virtual workshops, and external virtual events.\nLast modified October 22, 2025:\nUpdate from Community to Strategy programs (path and main page) (\n6ec47bdd\n)\nView page source\n-\nEdit this page\n-\nplease\ncontribute\n.",
  "metadata": {
    "url": "https://handbook.gitlab.com/handbook/marketing/",
    "title": "Marketing | The GitLab Handbook",
    "scraped_at": "2025-10-26T20:50:31.812433",
    "content_length": 27577,
    "section": "handbook"
  },
  "processing": {
    "original_length": 27577,
    "cleaned_length": 27564,
    "cleaned_at": "2025-10-27T16:13:42.301576",
    "processor": "text_cleaner_v1",
    "word_count": 4005
  }
}